/*
Who			When		What
---			--------	----
YKL			23/06/16	#COMPOSTR: changed the Priceline code to use common postrans.h. 
						Added few structs. Some conflicts were resolved by #ifdef PRJ_PRICELINE
YKL			12/05/16	#452297: 90/1C is not needed.
YuliaB      04/05/16    FSD448663 Polling File Ingevoucher - added info transaction 90x1D.
YKL		    21/04/16	#452297: promotion apportionment (priceline)
Hila		04/04/16	BUG 451799 - message on total for tender promotion is not displayed when customer language <> store language
YuliaB      30/03/16    FSD450223 - added new flag 'bReportPrintingRequired' to the transactions TRANS_FLOAT(0x07) and TRANS_CASH_LIFT(0x09).
DrorBa      28/03/16    FSD451172 New ASW-Fiscal Turkey(NCR)-Invoice Enhancements- add new transaction - 90x1A
Helena		10/03/16	FSD#442000 Credit allowed for invoice: new field "bCreditAllowedInv" in trs. 60xD0
JacoR       02/02/16    CR448058. Moneymarket Shoprite South Africa
Helena		01/02/16	FSD#450005_FlyBuyCardScanningCardEnhancement: new field "bDisplayCardIndicatorSegmentBCP" in trans. 60x3B
Helena		01/02/16	FSD#450005_FlyBuyCardScanningCardEnhancement: new fields "bFlyBuyAsSegmentBCP", "FixedSegment" in trans. 60x3B
DrorBa      26/01/16    FSD447653 New ASW-Fiscal Turkey(NCR)- add new transaction - TrsInfo4TaxDetails_
AlbertoA 	14/01/16	FSD 441887 StoreLine Online Food Stamps and Industry Cards

	,ccre_PP_additional_check //Give customer additional cheque credit
	,ccre_PP_credit_sale //Credit sale
	,ccre_PP_account_payment //Account payment
	,ccre_PP_account_reversal  //Account payment reversal
	,ccre_PP_additional_credit //Give customer additional credit
	,ccre_PP_allow_coupon_first //A coupon was the 1st item in the sale
	,ccre_SP_more_cpn_than_items //More coupon than items
	,ccre_SP_cpns_subtotal_less_0 //Sale total minus coupons is less than zero
	,ccre_PP_bypass_wic_winz_amt //Bypass WIC/WINZ amount
	,ccre_PP_bypass_wic_date //Bypass WIC/WINZ expiry date
	,ccre_PP_bypass_freq_shop //Bypass non Frequent Shopper
	,ccre_PP_invoice_details //Force Credit Return amount not equal to original invoice
	,ccre_PP_for_saved_trs //Save (suspend) transaction
	,ccre_PP_offline_save_recall_save //Save transaction while POS offline
	,ccre_PP_offline_save_recall_recall //Recall transaction while POS offline
	,ccre_PP_save_tran_tend  //Save transaction with partial tender
	,ccre_PP_for_recalled_trs //Recall transaction
	,ccre_PP_offline_supervisor_request //Offline supervisor request
	,ccre_PP_min_purch_cpn_print //Coupon printing: Minimum purchase for coupon printing
	,ccre_CP_for_minimum_purchase //Coupon printing: Minimum purchase 
	,ccre_PP_invoice_offline_mode //Invoice payment: recall in offline mode
	,ccre_PP_invoice_amnt_not_found //Invoice payment: invoice amount not found
	,ccre_PP_bypass_cashier_not_found //Sign on: cashier not found
	,ccre_PP_save_trs_log_off //Log off while having saved transactions
	,ccre_PP_no_sale_out_trans //No sale open drawer out of a sale
	,ccre_PP_no_sale_in_trans //No sale open drawer during a sale
	,ccre_PP_print_voucher_on_duplicate_receipt  //Print voucher on duplicate receipt
	,ccre_PP_offline_bad_account //Bad account authorization in offline
	,ccre_PP_cust_accnt_transaction //Customer account transaction
	,ccre_PP_scanning_qty_limit //Quanity entered with scanning 
	,ccre_PP_Liquor_license //Liquor license
	,ccre_PP_dep_age_restrict //Department age restriction
	,ccre_PP_bypass_bday //Bypass age valiation
	,ccre_PP_exceed_wic_amt //Exceeding WIC/WINZ amount
	,ccre_PP_manual_name_entry //Manual name entry
	,ccre_PP_sell_qty //Sell quantity
	,ccre_PP_can_sub_limit //Subtract amount limit
	,ccre_PP_max_amount_in_negative_ticket //Maximum amount in negative ticket
	,ccre_PP_can_sub_limit_amt //Cancel/subtract amount greater than limit
	,ccre_PP_staff_disc_min_purchase //Staff discount minimum purchase
	,ccre_PP_freq_shop_min_purch //Frequent shopper minimum purchase
	,ccre_SP_coupon99_out_of_ticket  //EAN 99 coupon out of ticket
	,ccre_PP_GC_CC_Errors //Gift Card sale error
	,ccre_PP_CC_acct_payment //	CC to check account payment against credit limit
	,ccre_PP_LayByCC_ModifyConditions //Modifying lay by conditions
	,ccre_PP_LayByCC_CancellationFee // CC for over-riding cancellation fee
	,ccre_PP_ofln_client // Offline member/client
	,ccre_PP_DiscBigPrice  // Price override greater than price
} CC_REASON;

//!yaron!
typedef struct OnLineTrsData_
{
  unsigned char FC;
  unsigned char opcode;
  unsigned char subopcode;
  unsigned short  pos_no;
  unsigned char option;
  unsigned short  count;
  unsigned char trs[TRANS_LEN];
} ONLINE_TRS_DATA;

//#45246 Transaction Type 
#define TRANSACTION_MODE_SALE			0
#define TRANSACTION_MODE_REFUND			1

//FSD45766
#define EXPENSE_BASIC_TRANSACTION		1
#define EXPENSE_BASIC2_TRANSACTION		10
#define EXPENSE_COST_CENTER_TRANSACTION 13

//FSD168932 Enhanced Payout Receipt On POS Avivp
//TD#293482 DidiO 
#define EXPENSE_ADDITIONAL_REF_TRANSACTION				14
#define EXPENSE_MILEAGE_CLAIM_TRANSACTION				15
#define EXPENSE_AUTOMATIC_MACHINE_TRANSACTION			16
#define EXPENSE_COMMENTS_TRANSACTION					17
#define EXPENSE_ADDITIONAL_REF_COMMENTS_TRANSACTION		18



//FSD168932 Enhanced Payout Receipt On POS Avivp
// Extra data for the expense code being used (for example supervisor approved privileges)
#define EXPENSE_SPECIAL_EXTRA_DATA						99


// FSD316298 - Storeline to HQ Upload Transaction Enhancement
#define EXT_LOYALTY_DATA_TOTAL							1
#define EXT_LOYALTY_DATA_TOTAL_2						2
#define EXT_LOYALTY_DATA_ITEM							3
#define EXT_LOYALTY_DATA_DEP							4

#define EXT_LOYALTY_DATA_MESSAGE_TYPE_1					1
#define EXT_LOYALTY_DATA_MESSAGE_TYPE_2					2
#define EXT_LOYALTY_DATA_MESSAGE_TYPE_3					3
#define EXT_LOYALTY_DATA_MESSAGE_TYPE_4					4
#define EXT_LOYALTY_DATA_MESSAGE_TYPE_5					5
#define EXT_LOYALTY_DATA_MESSAGE_TYPE_6					6

//FSD414790
//Fortress subfunction start
#define	FORTRESS_EXTENDED_WARRANY						0x01
#define	FORTRESS_PRICE_CHANGE			            	0x02
#define	FORTRESS_TRADE_IN1								0x03
#define	FORTRESS_TRADE_IN2								0x04
#define	FORTRESS_TRADE_IN3								0x05
#define	FORTRESS_TRADE_IN4								0x06
#define	FORTRESS_TRADE_IN5								0x07
#define	FORTRESS_TRADE_IN6								0x08
#define	FORTRESS_SERIAL_NUMBER							0x09
#define FORTRESS_REMARK_LINES									0x0A
//Fortress subfunction end

/*----------------------------------------------------------------------
This structure describes the transaction record tail part. The sturcture
of the tail is the same for all transaction types.
-----------------------------------------------------------------------*/
struct trans_tail_							//OFS	Description
{
    unsigned char nu;						//44	Keep for high byte part offset

	unsigned char TwoPO_checker_sign	:1;	//45	For 2 person operation
	unsigned char opt_master_trans		:1;	//45	Master transaction of events (FSD14741)
	unsigned char opt_fuel_test         :1; //45    Pump Test ticket (FSD58636) /  Bug#101812
	unsigned char bInfo					:1; //45
	unsigned char bShouldBeBadRecord	:1;	//45	//TD#336203
	unsigned char nu_flags				:3;	//45	Not used

    unsigned char ext_pos_no;				//46	External POS number
   
    unsigned char ext_device             :4;//47	External device number
    unsigned char quick_till             :1;//47	QUICK POS (Tesco)
    unsigned char dock_till              :1;//47	QUICK docking (Tesco)
    unsigned char opt_scanpoint_item_till:1;//47	SCANPOINT
    unsigned char nu2					 :1;//47    
    
    unsigned short ticket_no;				//48	Ticket number
    unsigned char date[3];					//50	Date (YYMMDD in BCD)
    unsigned char time[3];					//53	Time (HHMMSS in BCD)

    unsigned char opt_return_ticket :1;		//56	Return ticket
    unsigned char opt_training_mode :1;		//56	Training mode ticket
    unsigned char opt_pc_generated  :1;		//56	Record generated by MFS/LFS
    unsigned char opt_pos_offline   :1;		//56	POS was offline
    unsigned char opt_void_ticket   :1;		//56	Ticket was voided
    unsigned char opt_bad_record    :1;		//56	Ignore record
    unsigned char opt_store_count   :1;		//56	Store stock count TRS (Tesco)
    unsigned char opt_wastage_mode  :1;		//56	Tesco

    unsigned short cashier;					//57	Cashier number
    unsigned char pos_no;					//59	POS number
    unsigned short seq_no;					//60	Record sequence number

    unsigned char pc_no         :4;			//62	PC number (1 or 2) receiving TRS from POS
    unsigned char trans_version :4;			//62	TV number
    unsigned char qdx;						//63	QuickDex flags
};											//64

/*----------------------------------------------------------------------
This structure describes the general layout of a transaction record
-----------------------------------------------------------------------*/
struct trs_general_							//OFS	Description
{
    unsigned char opcode;					//0		Transaction record opcode
    unsigned char sub_opcode;				//1		Optional sub opcode
    unsigned char data[TRANS_LEN - 2 - TAIL_LEN];//2
    struct   trans_tail_  tail;					//44
};


/*----------------------------------------------------------------------
Opcode: 0x21
Start of ticket
-----------------------------------------------------------------------*/
struct trs_ticket_frame_					//OFS	Description
{
    unsigned char opcode;					//0		0x21 <Opcode Value="0x21" />

    unsigned char opt_start             :1;	//1		1:Start of ticket 0:not part of a ticket
    unsigned char opt_no_sale           :1;	//1		No sale (drawer open)
    unsigned char opt_negative          :1;	//1		TESCO
    unsigned char opt_eod_progress      :1; //1		TESCO
    unsigned char opt_save_trans        :1;	//1		Ticket was saved for later recall
    unsigned char opt_recall_trans      :1;	//1		Ticket was recalled
    unsigned char opt_void_trans        :1;	//1		Post-void
    unsigned char opt_tender_purchase   :1;	//1		Tender purchase ticket

    unsigned char opt_factura_ticket    :1;	//2		Not used (Guatemalla)
    unsigned char opt_wic_ticket        :1;	//2		WIC transaction
    unsigned char opt_freq_shop         :1;	//2		Frequent shopper ticket
    unsigned char opt_charge_payment    :1;	//2		Account payment
    unsigned char opt_reverse_payment   :1;	//2		Account payment reversal
    unsigned char opt_confirm_price	   	:1;	//2
    unsigned char opt_give_cash_only	:1;	//2		Return TRS: give cash only
    unsigned char opt_multi_tender_allowed	:1;	//2		Return TRS: allow multi tender

    unsigned char return_type;				//3		Return type number
    unsigned short ticket_no;				//4		Ticket number, in case Post-void - voided ticket number
    unsigned short void_ticket_no;			//6		In case Post-void: current ticket number
    unsigned short recall_ticket_no;		//8		Recall: the original (saved) ticket no.

    unsigned short factura_no;				//10	Guatemalla invoices
    //Was: unsigned char  factura_id[15];	//12	Guatemalla invoice
	unsigned char  factura_id[14];			//12	Guatemalla invoice
	
	unsigned char  opt_info_ticket		:1; //26	Information ticket
	unsigned char  opt_trans_continue	:1; //26	There is continue for this transaction
	unsigned char  opt_tender_swap	:1; //26	FS9797
	unsigned char  opt_recovered_ticket	:1;	//26	cr#8389	
	unsigned char  bATMTicket           :1; //26    FSD14667 
	unsigned char  bPriceQuote			:1; //26	FSD14089
	unsigned char  opt_qsr_ticket		:1; //26	FSD23831 QSR Save / Recall  - Indication that this ticket contains qsr items
	unsigned char  opt_cash_office		:1; //26	to indicatie that a no_sale ticket shouldn't be calculated in the no_sale reports.

    unsigned char wic_day;					//27	WIC info: day
    unsigned char wic_month;				//28	WIC info: month
    unsigned short wic_year;				//29	WIC info: year
             long wic_amount;				//31	WIC: amount 

    unsigned char store_no[3];				//35	Store number
    unsigned char recall_pos_no;			//38	Recall: original POS number
    
    // Garage flags
    unsigned char opt_balancing        :1;  //39	Drive off balancing ticket

	unsigned char bLayByTicket         :1;  //39    Lay by ticket (FS19171)

    unsigned char opt_drive_off        :1;  //39	Drive off
    unsigned char opt_fuel_test        :1;  //39	Fuel test
    unsigned char opt_family_favourite :1;  //39	Family_Favourite_Choices	
    unsigned char opt_store_count      :1;  //39	store_count (not Garage flag)
//#ifdef PRJ_ROW
//   unsigned char bRecallPrepay        :1;	//39  N#3269
//    unsigned char opt_take_away        :1;	//39
//#else
    unsigned char opt_eat_in           :1;	//39
    unsigned char opt_take_away        :1;	//39
//#endif    
    // Stuttafords flag
    unsigned char opt_account_cheque_payment :1;//40 
    unsigned char opt_charge_enquiry         :1;//40	
    unsigned char opt_account_payment        :1;//40	
    unsigned char opt_account_fast_payment   :1;//40	
    unsigned char opt_cred_reentry           :1;//40	

    unsigned char opt_self_scanning          :1;//40	Self Scanning ticket
    unsigned char opt_cash_templates         :1;//40	Cash Deposit / Withdrawal
    unsigned char opt_express_order          :1;//40	express ticket
    
    unsigned char opt_wic_issue_date   :1;	//41	Use WIC issue date
    unsigned char opt_coupon_ticket    :1;	//41	First item is coupon
    unsigned char opt_home_shopping    :1;	//41
    unsigned char opt_tender_ticket    :1;	//41	First item is a tender
    unsigned char opt_IH_payment       :1;	//41	First item is IH payment
    unsigned char opt_IH_purchase      :1;	//41	First item is IH purchase
    unsigned char opt_cash_purchase    :1;	//41	Cash tender purchase
    unsigned char opt_deposit_ticket   :1;	//41
    
    unsigned char home_shopping_origin_no;	//42	TESCO
    
	unsigned char opt_archive_ticket    :1; //42    FS1870 ENA
	unsigned char opt_esep_ticket		:2; //43	EASYSHOP and ExpressPoint
#ifdef PRJ_ROW
	unsigned char opt_customer_order    :1; //43	Customer orders
#else
    unsigned char opt_ManEntryHomeShop  :1; //43	Self Scanning voided ticket
#endif
    unsigned char opt_barcoded_tender   :1; //43	COINSTAR
	unsigned char opt_SelfScanningRescan:1; //43	Self scanning Rescan ticket         
	unsigned char opt_SelfScanningForceRescan    :1;	//43	Self scanning with Force ReScan 
	unsigned char opt_HomeShopping_Scanning      :1;	//43	STY - Home Shopping

    struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode: 0x01     TRANS_PLU_SALE
Item sale transaction
-----------------------------------------------------------------------*/
struct trs_plu_sale_						//OFS	Description
{
    unsigned char opcode;					//0		0x01 (or 0x91 for Stock Count, 0x92 for waste mode) <Opcode Value="0x01,0x91,0x92" />
																
    unsigned char code[7];					//1		Item number (BCD)

	unsigned char opt_ext_record		 :1;//8		Extension record 0x11 follows
    unsigned char opt_subtract           :1;//8		Item was subtracted	
    unsigned char opt_cancel             :1;//8		Item was canceled
    unsigned char opt_negative           :1;//8		Negative item
    unsigned char opt_was_cancelled      :1;//8		Fuel item sale canceled
    unsigned char opt_supplier_promotion :1;//8		Item flagged as being on suppler promotion
    unsigned char opt_staff_discountable :1;//8		The item department is flagged as staff discountable
    unsigned char opt_accept_price_override:1;//8		Price override done on this item

    unsigned char opt_item_on_sale       :1;//9		Item is on sale (via front office batch)
    unsigned char opt_price_override     :1;//9		Price override 
    unsigned char opt_manual_price       :1;//9		Price was keyed
    unsigned char opt_manual_price_alloewd :1;//9		Manual price allowed for item
    unsigned char opt_weight_from_scale  :1;//9		Weight read from scale (no manual weight entry)
    unsigned char opt_qty_is_weight      :1;//9		Weighted item sold
    unsigned char opt_qty_is_decimal_qty :1;//9		Decimal quantity item (e.g. meters)
    unsigned char opt_qty_is_fuel_gallons:1;//9		Fuel item sold in gallons

    unsigned char opt_chained_prv_item   :1;//10	Item was sold as a result of link to previous item
#ifdef PRJ_ROW
	unsigned char opt_ext_phone_card	 :1;//10	Next is TRS with the phone card handle #3365
    unsigned char opt_ext_6              :1;//10	PLU extension 6 record 0xD0 follows //FSD251772
	unsigned char opt_extra_code_sale    :1;//10	FSD245239 extra code sale transaction follows
#else // non ROW projects
    unsigned char opt_promotion          :1;//10	Item on promotion 
    unsigned char opt_reduction          :1;//10	Item on reduction
    unsigned char opt_offer              :1;//10	Item on offer
#endif
    unsigned char opt_non_merch          :1;//10	Non-merchandise item
    unsigned char opt_store_coupon       :1;//10	Store coupon item
    unsigned char opt_vendor_coupon      :1;//10	Vendor coupon item
    unsigned char opt_item_discount_flag :1;//10	Discounable item

    unsigned char opt_scanned_item       :1;//11	Item was scanned
    unsigned char opt_read_from_pc       :1;//11	Item read fron front office
    unsigned char opt_next_info			 :1;//11	Hooks: an informative record follows
#ifdef PRJ_USA
	unsigned char optNonRx				:1; //11	13919 - FSA Legal requirements for USA, bit for healthcare items
#else
    unsigned char opt_replacement_to_unitm :1;//11	Indication that this item was sold instead of an unknown item.
#endif
    unsigned char opt_ext_prom           :1;//11	Item on member promotion
    unsigned char opt_price_embeded      :1;//11	ROW: indicates that a tax exclusive price TRS follows
#ifdef PRJ_ROW    
	unsigned char opt_add_calc_price     :1;//11    Add calc price transaction
    unsigned char opt_grid_price_calc    :1;//11    Grid price calculation
#else
	unsigned char opt_phone_card         :1;//11	Phone card
	unsigned char opt_weightToQtyItem    :1;//11	Indicates this item is weight item and was sold as qty.
#endif

#ifdef PRJ_ROW
    unsigned char opt_trade_prom_disc    :1;//12    Confectionary 
	unsigned char opt_bill_payment       :1;//12    CR #22761
    unsigned char opt_bCustomerFee       :1;//12    FS3025 (Delivery and Pick&Pack fee item)
#else
    unsigned char opt_offer_discount     :1;//12	03 will follow
    unsigned char opt_offer_continue     :1;//12	continuation offer
    unsigned char opt_offer_first        :1;//12	01 & 03 will follow
#endif
     unsigned char opt_counter_dept       :1;//12	TESCO taken from dep struct
    unsigned char opt_return_2_stock     :1;//12	TESCO taken from return struct
    unsigned char opt_cost_plus          :1;//12	Cost plus item
    unsigned char opt_freq_shop_disc     :1;//12	Frequent shopper discount given
    unsigned char opt_FS_payment         :1;//12	Payment by food stamps allowed

    unsigned short dept;					//13	Department number
    unsigned char mult_sell_unit;			//15	MSU
    unsigned char return_type;				//16	Return type number
    unsigned char tax_ptr;					//17	Tax flags

    long          qty;						//18	Quantity sold
    long          price;					//22	Item price
    long          amount;					//26	Amount received for this item

    long          nt_price;					//30	ROW: Tax exclusive price
    long          nt_amount;				//34	ROW: Tax exclusive amount
    long          retn_surcharge_percent;	//38
    unsigned char product_code;			   	//42	TESCO: taken from department
    
    unsigned char opt_ext_2             :1; //43	PLU extension record 0x22 follows
    unsigned char opt_markdown          :1; //43	Markdown given on this item		FSD14741 - used this flag for different purpose.
    unsigned char opt_member_disc       :1; //43	Members as frequent shopper: discount given
    unsigned char opt_bottle_deposit    :1; //43	Bottle deposit/refund
    unsigned char opt_bottle_refund     :1; //43	Bottle deposit/refund
#ifdef PRJ_USA
	unsigned char optRx					:1; //43	13919 - FSA Legal requirements for USA, bit for prescription items
#else
    unsigned char opt_rep_code          :1; //43	Rep code captured (ROW)
#endif
    unsigned char opt_limit_qty_prom    :1; //43	A's	 Limited quantity promotion
	unsigned char opt_qty_case			:1; //43	Case Item Sales 

    struct   trans_tail_  tail;				//44	Transaction tail
};											//64


/*----------------------------------------------------------------------
Opcode: 0x02
Open department sale transaction
-----------------------------------------------------------------------*/
struct trs_dep_sale_						//OFS	Description
{
    unsigned char opcode;					//0		0x02 <Opcode Value="0x02,0x93" /> 0x93 - waste mode department trans

    unsigned short  dept;					//1		Department number

    unsigned char opt_ext_record		:1; //3		Trs 0x12 followed
    unsigned char opt_subtract          :1;	//3		Was subtracted
    unsigned char opt_cancel            :1;	//3		Was canceled
    unsigned char opt_negative          :1; //3		Negative item
    unsigned char opt_was_cancelled     :1;	//3		Fuel item sale canceled
    unsigned char opt_bottle_deposit    :1; //3		Bottle deposit/refund
    unsigned char opt_bottle_refund     :1; //3		Bottle deposit/refund
#ifdef PRJ_ROW								 
	unsigned char opt_scr_sls_flag      :1; //3		Pharmacy script 
#else
    unsigned char opt_accounting_flag   :1; //3		Barcode programming
#endif

    unsigned char opt_not_found_sell    :1;	//4		Sold after item was not found
    unsigned char opt_price_override    :1;	//4		Price override 
    unsigned char opt_manual_price      :1; //4		Price was keyed
    unsigned char opt_manual_price_alloewd:1; //4		Manual price allowed for item
    unsigned char opt_weight_from_scale :1; //4		No manual weight entry
    unsigned char opt_qty_is_weight     :1; //4		Weighted item sold
    unsigned char opt_qty_is_decimal_qty:1;	//4		Decimal quantity item
    unsigned char opt_qty_is_fuel_gallons:1;//4		Fuel item sold in gallons

    unsigned char opt_chained_prv_item  :1;	//5		Item was sold as a result of link to previous item
    unsigned char opt_as_cost_plus      :1;	//5		Cost plus
    unsigned char opt_promotion         :1; //5		Item promotion flag
    unsigned char opt_non_merch         :1;	//5		Non merchendise department
    unsigned char opt_store_coupon      :1;	//5		Store coupon department
    unsigned char opt_vendor_coupon     :1;	//5		Vendor coupon department
    unsigned char opt_dept_discount_flag:1;	//5		Discount allowed for this department
    unsigned char opt_FS_payment        :1;	//5		Payment by foodstamps allowed

    unsigned char opt_cost_plus         :1;	//6		Cost plus item
    unsigned char opt_ext_prom          :1;	//6		Item on member promotion
    unsigned char opt_staff_discountable:1;	//6		Staff discounts allowed
    unsigned char opt_counter_dept      :1;	//6		Counter department (TESCO)
    unsigned char dont_disp_weight_and_qty	:1;	//6		TESCO
    unsigned char opt_fee               :1;	//6		Service fee
    unsigned char opt_refund_dept       :1;	//6
#ifdef PRJ_ROW
	unsigned char opt_add_calc_price	:1;	//6		Add calc price transaction
#else
    unsigned char opt_dep_additional_data:1;//6
#endif
    unsigned char return_type;				//7		Return type number
    unsigned char tax_ptr;					//8		Tax flags
    unsigned char product_code;				//9		TESCO: taken from department
    unsigned char pre_pay_pump_no;			//10	PosPump : Pre-Pay		
    unsigned long cancelled_pre_pay_sync_no;//11	PosPump : Pre-Pay		

	unsigned char opt_surcharge         :1;	//15	Indicate surcharge department sale.
    unsigned char opt_deliveryCharge    :1;	//15	Indicate delivery charge department sale
    unsigned char opt_info              :1; //15	FS1866 DEP Sale apportionment (info flag)
	unsigned char opt_chargeAmountPerTaxCalculation:1; //15    Indicate dep sell apportionment trans (#10194)
	unsigned char opt_markdown			:1;	//15	FSD14741 - used this flag to indicate that this sale took part in promotion.
	unsigned char optRx					:1;	//15    13919 - FSA Legal requirements for USA, bit for prescription items
	unsigned char optNonRx				:1;	//15	13919 - FSA Legal requirements for USA, bit for healthcare items
	//unsigned char NU                  :1; //15	NU
	unsigned char opt_weightToQtyItem	:1; //15	TD#42705 GinatB - Indication of item is weight
    
    long          qty;						//16	Quantity sold
    long          price;					//20	Price
    long          amount;					//24	Amount received for this item

    long          nt_price;					//28	ROW: Tax exclusive price
    long          nt_amount;				//32	ROW: Tax exclusive amount

    long          at_qty;					//36
    long          retn_surcharge_percent;	//40

    struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode: 0x03
Discount/promotion tranasaction
-----------------------------------------------------------------------*/
struct trs_discount_						//OFS	Description
{
    unsigned char opcode;					//0		0x03 <Opcode Value="0x03" />

    unsigned char plu_code[7];				//1		Item number (if discount given to an item)
    unsigned short  dept;					//8		Department number 

    unsigned char opt_info_trans       :1;	//10	Ignore this transaction
    unsigned char opt_non_merch        :1;	//10	None merchendise item/department
    unsigned char opt_subtract         :1;	//10	Item was subtracted
    unsigned char opt_cancel           :1;	//10	Item was canceled
    unsigned char opt_negative         :1;	//10	Negative item
    unsigned char opt_upcharge         :1;	//10	Negative discount
    unsigned char opt_additive         :1;	//10	Additive discount
    unsigned char opt_deliv_charges    :1;	//10	Delivery charges (was progressive)

    unsigned char opt_manual           :1;	//11	Manual discount
    unsigned char opt_percent          :1;	//11	Percentage discount
    unsigned char opt_cost_plus        :1;	//11	Cost plus item/department
    unsigned char opt_FS_payment       :1;	//11	Foodstambable item
    unsigned char opt_store_promotion  :1;	//11	Not used
    unsigned char opt_ttl_trans_disc   :1;	//11	Ticket discount
    unsigned char opt_plu_trans_disc   :1;	//11	Item discount	
    unsigned char opt_dep_trans_disc   :1;	//11	Department discount

#ifdef PRJ_ROW
#ifdef PRJ_ROW_NEW_PROM
    unsigned char opt_promotion         :1;	//12	Promotion given; CR#38963
    unsigned char opt_reduction         :1;	//12	Reduction given		
    unsigned char opt_offer             :1;	//12	Offer given
#else
	unsigned char price_over_as_disc	:1; //12	Price override treated as discount
	unsigned char bPickPackFee          :1; //12    FS3025 - Pick&Pack fee  #436096: Used by Foodtuffs Wellington to indicate that a promotion requires a member card
    unsigned char bMinDeliveryFee       :1;	//12	FS3025 - Minimum delivery fee
#endif
#else
    unsigned char opt_promotion         :1;	//12	Promotion given
    unsigned char opt_reduction         :1;	//12	Reduction given		
    unsigned char opt_offer             :1;	//12	Offer given
#endif
    unsigned char opt_multisaver        :1;	//12	
    unsigned char opt_ext_promotion     :1;	//12	Extended promotion
    unsigned char opt_not_net_prom      :1; //12	None-netted promotion
    unsigned char opt_member_disc       :1; //12	Frequent shopper discount
    unsigned char opt_discount_flag     :1; //12	Item/department "discount allowed" flag. Used in cases of promotions

    unsigned char discount_type;			//13	Discount number
    unsigned long percent;					//14	Discount percent
    unsigned char return_type;				//18	Return type number
    unsigned char tax_ptr;					//19	Tax flags of discountable item

    long          qty;						//20	Item quantity
    long          price;					//24	Item price
    long          amount;					//28	Discount amount


#ifdef PRJ_ROW
#ifdef PRJ_ROW_NEW_PROM
    unsigned char opt_points_reward    	:1;	//32	Points given as reward;  CR#38963
	unsigned char bCustAccntDiscount    :1; //32    FSD16729 Customer Account discount
	unsigned char bExtTrs               :1; //32    Extended trs (future use)
#else
	unsigned char opt_extra_fee1       	:1; //32	Extra fee 1
	unsigned char opt_extra_fee2       	:1; //32	Extra fee 2
	unsigned char opt_fin_fee         	:1; //32	Finance fee
#endif
#else
    unsigned char opt_points_reward    	:1;	//32	Points given as reward
	unsigned char bCustAccntDiscount    :1; //32    FSD16729 Customer Account discount
	unsigned char bExtTrs               :1; //32    Extended trs (future use)
#endif
	
    unsigned char opt_automatic        	:1; //32	Automatic discount 
	unsigned char opt_delayed_prom     	:1; //32	Delayed promotion (LUCKY)
	unsigned char opt_report_as_tender 	:1; //32	Report discount as tender (LUCKY)
    unsigned char opt_not_net_fs		:1; //32	Non-Netted promotions/frequent shopper
	unsigned char opt_staff_discount   	:1; //32	Staff discount (ROW)
    
    unsigned char mult_sell_unit;			//33	Item MSU
	unsigned short tender;					//34	Tender number (LUCKY)
    long          nt_amount;				//36
    long          retn_surcharge_percent;	//40

    struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode: 0x04
Media transaction
-----------------------------------------------------------------------*/
struct trs_media_							//OFS	Description
{
    unsigned char opcode;					//0		0x04 <Opcode Value="0x04" />

    unsigned short  no;						//1		Tender number

    unsigned char opt_change           :1;	//3		Change given transaction
    unsigned char opt_rounding         :1;	//3		Rounding done
    unsigned char opt_subtract         :1;	//3		Tender subtracted
    unsigned char opt_cancel           :1;	//3		Tender canceled
    unsigned char opt_was_cancelled    :1;	//3		Fuel: tender canceled
    unsigned char opt_return           :1;	//3		Not used
    unsigned char opt_given_as_reward  :1;	//3     Redemption
    unsigned char opt_tender_purchase  :1;	//3		Tender purchase

    unsigned char opt_multi_part_rcpt  :1;	//4		Print multi-part receipt
    unsigned char opt_confirm_signature:1;	//4		Confirm signatue
    unsigned char opt_charge_posting   :1;	//4		Charge posting tender
    unsigned char opt_ecca             :1;	//4		Use ECCA with this tender
    unsigned char opt_ecca_defined     :1;	//4		ECCA record defined
    unsigned char opt_issue_no_used    :1;	//4
    unsigned char opt_accept_isu_date  :1;	//4
    unsigned char opt_accept_exp_date  :1;	//4		Expiry date accepted

    unsigned char opt_MCR_used         :1;	//5		Magnetic card reader used
    unsigned char opt_auth_checked     :1;	//5		Authrosization done
    unsigned char opt_not_auth         :1;	//5		Authorization not done
    unsigned char opt_account          :1;	//5		Account number field used
    unsigned char opt_eft_print_data   :1;  //5         
    unsigned char opt_account_auth_alfa:1;	//5		Account number TRS follows
    unsigned char media_ext            :1;	//5		Media extentios TRS follows
    unsigned char opt_accept_auth_no   :1;	//5		Account number entered manually

    unsigned char opt_next_car_info    :1;	//6		Car info TRS follows
    unsigned char opt_buyaid           :1;	//6		Tender is a buy-aid
    unsigned char opt_ecca_new         :1;	//6		New ECCA record
    unsigned char opt_eft_auth         :1;	//6		Authorized by EFT
    unsigned char opt_coupon_sale      :1;	//6		Coupon sale
    unsigned char opt_next_chq_grty    :1;	//6		Cheque guarantee TRS follows
    unsigned char opt_cashback         :1;	//6		Cashback
    unsigned char opt_reverse_balancing:1;	//6		Customer account purchase or payment

    unsigned char type;						//7		Tender type/class
    long          amount;					//8		Tender amount or cashback
    long          foreign_amount;			//12	Foreign currency amount
    long          foreign_rate;				//16	Foreign currency rate

    unsigned char isu_date[2];				//20	Issue date
    unsigned char account[10];				//22	Account number
    unsigned char state_code[2];			//32	USA state code
    unsigned char exp_date[2];				//34	Expiry date
    unsigned char auth_no[4];				//36	Authorization number
#ifdef PRJ_ROW
    unsigned char card_range_no			:4;	//40	Card range number
	unsigned char opt_media_ext4        :1; //40      Media extention 4 follows
	unsigned char media_ext3            :1;	//40	Media extention 3 follows
	unsigned char opt_media_ext5		:1;	//40	Media extention 5 follows
	unsigned char nu_bit	            :1;	//40	not used
#else	
    unsigned char card_range_no;			//40	Card range number
#endif
    
    unsigned char account_len           :5; //41	Account number length
#ifdef PRJ_ROW 	    
	unsigned char opt_recall_inv        :1; //41	Recall invoice indicator
    unsigned char opt_credit_sale       :1;  //41	Credit sale indicator (Split trans.)
#else
	unsigned char opt_media_ext4        :1; //41      Media extention 4 follows
	unsigned char media_ext3            :1;	//41	Media extention 3 follows
#endif
    unsigned char media_ext2            :1;	//41	Media extention 2 follows
    
    unsigned char issue_no;					//42	Issue number
    char 		   count;					//43	Tender count
    
    struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode: 0x06
Ticket tax info
FSD16204: New transaction 0x0D reflecting Reward By Tender tax data has been added - 
the tax data struct will be the same for both 0x06 and 0x0D but tax calculations
will be based on different taxable amounts
-----------------------------------------------------------------------*/
struct trs_ticket_tax_						//OFS	Description
{
    unsigned char opcode;					//0		0x06 or 0x0D <Opcode Value="0x06,0x0D" />
    unsigned char tax_no;					//1		Tax rate number
    long 			taxable_amount;			//2		Taxable amount
    long 			tax_amount;				//6		Tax amount

    unsigned char exemptable   :1;			//10	Tax exempt given
    unsigned char tax_included :1;			//10	GST inclusive tax
    unsigned char uchZeroRated :1;			//10	KobiM - FSD121574 - Zero rated tax
    unsigned char opt_nu3      :1;			//10	Not used
    unsigned char opt_nu4      :1;			//10	Not used
    unsigned char opt_nu5      :1;			//10	Not used
    unsigned char opt_nu6      :1;			//10	Not used
    unsigned char opt_nu7      :1;			//10	Not used

    unsigned char exempt_no[10];			//11	BCD 19 digits right justify

    long 			FS_forgive_taxable;		//21	Food stamps forgiven taxable amount
    long 			FS_forgive_tax;			//25	Food stamps forgiven tax amount
//#ifndef TAX_REDUCTION_RULES
	long            tax_reduction;                 //FSD231586  
//#else
//	long 			nt_amount;				//29	Not used
//#endif
	
    long 			tax_refund_amount;		//33	refunded tax
	unsigned char   type;					//37    Tax type FS22354
	unsigned long   rate;					//38    Tax rate FS22354

	unsigned char uchTaxPrintChar;			//42	Tax print char
    unsigned char reserved;					//43	Not used
    struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode: 0x05
Ticket total (end of ticket transaction)
-----------------------------------------------------------------------*/
struct trs_ticket_total_					//OFS	Description
{
    unsigned char opcode;					//0		0x05 <Opcode Value="0x05" />

    unsigned char opt_ticket_total       :1;//1		1:ticket total. 0:not a ticket total TRS
    unsigned char opt_void_ticket        :1;//1		Voided ticket
    unsigned char opt_save_ticket        :1;//1		Saved transaction
    unsigned char opt_recall_trans       :1;//1		Recalled transaction
    unsigned char opt_drive_off          :1;//1		Garage: drive off
    unsigned char opt_quick_store        :1;//1		TESCO: Quick terminal
    unsigned char opt_info               :1;//1		to update PC with POS grand ttl.
    unsigned char opt_tender_purchase    :1;//1		Tender purchase ticket

    unsigned char opt_coupon_ticket      :1;//2		First item was a coupon	
    unsigned char opt_tender_ticket      :1;//2		First item was a tender
    unsigned char opt_IH_payment         :1;//2		First item is IH payment
    unsigned char opt_IH_purchase        :1;//2		First item is IH purchase	
    unsigned char opt_send_to_email      :1;//2		Send ticket by email
    unsigned char opt_send_to_qbuster    :1;//2		Enh #65SL Q-Buster @ POS
    unsigned char TaxVoucherRequested    :1;//2		Not used
    unsigned char opt_ProhibitPostVoid   :1;//2		CR9266

    unsigned short  ticket_no;				//3		Ticket amount
    long          tax_value;				//5		Not used
    short           items;					//9		Number of items in ticket

    long          amount;					//11	Total ticket value
    long          discount;					//15	Not used
#ifdef C4_STYLE_REWARD_AS_TENDER
    long          amount_with_reward_by_tender;	//19 FSD16204 Ticket total including RewardByTender discount amt
#else
	long          nt_amount;				//19	Not used
#endif
    long          nt_discount;				//23	Not used

    unsigned char grand_ttl[6];				//27	POS grand total sales value
    unsigned char return_type;				//33	Return type number (if a return ticket)

	long		  food_stamp_real_payment;	//34	Not used
	long    amount_without_electronic_cpns;	//38	Total amount excluding elec. couponss
	unsigned short z_count;					//42	//FS20572_2
    
    struct   trans_tail_  tail;				//44	Transaction tail
};											//64


/*----------------------------------------------------------------------
Opcode: 0x64
Ticket printout, not compressed
-----------------------------------------------------------------------*/
struct trs_printout_						//OFS	Description
{
    unsigned char opcode;					//0		0x64	<Opcode Value="0x64" />

    unsigned char end               :1;		//1		End of ticket text
    unsigned char start             :1;		//1		Start of text
    unsigned char pre_blank_lines	:2;		//1		Inset blank lines above text ( up to 3 pre blank lines)
    unsigned char print_only_2_ej	:1;		//1		Print to EJ only, not on receipt
    unsigned char cut	           	:1;		//1		Cut paper
    unsigned char emph              :1;		//1		Print enphasised
    unsigned char enlarge           :1;		//1		Print enlarged

    unsigned char text[40];					//2		Text to print
    
	unsigned char enlarge_vertical  :1;		//42		Vertical enlarge
	unsigned char nu_7              :7;		//42
	
	unsigned char supported_line_chars;		//43	
    
    struct   trans_tail_  tail;				//44	Transaction tail
};

/*----------------------------------------------------------------------
Opcode: 0x0A
Cashier time/performance statistics
-----------------------------------------------------------------------*/
struct trs_times_							//OFS	Description
{
    unsigned char opcode;					//0		0x0A <Opcode Value="0x0A" />

    unsigned char pos_mode;					//1		Logs the mode the POS was in (sale, tender, idle etc.)

	// The following log the total times during the cashier shift
    unsigned short  item_reg_time;			//2		Total item registration time
    unsigned short  idle_time;				//4		Total idle time
    unsigned short  secure_time;			//6		Total secure time
    unsigned short  tender_time;			//8		Total tender time
    unsigned short  wait_time;				//10	Total wait time
    unsigned short  inq_time;				//12	Total inquiry time
    unsigned short  other_time;				//14	Total other time

    unsigned char quarter_hour  :1;			//16	TESCO
    unsigned char sign_off      :1;			//16	TESCO
    unsigned char nu3           :1;			//16	Not used
    unsigned char nu4           :1;			//16	Not used
    unsigned char nu5           :1;			//16	Not used
    unsigned char nu6           :1;			//16	Not used
    unsigned char nu7           :1;			//16	Not used
    unsigned char express_order :1;			//16	Express ticket (less than 10 items)
    
    // Delta time: time since last 0x0A TRS
    unsigned short  delta_item_reg_time;	//17	Item registration time
    unsigned short  delta_idle_time;		//19	Idle time
    unsigned short  delta_secure_time;		//21	Secure time
    unsigned short  delta_tender_time;		//23	Tender time
    unsigned short  delta_wait_time;		//25	Wait time
    unsigned short  delta_inq_time;			//27	Inquiry time
    unsigned short  delta_other_time;		//29	Other time

    unsigned short  sign_on_time;			//31	Total sign on time
    unsigned short  delta_sign_on_time;		//33	Delta sign one time

	unsigned long   maint1;					//35	Maint recieved statistics
 	unsigned long   maint2;					//39	Maint recieve statistics
    unsigned char   local_maint_Q;			//43	Pending maintenance records

    struct   trans_tail_  tail;				//44	Transaction tail
};											//64


/*----------------------------------------------------------------------
Opcode: 0x11
PLU sale extension record
-----------------------------------------------------------------------*/
struct trs_plu_sale_ext_					//OFS	Description
{
    unsigned char opcode;					//0		0x11 <Opcode Value="0x11" />

    unsigned char code[7];					//1		plu code					

    unsigned char opt_pump_test			:1;		//8		Fuel: pump test TRS
    unsigned char opt_fuel_trs			:1;		//8	    Fuel transaction
    unsigned char opt_recalled_trs		:1;		//8		Fuel recalled TRS
    unsigned char opt_drive_off 		:1;		//8		Fuel: drive off
    unsigned char opt_prepay_trs 		:1;		//8		Fue: pre-paid TRS
	unsigned char opt_postpay_accepted  :1;		//8		Index/Defect #13482SL/#13482SL
    unsigned char opt_postpay_paid    	:1;		//8		Index/Defect #13482SL/#13482SL
    unsigned char opt_manual_fuel 		:1;		//8		Issue #9270SN

    unsigned char opt_cs_tax_comb :1;		//9
    unsigned char opt_SelfScaningAditionalItem:1;		//9		Not used
#ifdef PRJ_ROW
    unsigned char opt_self_scan_notOK 		:1;		//9 SelfScan22304FS
#else
    unsigned char opt_vensafe_item	:1;		//9		Not used
#endif
    unsigned char opt_external_modify				:1;		//9		QSR Merge [RandyB]
    unsigned char opt_plu_void_at_end		:1;		//9		//FSD42826
    unsigned char uch_DEA_override_approved	:1;		//9		FSD54875
#ifdef PRJ_USA
    unsigned char opt_laneHawk_item			:1;		//9		SL_US Issue #17615 [ShlomitG]
#else
    unsigned char opt_BagReUsePLU			:1;		//9		FSD51799
#endif
    unsigned char opt_SaleForPumpTest		:1;		//9		FSD58093

    unsigned char pump;						//10	pump number
    unsigned char fuel_grade;				//11	grade number
	unsigned long pump_trans_no;			//12	synch no.					
    unsigned char nozzle;					//16	Pump nozzle number

    //Copy of values from PLU transaction - needed for SQL tables
    long           qty;						//17	Quantity sold
    long           price;					//21	Item price
    long           amount;					//25	Amount taken

    long fuel_disp_price;					//29	Grade price, 3 decimal digits
    
	long          nt_amount;				// 33   SL Issue #7826/Bug #7914 [RandyB] non-GST amount
	unsigned long	external_sale_handle;	// 37	SL Issue #7737/Enh #7737 [RandyB] QSR sale handle

	union
	{    
	    short			prepay_ticket_no;	// 41   Defect #14148 - Need to know original prepay ticket number in case of multiple prepay recalls
        unsigned char   tank_no;            // 41   #70523: Pump Test Enhancemnt not returning fuel to Tanks
    };

	//unsigned char	opt_vending_item 		:1;// 43
	//unsigned char	reserved				:7;// 43
	unsigned char uchPluLen;				//43	TD#87705
	
    struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode: 0x12
Department sale extension record
-----------------------------------------------------------------------*/
struct trs_dep_sale_ext_					//OFS	Description
{
    unsigned char opcode;					//0		0x12 <Opcode Value="0x12" />

    unsigned short  dept;					//1		Department no.

    unsigned char opt_pump_test		:1;     //3		Fuel: pump test TRS
    unsigned char opt_fuel_trs		:1;		//3	    Fuel transaction
    unsigned char opt_recalled_trs	:1;		//3		Fuel recalled TRS
    unsigned char opt_current_trs	:1;		//3		TESCO Garage
    unsigned char opt_drive_off 	:1;		//3		Fuel: drive off (ALB)
	unsigned char opt_SelfScaningAditionalItem:1;		//3		used by self scanning systems
    unsigned char opt_parking_trs	:1;		//3		FSD39663 - parking transaction
    unsigned char opt_dep_void_at_end    	:1;		//3	FSD42826 - Cashier age Validation

    unsigned char bPrintOnReceipt	:1;			//4		Not used
    unsigned char opt_manual_fuel  	:1;			//4		FSD57577 Manual Fuel Flag
    unsigned char bItemAllreadyPrintedOnKitchenDoc :1; //4	//FSD62785 - StoreLine Kitchen printing support
    unsigned char bExtraFeeSale    	:1;			//4		//FSD307721
    unsigned char opt_nu14    	:1;			//4		Not used
    unsigned char opt_nu15    	:1;			//4		Not used
    unsigned char opt_nu16    	:1;			//4		Not used
    unsigned char opt_nu17    	:1;			//4		Not used

    unsigned char pump;						//5		Pump number
    unsigned char fuel_grade;				//6		Grade number
	unsigned long pump_trans_no;			//7		Synch no.
    unsigned char nozzle;					//11	Nozzle no.
    
    //Copy of values from DEP transaction - needed for SQL tables
    long           qty;						//12	Quantity sold
    long           price;					//16	Item price
    long           amount;					//20	Amount taken
    
    long fuel_disp_price;					//24	Grade price, 3 decimal digits			
    unsigned char  sSalesPersonTemplate[10];//28	Sales Person Template
	unsigned short sSalesPersonTillNo;		//38	Sales Person till number
    unsigned short ushGroupId;              //40
    unsigned char  reserved[2];             //42       Not used


    struct   trans_tail_  tail;				//44	TRS tail
};											//64


/*----------------------------------------------------------------------
Opcode: 0x22
PLU sale extention record 2
-----------------------------------------------------------------------*/
struct trs_plu_sale_ext2_					//OFS	Description
{
    unsigned char opcode;					//0     0x22 <Opcode Value="0x22" />
    unsigned char code[7];					//1     plu code					
    unsigned char liquor_type;				//8     Liquour/Tobacco type

	unsigned char opt_bonus_item			:1;   //9
	unsigned char opt_pick_qty_zero			:1;
#ifdef PRJ_ROW
	unsigned char opt_qty_is_weight			:1;//9		Weighted item sold
    unsigned char opt_qty_is_decimal_qty	:1;//9		Decimal quantity item (e.g. meters)
    unsigned char opt_qty_is_fuel_gallons	:1;//9		Fuel item sold in gallons
#else
	unsigned char opt_homeDeliveryCharge	:1;	//9	Indicate delivery charge plu sale
    unsigned char opt_parcelPickCharge		:1;	//9	Indicate delivery charge plu sale
	unsigned char opt_extraCode				:1;	//9 Indicate Extra code value is valid
#endif
	unsigned char opt_price_overr_calc		:1;//9     CC&C pricing
	unsigned char bOptOnlinePurchaseItem    :1;//9     FS3012						
	unsigned char bLaybyFeeSale				:1;//9	FSD3928

#ifdef PRJ_ROW
	long          qty;						//10	Quantity sold
    long          price;					//14	Item price
    long          amount;					//18	Amount taken
	unsigned char price_type;               //22    Price type
	unsigned short mult_sell_unit;			//23	MSU
#ifdef PRJ_PRICELINE
	unsigned char opt_scr_sls_flag  :1;		//25	Pharmacy script  cr#3040
	unsigned char opt_scr_sls_void  :1;		//25	script void cr#3040
	unsigned char bSaleInReturnTrs  :1;		//25	A sale of a script in a return transaction
	unsigned char opt_nu			:5;		//25	not used

    long  retn_surcharge_percent;   //26     cost-plus surcharge on refund item cr#3113
#else //#ifdef PRJ_PRICELINE
    unsigned char sOutOfStockCode[5];		//25 FSD14255
#endif
#else //#ifdef PRJ_ROW
	unsigned char strExtraCode[20];			//10     ExtraCode (FS20617)
#endif

#ifdef PRJ_ROW
	unsigned char sBCDInternalCode[7];      //30     BCD Internal Item code
#else
    unsigned char sBCDOrgItemCode[7];		//30     BCD original Item code	 (The item code of the drill down item)
#endif

	unsigned char bAdditionalReceiptItem		:1;	//37	//FSD3580
	unsigned char bProhibitDiscount				:1;	//37	//FSD3585
	unsigned char bGiftCardBalanceItemSale		:1;	//37	//#7405
	unsigned char bNotFoundSale					:1;	//37	// #8628
	unsigned char bItemSoldByBarcodeProgramming :1;	//37	//FS3585
	unsigned char bLaybyModifyRefundItem		:1; //37	//FSD6248
	unsigned char bDeliveryItem					:1;	//37	//FSD11254
	unsigned char bOptExternalPosItem   		:1;	//37    //FSD7315

	unsigned char ucExternalItemRef ;         //38     //FSD7315   
	unsigned char bDepositableItem				:1;			//39
	unsigned char bStockAllocationType			:1;			//39 FSD11254
	unsigned char ucStockMngBits				:5;			//39
	unsigned char bOptBillPayment            	:1;   		//39 FSD2615	

	//removed sBCDSubstractedQty for unsolved old bug #3051
	unsigned char bDoNotIncreaseItemCount	:1;			//40 FSD29687
	unsigned char bOnlinePurchaseItemIncludeCommission	:1; //FSD26777
	unsigned char bExtraFeeSale				:1;		//#40131 mark extra fee flag
	unsigned char bCancelledItem            :1;     //CR#43068
	unsigned char bLicenseValid				:1;		//FSD55249
	unsigned char bRepeat					:1;		//CR#53701
	unsigned char bParkingItem				:1;		//FSD59807
	unsigned char bDataBarItemSale			:1;		//FSD28013	 

    unsigned char  POSItemMessageID;	    //41 //FSD65262						//41
	unsigned short ushOriginalPluSeqNo;		//42     the sequence number  of the plu in original ticket (before save/recall)

    struct   trans_tail_  tail;				//44    TRS tail							
};											//64

/*----------------------------------------------------------------------
Opcode:		0x16
Payout / Receipt
-----------------------------------------------------------------------*/
struct trs_paidout_receipt_					//OFS	Description
{
    unsigned char opcode;					//0		0x16 <Opcode Value="0x16" />

    unsigned char expence_code;				//1		Expense code
    unsigned char expence_referance[10];	//2		Reference number

    long          amount;					//12	Amount
    unsigned char tender;					//16	Tender number

    unsigned char post_accntblty   :1;		//17	POS accountability
    unsigned char opt_reprocess    :1;		//17	Process this record only if re-process mode
    unsigned char opt_amount_int64 :1;		//17	Use the int64 amount 
    unsigned char opt_enhanced     :1;		//17	Enhanced payout/roa
    unsigned char auto_trans   	   :1;		//17	FSD#166552
    unsigned char opt_TenderByUnit :1;		//17	FSD#166552
    unsigned char paidout     	   :1;		//17	Not used
    unsigned char receipt     	   :1;		//17	Not used

    long          expn_code;				//18	Enhanced expense code number
    long          vat_amount;				//22	VAT amount
    
	unsigned char expense_code_1[4];		//26	4 more characters of reference no.
	unsigned short user;					//30	B/O user number
	unsigned short safe_no;					//32	Safe number
#ifdef PRJ_ROW
    unsigned char  qty;						//34	Tender quantity           
    struct
    {
		unsigned char seq_no   :3;			//35	This is record #xxx for this payout/payin trs
											//			0: main transaction
											//			1: rounding transaction
											//			2: tender transaction
											//			3: change transaction
		unsigned char change   :1;			//35	Change given to customer
		unsigned char rounding :1;			//35	Rounding applied at POS
		unsigned char notused  :3;			//35	Not used
    } flags2;
#else
    unsigned short  qty;                    //34	Tender quantity
#endif
	__int64       amount2;					//36	Amount (if opt_amount_int64 set)

    struct   trans_tail_  tail;				//44	TRS Tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x01 TRANS_INFO_NONFND
Item not found
-----------------------------------------------------------------------*/
struct trs_plu_nonfnd_						//OFS	Description
{
    unsigned char opcode;					//0		0x60 <Opcode Value="0x60" />
    unsigned char function;					//1		0x01 <Opcode Value="0x01" />

    unsigned char code[7];					//2		Item number

    unsigned char opt_scanned_item      :1;	//9		Item was scanned
    unsigned char opt_inquery           :1;	//9		Item was lookked up via inquiry
    unsigned char opt_info              :1;	//9		Informative record
    unsigned char opt_DepSaleUnknown    :1;	//9		FS21409
    unsigned char opt_ExtraCode         :1;	//9		Extra Code
    unsigned char opt_nonfnd_sold		:1;	//9		Not used
    unsigned char opt_WasteMode         :1;	//9		Waste Mode - FSD277889
    unsigned char opt_nu17              :1;	//9		Not used

	unsigned char pos_offline           :1; //10	Indicate if POS is offline
    unsigned char used_unknow_item_logic:1; //10	if using the unknown item logic (Sainsbury's)
    unsigned char unitmsrv_alive        :1; //10	if POS got ACK for the unknown item request
    unsigned char received_plu_info     :1; //10	if POS got ANS for the unknown item request
	unsigned char invalid_plu_details   :1; //10	Answer not valid
	unsigned char external_srv_allive   :1; //10	Cyber not alive
    unsigned char nu4	                :2;	//10	Not used

	unsigned char strExtraCode[20];			//11     ExtraCode (FS20617)

    unsigned char nu[13];					//31	Not used

    struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x02
EFT communication transaction. Used by V7 POS with SMT EFT
-----------------------------------------------------------------------*/
struct trs_eft_com_							//OFS	Description
{
    unsigned char opcode;					//0		0x60 <Opcode Value="0x60" />
    unsigned char function;					//1		0x02 <Opcode Value="0x02" />

    unsigned char status;					//2		1 - fail clear input
											//		2 - timeout on first ack
											//		3 - NAK on first req
											//		4 - not ACK on first req
											//		5 - Big timeout
											//		6 - timeout between msg chars
											//		7 - more than 1000 chars
											//		8 - got bad lrc
											//		9 - general
											//		9 - general
											//		10 - geot more than buffer can hold
											//		0  - end request

    unsigned char eft_rc;					//3		Return code
    long          amount;					//4		include CashBack in pay currency	
    unsigned short  tender_no;				//8		Tender number
    unsigned char account[10];				//10	Account number (BCD)
    unsigned char start_time[3];			//20	Start time
    unsigned char account_str[21];			//23	not pak account 

    struct   trans_tail_  tail;				//44	TRS tail
};											//64


/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x03
Customer birthday or age info
-----------------------------------------------------------------------*/
struct trs_birthday_						//OFS	Description
{
    unsigned char opcode;					//0		0x60 <Opcode Value="0x60" />
    unsigned char function;					//1		0x03 <Opcode Value="0x03" />

    unsigned char age;						//2		Age

    unsigned char day;						//3		Date of birth: day
    unsigned char month;					//4		Date of birth: month
    unsigned short  year;					//5		Date of birth: year
	unsigned char BioDOBFlg				:1;	//7		DOB obtained by PBT? Issue #7703SL
	unsigned char supervisor_verified   :1; //7     Age checked by mngr Enh #14437SL
	unsigned char auto_approve_ignore	:1; // FSD102391 StoreLine Product Restriction Enhancement
	unsigned char is_auto_approve		:1; // bug 119491
	unsigned char nu_bdate				:4;
 
    unsigned char restiction_message_id;	// 8 FSD102391 StoreLine Product Restriction Enhancement
 	unsigned short supervisor_id;			//9
	unsigned char nu[33];					//11
    
	struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x04
Tax exemption information
-----------------------------------------------------------------------*/
struct trs_tax_exempt_						//OFS	Description
{
    unsigned char opcode;					//0		0x60 <Opcode Value="0x60" />
    unsigned char function;					//1		0x04 <Opcode Value="0x04" />

    unsigned char option;					//2		1-start 0-stop
    unsigned char exempt_no[19];			//3		Exemption number
    		     
	unsigned char all_tax;					//22	Exempt from all taxes
    unsigned char tax[8];					//23	Flag for each examptable tax
    
    unsigned char wic_tax_exempt  :1;		//31	Albertson's
    unsigned char nu1             :7;		//31	Not used
    unsigned char tax_2[7];					//32	Flag for each examptable tax
    unsigned char nu[5];					//39	Not used

    struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x31
Location (POS information) transaction
-----------------------------------------------------------------------*/
struct trs_location_						//OFS	Description
{
	unsigned char opcode;					//0		Opcode - 0x60		<Opcode Value="0x60" />
	unsigned char function;					//1		Subopcode -  0x31	<Opcode Value="0x31" />

	unsigned char opt_tender_correction	:1;	//2		Tender correction
	unsigned char fuel_merged_recall_prepay_ticket:1;	//2		Fuel for ALB's
	unsigned char opt_invoice			:1;	//2		Use invoice number field
	unsigned char opt_frgn_cust			:1;	//2		Cutomer is an export customer
	unsigned char frc_crd_return		:1;	//2		Force credit return
	unsigned char express_pos    		:1;	//2		Express POS
#ifdef PRJ_ROW
	unsigned char rdh_sale				:1;	//2		Future use
#else
	unsigned char bDepositReqInPrvTicket:1;	//2		Deposit requested in previous ticket.
#endif
	unsigned char rdh_return			:1;	//2		Future use
   
	//CR55882 - changed from "unsigned char store_id[6];" to union to send long value
	union
	{
		unsigned char store_id[6];	 			//3		Store number (Alphanumeric)
		struct LongStoreNo
		{
			unsigned long ulLongStoreNumber;
			char filler[2];
		}LongStore;
	};

	unsigned char till_type;				//9		'O/I/S'
	unsigned char checkout_bank;			//10	Checkout bank number (0-99)
	unsigned char eft_location[5];			//11	EFT location as defined on POS configuration
	unsigned char till_profile;				//16	Till profile as defined on POS configuration

	unsigned char doc_type;					//17	El-Salvador tax report 
											//		1=ticket
											//		2=factura
											//		3=credito fiscal
   
	unsigned short till_no;					//18	
	unsigned short cashier_no;				//20

	unsigned char wholesale_trs_type;		//22	see enum WHOLESALE_TRS_TYPE
	unsigned char invoice_no[8];			//23	wholesale invoice number
	unsigned char inv_date[3];				//31	Invoice generation date	
	unsigned char inv_time[3];				//34	Invoice time
	unsigned char uchLayByStatus;			//37	//FS19171_LayBysTax: Status of LayBys (Priceline)

	unsigned char bBulkGiftCardSale		  :1; //38	//FSD1798 Bulk Gift Card Sale
	unsigned char bTicketOfReturns		  :1;
	unsigned char bCashChangeCalcul		  :1; // FSD#16283
	unsigned char bRedeemVoucher		  :1; // FSD#30639 
	unsigned char bManualAdjustmentTicket :1; // FSD#16270
	unsigned char bCashVoucherSaleTicket  :1; // FSD58540 Cash voucher
	unsigned char bRpoTicket			  :1; // CR 65207
	unsigned char bNonPaymentDriveOffTrs  :1; // FSD61185

	unsigned char   uchLocalWeekInYear;		//39    #10485 Week of year of local time (January 1-7 == 0)

	unsigned short shShiftId;				//40	Shift_Management in Remote Office
	short  shCurFunction;					//42    TD 41380 the ppm_entry.code function  reserved[2];				//42	Future use

	struct   trans_tail_  tail;				//44	Transaction tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x7E
Info transaction for recalled invoice
-----------------------------------------------------------------------*/
struct trs_info_inv_pmt_					//OFS	Description
{
	unsigned char opcode;					//0		0x60	<Opcode Value="0x60"/>
	unsigned char function;					//1		0x7E	<Opcode Value="0x7E"/>

    unsigned char invoice_no[8];			//2     invoice number (CCCCTTTNNNNN) (CASHIER,TILL,TICKET NUMBER)
    unsigned char payment_type;				//10    0 Normal payment
											//      1 Paid through an account payment (offline)
											//      2 Split TRS paid offline 
											//      3 Split TRS paid online
											//      See also INVOICE_PAYMENT_TYPE
    unsigned char inv_issue_dt[3];			//11    Invoice issue date
    unsigned char inv_issue_tm[3];			//14    Invoice issue date
    unsigned char pmt_type_sot;				//17    Payment type at SOT. 1: cash 2:credit
	
	unsigned char opt_void_payment:1;		//18    Flag for indication that payment was voided
	unsigned char opt_recall	  :1;		//18	The invoice was recalled
	unsigned char opt_recall_by_payment	:1; //18	recall_invoice+sale
	unsigned char opt_frc_crd_return    :1; //18	Force credit return
    unsigned char opt_not_crtd_rcl_inv	:1;	//18	Not created invoice
	unsigned char opt_nu				:3;	//18	Future use

	unsigned char cust_no[10];				//19	Customer number
	unsigned char sale_type;				//29    Sale type 
	long		  amount;					//30    invoice value
	unsigned char filler[10];				//34    Future use

	struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x9F
Invoice re-print
-----------------------------------------------------------------------*/
struct trs_info_inv_reprint_				//OFS	Description
{
	unsigned char opcode;					//0		0x60	<Opcode Value="0x60"/>
	unsigned char function;					//1		0x9F	<Opcode Value="0x9F"/>

    unsigned char invoice_no[8];			//2     invoice number 
    unsigned char inv_issue_dt[3];			//10    Invoice issue date
	long          lAmount;					//13	Invoice Value	FSD31954
	long		  lSupervisor;				//17	FSD31954_supervisor
	unsigned char filler[23];				//21    Future use

	struct   trans_tail_  tail;				//44	TRS tail
};


/*----------------------------------------------------------------------
Opcode:		0x08
Coupon transaction
-----------------------------------------------------------------------*/
struct trs_coupon_							//OFS	Description
{
    unsigned char opcode;					//0		0x08 <Opcode Value="0x08" />

    unsigned char opt_subtract           :1;//1		Coupon subtracted
    unsigned char opt_cancel             :1;//1		Coupon canceled
    unsigned char opt_supress_bonus_cpn  :1;//1		Supress bonus coupon
    unsigned char opt_ext_cpn_info_trs   :1;//1		Coupon info TRS follows
    unsigned char opt_dept_net           :1;//1		Department netted coupon
    unsigned char opt_bonus_cpn_followed :1;//1
    unsigned char opt_cost_plus          :1;//1		Cost plus
    unsigned char opt_chained_prv_item   :1;//1		As a result of previous item sale

    unsigned char opt_store_coupon       :1;//2		This is a store coupon item
    unsigned char opt_vendor_coupon      :1;//2		This is a vendor coupon item
    unsigned char opt_bonus_coupon       :1;//2		Bonus coupon
    unsigned char opt_UPC5_coupon        :1;//2		UPC5
    unsigned char opt_FS_payment         :1;//2		Payment by food stamps allowed
    unsigned char opt_discount_allowed   :1;//2		Discount allowed
    unsigned char opt_manual_entered_amount	 :1;//2		Amount entered manually
    unsigned char opt_manual_entered_dept		 :1;//2		Dept. no. entered manually

    long          qty;						//3		Quantity
    long          amount;					//7		Coupon amount

    unsigned short tender_no;				//11	Tender number
    unsigned char  tender_type;				//13	Tender type
    unsigned short coupon_dept;				//14	Department number
    unsigned char  coupon_code[7];			//16	Coupon number
    unsigned char  coupon_name[16];			//23	Coupon name

    unsigned char  tax_ptr;					//39	Tax flags
    unsigned short min_qty;					//40	Minimum quantity

	short plus_amount;						//42	Addad after the ceiling amt. limit
    								 
    struct   trans_tail_  tail;				//44	TRS tail
};											//64	

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x43 TRANS_INFO_COUPON
Coupon info
-----------------------------------------------------------------------*/
struct trs_coupon_info_						//OFS	Description
{
    unsigned char opcode;					//0		0x60	<Opcode Value="0x60" />
    unsigned char function;					//1		0x43	<Opcode Value="0x43" />TRANS_INFO_COUPON

    unsigned char opt_weight_coupon      :1;//2	
	unsigned char opt_dep_store_coupon   :1;//2		A's department store coupon.
    unsigned char opt_dep_other_coupon   :1;//2		A's (other) bonus coupon.
	unsigned char opt_dep_vendor_coupon  :1;//2		A's department vendor coupon.
	unsigned char opt_plu_store_coupon   :1;//2		A's plu store coupon.
	unsigned char opt_plu_other_coupon   :1;//2		A's	plu "other" bonus coupon.
	unsigned char opt_plu_vendor_coupon  :1;//2		A's plu vendor coupon.
    unsigned char opt_freq_shop_coupon   :1;//2		Frequent shopper coupon

    long weight;							//3		Weight
    long price;								//7		Price
    long amount;							//11	Amount
    unsigned char return_type;				//15	Return type number
    unsigned char link_code[7];				//16	Linked item code
	

    unsigned char triple_coupon			:1; //23	TRIPLE COUPON
    unsigned char smart_card_coupon		:1; //23	Electronic smart card coupon
	unsigned char opt_price_embedded_coupon		:1; //23	HF #9259
    unsigned char nu					:5;	//23	Not used		 

    long          qty;						//24	For balancing back office reports
	unsigned short ushProjectId;			//28	FSD15885 - Sweet Mart Coupon
	unsigned short ushTemplateId;			//30	FSD15885 - Sweet Mart Coupon
    unsigned char plu_code[7];				//32	Issue #8897SN: EBTWIC plu code for item that UPC5 coupon is attached to
	unsigned short ushTicketType;			//39	Sweet Mart Coupon
	unsigned char uchExternalCouponProviderTenderTypeID;	//41	FSD34249_V4

    unsigned char reserved[2];				//42	Not used

    struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x08
account number information
-----------------------------------------------------------------------*/
struct trs_account_							//OFS	Description
{
    unsigned char opcode;					//0		0x60 <Opcode Value="0x60" />
    unsigned char function;					//1		0x08 <Opcode Value="0x08" />

    unsigned short tender_no;				//2		tender number
    unsigned char  type;					//4		tender type

    unsigned char account[21];				//5		account number (ascii)
    unsigned char auth_no[9];				//26	authorization number
    unsigned char print_auth_no[9];			//35	printed auth. number
    
    struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x09
bagger information
-----------------------------------------------------------------------*/
struct trs_bagger_							//OFS	Description
{
    unsigned char opcode;					//0		0x60 <Opcode Value="0x60" />
    unsigned char function;					//1		0x09 <Opcode Value="0x09" />

    unsigned char bagger_id[11];			//2		bagger number as captured at POS
    unsigned char resevd[31];				//13	reserved
    struct   trans_tail_  tail;				//44	TRS tail
};											//64

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0x0B TRANS_INFO_EXPENSE
FSD14423 Payout / Receipt Expense code transaction
-----------------------------------------------------------------------*/
struct trs_info_expense_						//OFS	Description
{
   unsigned char opcode;	               // 0 0x60					<Opcode Value="0x60"/>
   unsigned char function;                // 1 0x0b TRANS_INFO_EXPENSE	<Opcode Value="0x0B"/>
   unsigned char sub_func;                // 2 1 - basic
                                          //   2,3 - purchase
                                          //   4 - debtors
                                          //   5 - cristmas stamps
                                          //   6,7 - bad debts recovered
                                          //   8 - Basic + VAT
                                          //   9 - salary
										  //   11 - Non bankable
										  //   12- Basic + Transaction Description	
										  //   13- Cost Center
										  //   99 - ExtraData = Special related info to the expense FO uses union ExtraData

   unsigned char  opt_payout    :1;       // 3
   unsigned char  opt_receipt   :1;       //
   unsigned char  opt_salary    :1;       //       jmd, Shoprite CP-0012
   unsigned char  opt_reproc    :1;       // process TRS only in reprocess mode
   unsigned char  opt_last_id   :1;       // use last TRS id
   unsigned char  opt_nu        :3;       //

   union trs_expense_inf_                 // 4 40 bytes length
   {
      struct trs_expense_general_
      {
         unsigned char data[40];          // 4
      } general;

      struct trs_expense_basic_           // 4
      {
         unsigned char  reference[14];    // 4
         unsigned long  branch;           // 18   
         unsigned long  exp_code;         // 22    
         unsigned short tender_type;      // 26    
         __int64        amount;           // 28   
         unsigned short safe_no;          // 36
         unsigned short user_no;          // 38
         unsigned char  action;           // 40
         unsigned char  pc_no;            // 41
         unsigned char  template_type;    // 42
         unsigned char  filler[1];        // 43
      }basic;                             // 44

      struct trs_expense_basic2_          
      {
         long           qty;              // 4
		 unsigned char  date[3];          // 8       BCD: yymmdd
         unsigned char  filler[33];       // 11
      }basic2;                            // 44

      struct trs_expense_basic_vat__
      {
         __int64 vat_amount;              // 4
         double  vat_ref;                 // 12
         long    qty;                     // 20
         unsigned char filler[20];        // 24
      } basic_vat;

      struct trs_expense_purch1_          // 4
      {
         __int64        vat_amount;       // 4
         double         vat_invoice;      // 12
         unsigned long  grv_number;       // 20
         unsigned short re_dept;          // 24
         long           qty;              // 26
         unsigned char  filler[14];       // 30
      } purch1;                           // 44

      struct trs_expense_purch2_          // 4
      {
         unsigned char  desc[28];         // 4
         unsigned char  filler[12];       // 32
      } purch2;                           // 44

      struct trs_expense_debtor_
      {
         __int64        vat_amount;       // 4
         unsigned char  vat_invoice[7];   // 12
         unsigned char  filler[25];       // 19
      } debtor;                           // 44

      struct trs_expense_crst_               
      {
         unsigned long  agent;            // 4
         long           qty;              // 8
         unsigned char  filler[32];       // 12
      } xmas;                             // 44

      struct trs_expense_acct_
      {
         unsigned char  acct_num[22];     // 4
         long           qty;              // 26
         unsigned char   filler[14];      // 30
      } acct;                             // 44

      struct trs_expense_acct2_
      {
         unsigned char	name[30];			// 4
			unsigned char  initials[10];		// 34
      } acct2;                            // 44

      struct trs_expense_salary_
      {
         unsigned short  type;             // 4
         long			 qty;              // 6
		 unsigned char   batch_code[14];  // 10
         unsigned char   filler[20];      // 24
      } salary;                           // 44

	  struct trs_expense_NonBankable
      {
         unsigned char  RefDate[20];         // 4
         unsigned char  filler[20];       // 24
      } NonBankable;					  // 44

	  //FSD45766
	  struct trs_expense_CostCenter_ 
	  {
		  unsigned char sCostCenter[7];	  // 4
		  unsigned char filler[33];		  // 11
	  } CostCenter;						  // 44
		//FSD#55809
		struct trs_expense_AdditionalReference_
		{
			unsigned char Type;           //4 
			//0 -AddReference        
			//1 -Comment1 
			//2 -Comment2
			//3 -Comment3               
			unsigned char AddReference[30];//5
			
			unsigned char filler[9];                               //35 
		} AdditionalReference;                        //44
		
		
		struct trs_expense_MileageClaim_          
		{
			unsigned char DriveNo[3];                              //4 
			__int64 Mileage;                                       //7          long
			__int64 PricePerMile;                                  //15 
			unsigned char  EngineSize[10];							//23 
			unsigned char  filler[11];                            //33
		} MileageClaim;                                          //44
		
		struct trs_expense_AutoMachines_
		{
			unsigned short MachineID;      //4
			__int64 OpenRead;              //8          long
			unsigned char filler[28];      //16 
		} AutoMachines;						//44
		
		struct trs_extra_data_ 
		{
			unsigned char uchDataType;		//4
			unsigned char uchSubDataType;	//5
		
			union trs_extra_data_info_
			{
				struct trs_extra_data_approval_
				{
					short shSupervisorId;			//6
					unsigned char filler[36];		//8
				} ExtraDataApproval;				//44



			}ExtraDataInfo;
		} ExtraData;	//44
	  
   } inf;

   struct   trans_tail_  tail;
};											//64

// Electronic smart card coupon - coupon information + plu attached
struct trs_smart_card_coupon_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x79 <Opcode Value="0x79" />

    unsigned char  coupon_code[7];	//2 BCD: Empty[3], ManufacturerCode[6], 
	                                //     FamilyCode[3], ValueCode[2].

	unsigned char  coupon_info[6];  //9 BCD: OfferCode[5], CouponCategoryCode[2]
									//     Medium[1], Vehicle[2], Placement[2]

	unsigned char ExpirationTime[3]; //15
	unsigned char StartTime[3];      //18 
	unsigned char CaputureTime[3];   //21

	unsigned char ReusedCounter;     //24 


	struct
	{
		unsigned char NU0					:1;
		unsigned char NU1					:1;
		unsigned char DisplayCapable		:1;
		unsigned char DBUnreadOrRead		:1;
		unsigned char Source				:1;
		unsigned char ActivOrCancel			:1;
		unsigned char ActiveOrOverageStatus	:1;
		unsigned char RedemptionStatus		:1; //25
	}Build_in_flag;

	unsigned char opt_subtract			:1;
    unsigned char opt_cancel			:1;
	unsigned char opt_ext_smart_cpn_trs	:1;
	unsigned char nu3					:1;
	unsigned char nu4					:1;
	unsigned char nu5					:1;
	unsigned char nu6					:1;
	unsigned char nu7					:1;  //26

    long           reward;                   //27

	struct
	{
		unsigned char  plu_code[7];			//31 BCD 
		short		   FamilyCode1;         //38
		short		   FamilyCode2;         //40
    }attached_plu1;


    unsigned char  reserved[2];             //42

	struct trans_tail_ tail;                //44
};

// Smart card coupon info transaction		// correct fix
// include information about plu's attached to coupon
struct trs_smart_card_coupon_ext_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x7C <Opcode Value="0x7C" />

	struct
	{
		unsigned char  plu_code[7];			//BCD
		short		   FamilyCode1;
		short		   FamilyCode2;
    }attached_plu2;

	struct
	{
		unsigned char  plu_code[7];			//BCD
		short		   FamilyCode1;
		short		   FamilyCode2;
    }attached_plu3;

	struct
	{
		unsigned char  plu_code[7];			//BCD
		short		   FamilyCode1;
		short		   FamilyCode2;
    }attached_plu4;

	unsigned char reserved[9];

	struct trans_tail_ tail;
};



// SmartTV card information
struct trs_smart_TV_card_data_
{
    unsigned char opcode;				//0x60 <Opcode Value="0x60" />
    unsigned char function;				//0x7A <Opcode Value="0x7A" />

	unsigned char WalletID[4];			//2		BCD
	unsigned char CardHolderID[8];		//6		BCD
	unsigned char SerialNumber[8];		//14	BCD
	unsigned short CardUsageCount;		//22	
	unsigned short CouponRedeemed;		//24	
	unsigned long  SavingAccumulator;	//26

	struct Flag1_
	{
		unsigned char NU0	:1;
		unsigned char NU1	:1;
		unsigned char NU2	:1;
		unsigned char NU3	:1;
		unsigned char NU4	:1;
		unsigned char NU5	:1;
		unsigned char NU6	:1;
		unsigned char Dirty	:1;         //30
	}Build_in_flag;

	unsigned char read		:1;
	unsigned char write		:1;
	unsigned char nu2		:1;
	unsigned char nu3		:1;
	unsigned char nu4		:1;
	unsigned char nu5		:1;
	unsigned char nu6		:1;
	unsigned char nu7		:1;         //31

	unsigned char  reserved[12];        //32

	struct trans_tail_ tail;            //44
};



// Gift card transaction for Albertson 
// activation/recharge(re-activation) card 
struct trs_gift_card_act_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x7B <Opcode Value="0x7B" />

	unsigned char ActionType;    //2
	unsigned char CardNo[11];	 //3 BCD
	unsigned char AuthNo[9];     //14
	unsigned char Reference[10]; //23

	long BegBalance;             //33
	long TrsAmount;              //37

    unsigned char Activation		:1; //Gift card activation
    unsigned char Recharge			:1; //Recharge gift card 
    unsigned char variable_card		:1; //card price was manual entered
    unsigned char ManualySwipe		:1; //card was swiped manualy
    unsigned char OptExtData		:1; //
	unsigned char bIsOffline		:1; //FSD55425
    unsigned char nu				:2; //41 

    short TenderNo;                     //42

    struct   trans_tail_  tail;         //44
};

//Issue #2711SL: Extended gift card data
struct trs_gift_card_act_ext_
{
    unsigned char opcode;			//0x60	<Opcode Value="0x60"/>
    unsigned char function;			//0xFD	<Opcode Value="0xFD"/>

	unsigned char Template[10];		//2
	unsigned char CardNo[11];		//12 BCD
	unsigned char AuthNo[9];		//23
	char plu_code[7];               //32 BCD     PLU number  
	long TrsAmount;					//39

	unsigned char Filler[1];		//43

    struct   trans_tail_  tail;		//44
};

//Index/Defect #16122SL/#16122SL
struct trs_gift_card_act_ext2_
{
    unsigned char opcode;						//0	0x70
    unsigned char function;						//1	0xDE
	unsigned char EFTTraceNo[6];				//2	pakd
	unsigned char szTrsDateAndTime[15];			//8		//FSD55425
	unsigned char szGiftExpiryDate[9];			//23	//FSD55425
	unsigned char RetrivalReferenceNumber[12];	//32	//FSD55425
    struct   trans_tail_  tail;					//44
};

struct trs_info2_gift_card_act_ext3_
{
    unsigned char opcode;						//0	0x70
    unsigned char function;						//1	0xF5
	unsigned char ECRReferenceNumber[16];		//2
	unsigned char BatchNumber[6];				//18			
	unsigned char BalanceAmount[12];			//24

	unsigned char nu[8];						//36
    struct   trans_tail_  tail;					//44
};

struct trs_media_ext_
{
	unsigned char opcode;      //0x14 <Opcode Value="0x14" />
	unsigned short  no;

	unsigned char fee_type;
	unsigned char table_no;

	unsigned char tender_req_add_fee :1;
	unsigned char fee_tender         :1;
	unsigned char payment_is_change  :1; 
	unsigned char MICR_used   		 :1; 
	unsigned char wic_tax_exempt	 :1;
	unsigned char tender_correction  :1; //TENDER CORRECTION
	unsigned char duplicate_receipt  :1;
	unsigned char barcoded_tender	 :1; //COINSTAR

	unsigned char ext_desc[21];
	unsigned char bank_account[9];
#ifdef PRJ_ROW 	
	unsigned char tender_date[3];        
	unsigned char date_issued[3];        //Split transaction
#else
	unsigned char check_number[6];
#endif

	unsigned char deposit            :1;
	unsigned char withdrawal         :1;
	unsigned char coupon_coin_sale	 :1; 
	unsigned char opt_bag_refund	 :1;
	unsigned char cashback_balance	 :1;  //  Cashback balance transaction
	unsigned char Eft_ext			 :1;
#ifdef PRJ_ROW 	
	unsigned char opt_not_created_inv:1;  // Indicator for Not creadted invoice (Split trans.) 
#else
	unsigned char ChangeConvert	   	 :1;
#endif
	unsigned char LoyaltyVoucher   	 :1;

	unsigned char SavingsDeposit	 :1;//43
	unsigned char bGnrlDeposit	     :1;//43 FS18341
	unsigned char bDepositCover	     :1;//43 FS18341
	unsigned char bCashPurchaseFirstStage :1;//43 //Cash purchase recovery
	unsigned char bCashPurchaseSecondStage :1;//43 //Cash purchase recovery
	unsigned char bCashbackRounding	 :1;
	unsigned char bGiftCardRedemption:1;  //FS3012 FSD22770
	unsigned char bRefundGiftCard	 :1;  //FS3012 FSD22770

	struct   trans_tail_  tail;
};


struct trs_media_ext2_
{
	unsigned char opcode;      //0x15 <Opcode Value="0x15" />

	unsigned char reference_no[11]; //1 Eft refference no

	unsigned char enhanced_MPR_voucher_print :1;
	unsigned char print_cash_balance	        :1;
	unsigned char print_foodstamps_balance 	:1;
	unsigned char VoidTenderNotAllowed  		:1;
	unsigned char voucher_tender   	        :1;	//Return Voucher redemption
	unsigned char opt_voucher			    :1; //Loyalty Voucher redemption
	unsigned char dispNegTenderAmtFlag		:1; //FS1046       BITS    Display tender negative amount flag  
   unsigned char media_ext3					:1;	// HF #10812

	unsigned short eft_tender_no;		//13 
	unsigned char	SettlementDate[8];	//15 Quest DDMMYYYY
	unsigned char  CardType;            //23 Quest
	short AccountType;                  //24 Quest 
	short TransactionType;				//26 Quest
	unsigned long eft_handle;			//28 Nomad EFT TRS handle
	unsigned char voucher_no[10];  		//32 Voucher redemption (BCD format)  
	unsigned char voucher_len ;         //42

	unsigned char AcceptedInSaleMode		:1; //43 FS1055
	unsigned char barcode_tender_cpn		:1; //   FS1094
	unsigned char bSettlementDone			:1; //   FS17494
	unsigned char bVATReturnDone            :1; //   FS4716
	unsigned char bLaybyBalancingTender     :1; //   FS1333
	unsigned char bTPCoverTender            :1; //   FS1333 - Tender purchase cover tender.
	unsigned char bInstantRedemption		:1;
	unsigned char bRefundedTender			:1; //   FSD10281 - Tender purchase in the sale/tender mode

	struct   trans_tail_  tail;          //44
};

struct trs_media_ext3_
{
	unsigned char opcode;      //0x18 <Opcode Value="0x18" />
	unsigned char CashBackType; //None, Prompt Operator, Smart
	long          CashBackValue;
	unsigned char immediately_cashback		 :1; //condition of open drawer
	unsigned char bNameTrsFollow			 :1;
	unsigned char bOctopusCard				 :1;	// EranL: flag for octopus card save transaction
	unsigned char bOctopusCardDeduct		 :1; // Octopus card payment
	unsigned char bRDRedemptionTender		 :1; // FS5721 R$ redemption tender
	unsigned char bVoidTenderIfEftNotConfirm :1; // FS5721 Void tender if Eft answer is not confirm.
	unsigned char bRefundDuplicateReceipt	 :1; //FS7000
	unsigned char bLineTempleateInUse		 :1; //FSD14741
	
	unsigned short	tender_no;
	unsigned char	sBankAccount[12];	// Chip Card payment account
	unsigned char	sDomiciliation[12]; // Chip Card domiciliation number

	unsigned char SignatureCaptureFailed			:1; // HF #10812
	unsigned char bSuppressAdditionCardInfoPrint	:1; //#955
	unsigned char bPreSwipeMedia					:1; //#FSD16142
	unsigned char bIsExternalCouponTrs				:1;	//#31651
	unsigned char bBalanceTransfer				    :1; //FSD22770 
	unsigned char bForceVoid                        :1; //FSD42824
	unsigned char bProvisionalPaymentTender			:1; //#50834
    unsigned char bHashedPanFound                   :1; //FSD34954    


	long lSavebackValue; // Bug #23538

	unsigned char	TrxIdentifyNumber[3];	// 38 BCD

	unsigned char	chNumberOfPayments;		// 41
	unsigned char	sSponsorID[2];			// 42

	struct   trans_tail_  tail;
};

//FSD3582
struct trs_media_ext4_
{
	unsigned char opcode;								//0x19 <Opcode Value="0x19" />
	unsigned char expiry_date[3];						// 1 BCD format yymmdd
	unsigned long ulRewardTenderPromo;					// 4 FSD11575 - The reward tender trigger promotion.
	unsigned char bCouponGeneratedTender			:1;	// 8 Indicate tender ( ususally a rewarding tender) is a result of a coupon.
	unsigned char bATMTender						:1; // 8 FSD14667 ATM (SafePay) tender type
	unsigned char bTenderHasExtraFee				:1; // 8 FSD29811 - Indicate a tender has fee.
	unsigned char bExtraFeeIncludedInTenderAmount	:1; // 8 FSD29811 - Indicates the fee amount is part of the tender paymeny.
	unsigned char bTndrHasRestrictedAmount			:1; // 8 FSD29811 - Indicates a tender has resriction amount due to included items.
	unsigned char opt_long_coupon_number			:1;	// 8 FSD26780 - if the BCDTriggeringCoupon length longer than 7 
														//		the BCDTriggeringCoupon will be writen in the following 0x70,0x91 trs.
	unsigned char bDetailedTender					:1;	// 8 FSD61175 - Mrs V8716 ,FSD32316 - Indicates this tender is detailed.
	unsigned char bVoucherApproved					:1; // 8 FSD55061: 0 - Approved externally, 1 - Approved locally
	unsigned char sBCDTriggeringCoupon[7];				// 9 The coupon that generated the tender
														
	unsigned char referenceNumber[10];					// 16 BCD - FSD13078 - Reference number associated to the issued voucher
	union
	{
		long	  lEftRetuenCardType;					// 26 For Delhaize smash eft
		long	  lTenderCount;							// 26 For Woolworths - stores tender count when trs_media_::count overflows [signed char] (14813)
	};
	unsigned char uchReferenceNumberLen;				// 30 Reference number length
	unsigned char uchExternalValidationAgainst;			// 31 FSD 19134: 0 == None, 1 == LPE.
	unsigned char uchEOTEndrFileSeq;					// 32 FSD29690 - End of ticket endorsement file sequence.
	long		  lNewAmountBalance;					// 33
	short		  shPaymentOption;						// 37
	unsigned char bcdAuthorizationDate[2];				// 39 BCD mmdd
	unsigned char bcdAuthorizationTime[3];				// 41 BCD hhmmss
														
	struct   trans_tail_  tail;							// 44
};

//FSD13919
struct trs_media_ext5_
{
	unsigned char opcode;				// 0	0x26

	unsigned char PONumber[6];			// 1	BCD
	unsigned char PONumberLen;			// 7

	long RxTenderAmount;					//8
	long NonRxTenderAmount;					//12
	short shEftProviderRespCode;			//16
	unsigned long GiftCardTraceID;			//18 authorization code for gift card redemption authorization #67417
	short shOrgTenderNumber;				//22 //TD#77209
	unsigned char uchFuelCardPaymentType;	//24 FSD126489_Storeline_Postilion_EFT_Enhancement_for_Bunker_Card_Commercial_Fuel
	long lBankID;							//25
	long lNumberOfPayments;					//29
	long lbankInstallments;					//33
	long lResponseFlags;					//37
	
	unsigned char bLinkedToDataBar			:1;//41
	unsigned char bProhibitReturnToSaleMode :1;//41  FSD392122 - Partial Tendering
	unsigned char bIsCatalinaCoupon			:1;//41 TD#437457
	unsigned char bNU						:5;//41
	unsigned char NU[1];					//42
	
	unsigned char media_ext6				:1;	//43
	unsigned char OptFsaTender				:1;	//43
	unsigned char bTenderNotEffectBalanceDue:1; //FSD56623
	unsigned char bDisallowLoyalty			:1; //FSD112346_Storeline_Revoke_MMiles_For_Certain_EFT_Payment_Methods
	unsigned char bRoundingTender           :1; 
	unsigned char bPromotionCoupon			:1; //43 FSD#... - GS1
	unsigned char bLocalIssuedBarcode		:1;	//43 FSD314464
	unsigned char bRecalculateTender		:1;	//43

	struct   trans_tail_  tail;				//44
};

struct trs_charge_posting_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x0A <Opcode Value="0x0A" />

    unsigned char cp_name[16];
    unsigned char cp_account_num[12];
    unsigned char cp_status;
    long cp_amount;
    long cp_balance;
    long cp_limit;
    unsigned char cp_upcharge;
    
    struct   trans_tail_  tail;
};


struct trs_external_charge_payment
{
    unsigned char opcode;        //0 0x60	<Opcode Value="0x60"/>
    unsigned char function;      //1 0xC5	<Opcode Value="0xC5"/>
    unsigned char account[10]; //bcd of account, without check  digit, with leading zeros.
    unsigned char is_reversal_charge_payment  :1; //is it reversal charge payment.
    unsigned char nu_2  :1;
    unsigned char nu_3  :1;
    unsigned char nu_4  :1;
    unsigned char nu_5  :1;
    unsigned char nu_6  :1;
    unsigned char nu_7  :1;
    unsigned char nu_8  :1;
    long amount; //always positive.
    unsigned char reseved[27];
    struct   trans_tail_  tail;
};

struct trs_charge_reverse_bal_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x3E	<Opcode Value="0x3E" />

    unsigned char payment  :1;
    unsigned char purchase :1;
    unsigned char nu2      :1;
    unsigned char nu3      :1;
    unsigned char nu4      :1;
    unsigned char nu5      :1;
    unsigned char nu6      :1;
    unsigned char nu7      :1;
    
    unsigned char cp_name[16];
    long cp_limit;
    unsigned char cp_account_num[13];
    long cp_amount;
    long cp_balance;
    
    struct   trans_tail_  tail;
};


struct trs_cost_percent_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x0C <Opcode Value="0x0C" />

    unsigned char start    :1;
    unsigned char nu01     :1;
    unsigned char nu02     :1;
    unsigned char nu03     :1;
    unsigned char nu04     :1;
    unsigned char nu05     :1;
    unsigned char nu06     :1;
    unsigned char nu07     :1;

    unsigned long new_percent;
    unsigned long old_percent;

    unsigned char reserved[33];
    struct   trans_tail_  tail;
};


struct trs_supervisor_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x0D <Opcode Value="0x0D" />

    unsigned char scan_card  :1;
    unsigned char prelim_rtrn:1;
    unsigned char credit_rtrn:1;
    unsigned char credit_sale:1;
    unsigned char auth_voids :1;
    unsigned char mngr_disc  :1;
    unsigned char bResend    :1; // #22084
    unsigned char approved_by_rpo	:1;  //enh #1591 - Bit to determine if approved at POS or by RPO

    unsigned long supervisor;
    unsigned char prvlg;
	unsigned char keylock;

	unsigned char sprvr_name[20];
    
	unsigned char plu_action;          //enh iss #3456SL
	unsigned char transaction_action;  //enh iss #3456SL
    
	unsigned short ushFuncUsed;			 //31 N#3831
    unsigned short ushPosFuncOrCCNumber; //33 FSD26801

    unsigned char  bPosFuncIndicator  :1;	//35	//FSD26801
	unsigned char  bTicketIndicator	  :1;			// FSD#50018
	unsigned char  bPrintSupervisorAuthorization	:1;		//FSD367295
    unsigned char  nu				  :5;

	unsigned short ulCashierId;			//36	//ShlomitG - 13/06/07 - FSD26801 enhancement

    unsigned char reserved[6];			//38 

    struct   trans_tail_  tail;
};

struct trs_buyaid_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x0E <Opcode Value="0x0E" />

    unsigned char nu00     :1;
    unsigned char nu01     :1;
    unsigned char nu02     :1;
    unsigned char nu03     :1;
    unsigned char nu04     :1;
    unsigned char nu05     :1;
    unsigned char nu06     :1;
    unsigned char nu07     :1;

    unsigned short buyaid_no;

    long          amount;
    long          voucher_no;
    unsigned char account[20];

    unsigned char reserved[11];
    struct   trans_tail_  tail;
};


struct trs_staff_
{
    unsigned char opcode;	  	  //0x60	<Opcode Value="0x60" />
    unsigned char function;	  //0x0F		<Opcode Value="0x0F" />

    unsigned char nu00		            :1;
    unsigned char nu01		            :1;
    unsigned char nu02		            :1;
    unsigned char nu03		            :1;
    unsigned char nu04		            :1;
    unsigned char nu05		            :1;
    unsigned char nu06		            :1;
    unsigned char nu07		            :1;

    unsigned char staff[11];  //Ascii null terminated
    long	  		   discount_amount;
    unsigned short  discount_no;
    long	  			discount_percent;
    unsigned short  tender_no;

    unsigned char reserved[18];
    struct   trans_tail_  tail;
};

struct trs_ecca_
{
    unsigned char opcode;			  //Offset 0	//0x60	<Opcode Value="0x60" />
    unsigned char function;			  //Offset 1	//0x10	<Opcode Value="0x10" />
    unsigned char sub_function;		  //Offset 2	//Values:
														//1-name[20]
														//2-addres[30]
														//3- phone[10]

    unsigned char account[10];		  //Offset 3

    unsigned char new_ec	          :1;			//Offset 13
	unsigned char bLinked2CustCntr	  :1;			//Offset 13
    unsigned char bEccaExt			  :1; //#955	//Offset 13
    unsigned char nu02                :1;			//Offset 13
    unsigned char nu03                :1;			//Offset 13
    unsigned char nu04                :1;			//Offset 13
    unsigned char nu05                :1;			//Offset 13
    unsigned char nu06                :1;			//Offset 13


	
    union											//Offset 14
    {

       unsigned char name[20];						//Offset 14


       unsigned char address[30];					//Offset 14


       unsigned char phone[10];						//Offset 14



	   struct										//Offset 14
	   {
		   long lDiscountPercent;					//Offset 14
		   unsigned char uchDiscountLevelIndex;		//Offset 18		//FSD240909 Multi Level Staff Discount Avivp
		   long lDiscountable;                      //Offset 19     // WDM 309911
		   unsigned char DiscountInfo_NU[21];		//Offset 23
	   }DiscountInfo;
    }info;

    struct   trans_tail_  tail;
};

/*************************************/
//Customer at Start of Ticket - Metro
//Add sub_function type 0 - number[20]
//Andre		17/07/01
/*************************************/
struct trs_cust_info_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x11 <Opcode Value="0x11" />
    unsigned char sub_function;   // 0 - number[20]
    							  // 1 - name  [40]
                                  // 2 - addres[40]
                                  // 3 - addres[40]
                                  // 4 - addres[40]
                                  // 5 - phone [20]
								  // 6 - date[12]
								  // 7 - time[10]
	                              // 8 - customer message[40] 
		                          // 9 - name and vat id (customer account).
                                  //10 - Profession (customer account).
	                              //11 - Fiscal office(customer account).
	                              //12 - New/Updated address.
	                              //14 - address4
                                  //15 - address5
								  //19 - Surname
								  //28 - company VAT
								  //29 - company registration
								  //30 - Bank Account number
								  //31 - Detailed Tender
								  //34 - TIN number
								  //35 - Suburb
								  //36 - State
								  //37 - Postcode
								  //38 - Manual Name
							   	  //39 - Manual Address
								  //40 - Additional Customer Name
	                              //41 - Additional Customer Address1
	                              //42 - Additional Customer Address2
								  //43 - Country ISO code.
	                                 

    unsigned char first       :1; // bug # 15979
    unsigned char last        :1; // bug # 15979
    unsigned char cust_acct   :1; // these are details for a customer
#ifdef PRJ_ROW	
    unsigned char bLayByCust  :1; // Lay Bys FS19171
#else
    unsigned char fiscal      :1; // simplified receipt
#endif
#ifdef PRJ_ROW
	unsigned char bMember:1;		//3		Member details
#else
    unsigned char bHomeDelivery   :1;//FS18343
#endif
    
    unsigned char bParcelPickup   :1;//FS18343
    unsigned char bIgnore         :1;
#ifdef PRJ_ROW
    unsigned char bLayByWriteNow :1; // lay by out of ticket: write now !yaron!
#else
	unsigned char bVoidCustAccnt :1; // FSD16729 Void Customer Account
#endif

    union
	{
		//TD#389640
		struct 
		{
			unsigned char sName[35];
			unsigned long ulVatID;
			unsigned char uchFiller;
		}CustNameAndVatID;

		unsigned char data[40];
		
		//FSD221427
		struct
		{
			unsigned char bcdLSTNumber[6];
			unsigned char bcdLSTDate[3];
			unsigned char bcdCSTNumber[6];
			unsigned char bcdCSTDate[3];

			unsigned char filler[22]; 
		}CustTIN;
	};

    struct   trans_tail_  tail;
};


struct trs_sku_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x13 <Opcode Value="0x13" />

    unsigned char nu00        :1;
    unsigned char nu01        :1;
    unsigned char nu02        :1;
    unsigned char nu03        :1;
    unsigned char nu04        :1;
    unsigned char nu05        :1;
    unsigned char nu06        :1;
    unsigned char nu07        :1;

    unsigned char sku[11];
	unsigned char code_plu[11];  

	long price_old;
	long price_new;    
    
    unsigned char reserved[11];

    struct   trans_tail_  tail;
};


struct trs_price_override_
{
    unsigned char opcode;						//0x60	<Opcode Value="0x60" />
    unsigned char function;						//1 0x14	<Opcode Value="0x14" />

    unsigned char opt_markdown				:1; //progressive
    unsigned char opt_electronic_reduced	:1; //Electronic reduction
    unsigned char opt_forcePrice			:1; //Indication that the org price is a force price.#15666
    unsigned char opt_refundPriceOverride	:1; //#2166 - Indicate the transaction was generated due to refund confirm price.
    unsigned char opt_nu14					:1;
    unsigned char opt_qty_is_fuel_gallons	:1; //enh iss #3456SL
    unsigned char opt_qty_is_weight			:1; //enh iss #3456SL
    unsigned char opt_qty_is_decimal_qty	:1; //2 enh iss #3456SL

    long 	 org_price;							//3
    long 	 reduced_price;						//7
    
    long		 qty;							//11
    long	    diff_amount;					//15
    
    unsigned char code[7];						//19
    
    unsigned char type;							//26
    
	char reason_no;						        //27 progressive

	char rtc_cycle;								//28 FSD242819
	char rtc_cycle_counter;						//29 FSD242819
	char filler[2];								//30 

	long org_amount;					        //32 progressive
	unsigned char percentage				:1;	//36 FSD26795
	unsigned char bPriceModification		:1;	//36 FSD24344,#30389
	unsigned char bSpecialCancel			:1;	//#30389,02/06/09 MosheBe - renamed from bPriceModificationCancelItem
	unsigned char bTotalPriceOverride			:1; //36 FSD54403
	unsigned char bRainCheck				:1; //36 Epic 370524 StoreLine Extend Raincheck on POS
	unsigned char nu						:3;	//36 
 
	unsigned short percEntry;					//37	FSD26795
	long lFirstOrgPrice;							//39	#47327
	unsigned char reseved;						//43

	struct   trans_tail_  tail;
};

struct trs_car_
{
    unsigned char opcode;      //0x60 <Opcode Value="0x60" />
    unsigned char function;    //0x05 <Opcode Value="0x05" />

    unsigned char opt_reg_no  :1;
    unsigned char opt_milage  :1;
    unsigned char opt_cvd     :1;
    unsigned char opt_range   :1;
    unsigned char opt_nu14    :1;
    unsigned char opt_nu15    :1;
    unsigned char opt_nu16    :1;
    unsigned char opt_nu17    :1;

    unsigned char reg_no[11];
    unsigned char milage[11];
    unsigned char cvd[1];
    unsigned char range[5];

    unsigned char reseved[13];

    struct   trans_tail_  tail;
};

struct trs_chq_grty_
{
    unsigned char opcode;      //0x60 <Opcode Value="0x60" />
    unsigned char function;    //0x15 <Opcode Value="0x15" />

    unsigned char opt_issue_no_used    :1;
    unsigned char opt_accept_isu_date  :1;
    unsigned char opt_accept_exp_date  :1;
    unsigned char opt_MCR_used         :1;
    unsigned char opt_nu14 			   :1;
    unsigned char opt_nu15 			   :1;
    unsigned char opt_nu16 			   :1;
    unsigned char opt_nu17 			   :1;

    unsigned char cheque_grty_card[10];
    unsigned char grty_card_len;
    
    unsigned char isu_date[2];
    unsigned char exp_date[2];
    unsigned char card_range_no;
    unsigned char issue_no;
    unsigned char auth_card_range_no;
    
    unsigned char reseved[23];

    struct   trans_tail_  tail;
};

struct trs_drive_off_
{
    unsigned char opcode;      //0x60	<Opcode Value="0x60" />
    unsigned char function;    //0x16	<Opcode Value="0x16" />

    unsigned char opt_ctp       :1;
    unsigned char bOutstandingPayment :1; //FSD102401		
    unsigned char opt_nu12      :1;
    unsigned char opt_nu13      :1;
    unsigned char opt_nu14      :1;
    unsigned char opt_nu15      :1;
    unsigned char opt_nu16      :1;
    unsigned char opt_nu17      :1;

    unsigned char reg[11];
    unsigned char surname[20];

    unsigned char car_make[5];
    unsigned char car_year[2];
    unsigned char car_color[3];

    struct   trans_tail_  tail;
};


struct trs_bad_account_
{
    unsigned char opcode;      //0x60 <Opcode Value="0x60" />
    unsigned char function;    //0x17 <Opcode Value="0x17" />

    unsigned char type; //0-bad_account, 1-enhanced 3-ecca

    unsigned char account[10];
    unsigned char account_len;

    unsigned char reseved[30];

    struct   trans_tail_  tail;
};

struct trs_assistant_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x19 <Opcode Value="0x19" />

    unsigned char nu00        :1;
    unsigned char nu01        :1;
    unsigned char nu02        :1;
    unsigned char nu03        :1;
    unsigned char nu04        :1;
    unsigned char nu05        :1;
    unsigned char nu06        :1;
    unsigned char nu07        :1;

    unsigned char no[16];	//in ascii null terminated
    unsigned char bcd[6];	//in BCD up to 12 digits
    
    unsigned char name[19];

    struct   trans_tail_  tail;
};

struct trs_prom_info_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x1A <Opcode Value="0x1A" />

    unsigned char opt_long_prom :1; //PROM_CHNG
    unsigned char opt_info_trans:1; //MBA
    unsigned char opt_was_cancel:1; //FS17238 VOID MANUAL PROMOTION 
    unsigned char opt_reward_by_cashier   :1; //Indicates reward entered by cashier.
    unsigned char bStaffDisc_Promotion    :1;
	unsigned char bRefundDiscount		  :1;
    unsigned char bClientDiscount		  :1;//FSD8900 - true if use discount instead of promotion
    unsigned char bTriggeredByManSegmentFunc :1; // FSD 8152 

    unsigned char promotion_type;	// 3
    unsigned char ext_promotion_type;	// 4
    unsigned char dep_ext_promotion_type;	// 5
    
    unsigned char code[7];			// 6
    unsigned short  promotion_no;	// 13
    unsigned char bucket_no;		// 15
    unsigned short  ext_promotion_no; // 16
    unsigned char ext_bucket_no;	  // 18
    unsigned short  dep_ext_promotion_no;	// 19
    unsigned char dep_ext_bucket_no;		// 21
    
    unsigned char reward_type;				// 22
    unsigned char ext_reward_type;			// 23
    unsigned char dep_ext_reward_type;		// 24

#ifdef PRJ_ROW
#ifdef PRJ_ROW_NEW_PROM
	long          lQualifySpent;		   //  25 #20687 for recover;  CR#38963
	unsigned char uchTriggerScheme;        //  29 #20687 for recover
	long lPromEngineAllocatedPromNo;	   //  30 for 'discounts' , N# 11007
    
	unsigned char uchPromFiscalReportingMethod :2; //34 - "item" == 0, "package" == 1, "total" == 2.
	unsigned char bCollectedPromotion   	   :1; //34 //FSD12648 Indicate this promotion is part of a promotion collector.
	unsigned char bTrigBySegments       	   :1; //34 //FSD12648 Indicate this promotion was triggered by segments.
	unsigned char bDelayedPromo				   :1; //34 - delayed promotion flag
	unsigned char bLaybyItemPromo				:1;	//34 - this is a promotion on layby item level
	unsigned char bLaybyTicketPromo				:1;	//34 - this is a promotion on layby ticket level
	unsigned char bInjectRewardFromDynamicAttr  :1; //34
#else
	//ykl 29/04/10: i needed the lQualifySpent and uchTriggerScheme for porting PE
	//to Foodstuffs. From what I checked, qty_attached_ttl and qty_attached_bucket 
	//are not in use.
	//long          qty_attached_ttl;		   //  25 progressive
    //short 	      qty_attached_bucket[3];  //  29 progressive
	long          lQualifySpent;		   //  25 #20687 for recover
	unsigned char uchTriggerScheme;        //  29 #20687 for recover
	unsigned char notused[4];			   //  30

	unsigned char uchPromFiscalReportingMethod :2; //34 - "item" == 0, "package" == 1, "total" == 2.
	unsigned char bCollectedPromotion   	   :1; //34 //FSD12648 Indicate this promotion is part of a promotion collector.
	unsigned char bTrigBySegments       	   :1; //34 //FSD12648 Indicate this promotion was triggered by segments.
	unsigned char bDelayedPromo				   :1; //34 - delayed promotion flag
	unsigned char bLaybyItemPromo				:1;	//34 - this is a promotion on layby item level
	unsigned char bLaybyTicketPromo				:1;	//34 - this is a promotion on layby ticket level
	unsigned char bInjectRewardFromDynamicAttr  :1; //34
	
#endif
#else
	long          lQualifySpent;		   //  25 #20687 for recover
	unsigned char uchTriggerScheme;        //  29 #20687 for recover
	long lPromEngineAllocatedPromNo;	   //  30 for 'discounts' , N# 11007
    
	unsigned char uchPromFiscalReportingMethod :2; //34 - "item" == 0, "package" == 1, "total" == 2.
	unsigned char bCollectedPromotion   	   :1; //34 //FSD12648 Indicate this promotion is part of a promotion collector.
	unsigned char bTrigBySegments       	   :1; //34 //FSD12648 Indicate this promotion was triggered by segments.
	unsigned char bDelayedPromo				   :1; //34 - delayed promotion flag
	unsigned char bLaybyItemPromo				:1;	//34 - this is a promotion on layby item level
	unsigned char bLaybyTicketPromo				:1;	//34 - this is a promotion on layby ticket level
	unsigned char bInjectRewardFromDynamicAttr  :1; //34
#endif
    long          long_promotion_no;       //  35 PROM_CHNG
	unsigned char group_type;              //  39
	unsigned char apportionment_type;      //  40
    
    unsigned char manualDiscountAmount[3];  // 41 bcd

    struct   trans_tail_  tail;      // 44
};
//TD#316773 //FSD#258806 - Start
/*----------------------------------------------------------------------
Opcode:		0x80 
Subopcode:	0x68
//TRANS_INFO3_PROMOTION_EXT3
-----------------------------------------------------------------------*/
struct trs_prom_info_ext
{
	unsigned char opcode;					//0			//0x80 <Opcode Value="0x80" />
    unsigned char function;					//1			//0x68 <Opcode Value="0x68" />

	unsigned char bTriggeredByCoupon	:1;	//2
	unsigned char notUsed				:7;

	unsigned char notused[41];				//3
	struct   trans_tail_  tail;				// 44
};
//TD#316773 //FSD#258806 - End

/*----------------------------------------------------------------------
TRANS_INFO3_ONLINE_PURCHASE_DATA_TO_PRINT
-----------------------------------------------------------------------*/
struct trs_info3OnlinePurchaseDataToPrint_
{
	unsigned char opcode;			//0x80										//0
	unsigned char function;			//0x6A										//1

	unsigned char szSaleDocumentNumber[9];	//in BCD							//2	
	unsigned char szRechargeCode[9];	//in BCD								//11
	unsigned short shRechargeCodeLength; //TD#383013							//20
	unsigned long lTelephoneNumber;												//22
	unsigned char nu[18];														//26			
	struct   trans_tail_  tail;													//44
};

//TD#384162
/*----------------------------------------------------------------------
TRANS_INFO3_ONLINE_PURCHASE_DATA
-----------------------------------------------------------------------*/
struct trs_info3OnlinePurchaseData_
{
	unsigned char opcode;			//0x80										//0
	unsigned char function;			//0x6B										//1

	char olaIdentifierKey[35];													//2
	unsigned char nu[7];														//37
	struct   trans_tail_  tail;													//44
};

struct trs_clubcard_
{
	unsigned char opcode;           //0x60 <Opcode Value="0x60" />				//0
	unsigned char function;         //0x1B <Opcode Value="0x1B" />				//1

	unsigned char accepted  			:1; // Card was accepted				//2
	unsigned char voided 	   			:1; // Card was voided
	unsigned char MCR_used  			:1; // Card was swiped else keyd in.
	unsigned char staff_disc_card		:1; // Clubcard is a staff disc card
	unsigned char qualify_spent_info	:1;
	unsigned char re_entry       		:1; // Clubcard re-entry
	unsigned char freq_shop_accepted	:1; // progressive (1) ayal
	unsigned char freq_shop_rejected	:1; // progressive (1) ayal

	unsigned char scheme_no;			  // 1 to 9								//3
	unsigned char card_no[20];			  // card no in ascii null terminated	//4
#ifdef PRJ_PRICELINE
	unsigned char  tender_no;				// Card is credit/debit to tender n
	
	unsigned char client_id	:1;				// this is a client record
	unsigned char bMemberDetailsPrompt :1;
	unsigned char bMemberNew	:1; //#408085
	unsigned char bMemberUpdated:1; //#408085
	unsigned char bEOT			:1;
	unsigned char opt_nu	:3;
#else
   unsigned short  tender_no;			  // Card is credit/debit to tender n
#endif

   unsigned char cust_type;			  // panel flag								//26
   long          cust_points;			  // Points up to date					//27
   long          cust_redempt_value;  // redemption value						//31
   unsigned char cust_upd_date[3];	  // Up to date								//35

	unsigned char cust_msg;														//38
   long          qualify_spent;													//39												
	unsigned char CRNG_No;														//43
   
	struct   trans_tail_  tail;													//44
};

//Issue #7703SL
struct trs_clubcard_ext
{
	unsigned char opcode;           //0x60 <Opcode Value="0x60" />
	unsigned char function;         //0x3B <Opcode Value="0x3B" />

	unsigned char BioFreqShopFlg	:1;
	unsigned char bIsHomeGroup		:1;
	unsigned char bIsHomeStore		:1;
	unsigned char bThirdPartyLoyaltyAtBeginOfTicket		:1; //FSD55061&55659
	unsigned char bWasApprovedByEFT						:1; //FSD55061&55659: after QuerySession(); 0 - Approved externally; 1 - Approved locally

	unsigned char bNewSignup		:1; //#387582
	unsigned char bFlyBuyAsSegmentBCP	:1; //FSD#450005: Fly Buy according to configuration Barcode Programming with type Segment
	unsigned char bDisplayCardIndicatorSegmentBCP		:1; //FSD#450005

	short LoyaltyState;
	long  lSessionID;		//FSD55061&55659	
	unsigned char CardNo[10];	// MAX_LEN_LOYALTY_CARD_NO = 20 ==> size is MAX_LEN_LOYALTY_CARD_NO/2 = 10
	long			lResultCode;

	unsigned char TypeNWCC;		//FSD#444616: see TypeLoyaltyScheme_FB, TypeLoyaltyScheme_DiffNWCC,....

	//FSD#450005
	unsigned long	FixedSegment;

	unsigned char nu[16]; //FSD55061&55659: was 39

	struct   trans_tail_  tail;
};

//FSD56623 - CR62119
struct trs_reddem_MA_online_query_
{
	unsigned char opcode;           //0x70 
	unsigned char function;         //0x7D 

	unsigned char uchRedeemMAState;	//2
	long lVoucherCount;				//3
	unsigned long ulPromotionNumber;//7
	unsigned char uchPostalCode[3];	//11
	unsigned char uchBirthDate[4];	//14
	unsigned char uchCardId[10];	//18
	unsigned char nu[16];			//28

	struct   trans_tail_  tail;
};

struct trs_clubcard_info_
{
	unsigned char opcode;           //0x60 <Opcode Value="0x60" />
	unsigned char function;         //0xC4 <Opcode Value="0xC4" />

	unsigned char	sCardNo[10];	//2 card no in BCD
    unsigned short	shExpYear;      //12
	unsigned char	chExpMonth;     //14

    unsigned char	chIssueNo;      //15

	unsigned char	sMasterAccountNo[10]; //16

	unsigned char	bChipCard_used				:1;	//26
	unsigned char   bOctopusLoyaltyCard			:1; //FS5721
	unsigned char	bLoyaltyIssueOnly			:1; //FS5721
	unsigned char   bRocksLoyaltyCard			:1; //FSD6795
	unsigned char	bMasterCardFromBarcode		:1; //FSD18888
	unsigned char	bVoidBarcodeWhenSchemeVoided:1; //FSD18888
	unsigned char	bBadAcctValidated			:1;	//FSD30871
	unsigned char	bBadAcct					:1; // FSD30871

	unsigned short  cardStoreNum;        //27 Member card store number #10555
	unsigned char	uchLoyaltyType;	     //29
	unsigned short  ushTenderNo;		 //30
	unsigned short  ushMasterAccountLen; //32	//YaelB 13/05/08
	unsigned char	uchRedemptionStatus; //34	//FSD56623 - CR62119
	unsigned long   ulCardLongStoreNum;  //35 FSD63030
	
	unsigned char	bOnlineLoyaltyCard				:1; //36 // FSD62522
	unsigned char	bThirdPartyLoyalty				:1;	//#70725,#72200
	unsigned char	bOfflineSegments				:1; // 24 //FSD#231491
	unsigned char	bWineCardType					:1;	// FSD#394174	
	unsigned char	bRMWIdentification				:1;	// FSD450172
	unsigned char   bNotAllowGuardiolaRedemption	:1;	//FSD442705 AlessandroS
	unsigned char	bNU					:2;
	
	
	unsigned char	reserved[4];         //39


	struct   trans_tail_  tail;      // 44
};


//FSD7148

struct trs_media_ext6_
{
	unsigned char opcode;		  //0xC5 TRANS_MEDIA_EXT6	<Opcode Value="0xC5"/>
	
	unsigned char ucTemplatetype;
	unsigned char sAccountDescription[15];
    unsigned char sTrsCertificate[17];
	unsigned long lAuditNumber;
	unsigned char ucNumberOfPayments;
    unsigned char  sRefNo2[4];
    unsigned char ucProviderAccountType;
	struct   trans_tail_  tail;
};

struct trs_media_ext7_
{
	unsigned char opcode;		  //0xC6 TRANS_MEDIA_EXT7	<Opcode Value="0xC6"/>
	
	unsigned char sCardName[33];
    unsigned char sRefNo1[10];  //9+3 from ext6
		

	struct   trans_tail_  tail;
};

struct trs_media_ext8_
{
	unsigned char opcode;		  //0xC7 TRANS_MEDIA_EXT8	<Opcode Value="0xC7"/>
	
	unsigned char sMechantID[16];
    unsigned short shServiceRestrictionCode;
	unsigned char sEmvCryptogram[16];
	unsigned char sWiCodeProduct[2];	//	FSD#294724

	unsigned short ushVoidedTenderSeqNo; //TD#352124
	long lConvertedAmount;				 //FSD#399162
    unsigned char NU[1]; 
		

	struct   trans_tail_  tail;
};

struct trs_media_ext9_
{
	
	unsigned char opcode;      //0 //0xCA TRANS_MEDIA_EXT9	<Opcode Value="0xCA"/>

	char  szHashedPANValue[38];	//1 The Hashed PAN Text
	unsigned short ushTenderReferenceNumber; //39
	unsigned char NU[3]; //41
	
	struct   trans_tail_  tail; //44
};

//CR378184
struct trs_media_ext10_
{	
	unsigned char opcode;		//0 //0xD2 TRANS_MEDIA_EXT10	<Opcode Value="0xD2"/>

	char  sVoucherNumber[14];	//1 Payment voucher number
	char  sVoucherName[29];		//15 Payment voucher name
	
	struct   trans_tail_  tail; //44
};

struct trs_media_ext11_
{
	unsigned char opcode;		//0 //0xD3 TRANS_MEDIA_EXT11	<Opcode Value="0xD3"/>

	long lATMChangeAmount;		//1 // #425633

	//TD#434067-start
	unsigned char bFromPromotion:1;
	unsigned char bnu           :7;
	unsigned short ushMessageOnItemId; 
	unsigned char uchRewardType;        
    //TD#434067-end
	unsigned long lPromotionId;//5   BUG #451799
	unsigned char NU[31];		//9

	struct   trans_tail_  tail; //44
};

//FSD414790 - EW
struct trs_extended_warranty_
{
	unsigned char	opcode;						//0		0x80	TRANS_INFO3
	unsigned char	function;					//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;				//2		0x01	FORTRESS_EXTENDED_WARRANY
	unsigned char	bVoid :1;					//3
	unsigned char	nNU	  :7;			
	char	sMainItemIDInBCD[7];				//4
	long	lSequanceID;						//11
	long	lOriginalTransactionNumber;			//15
	short	shOriginalStoreNumber;				//19
	char	sSerialNumberOfTheMainItemID[15];	//21
	char	sPurchaseDate[4];					//36
	long	lActualPrice;						//40

	struct   trans_tail_  tail; //44
};

//FSD414790 - GreenSection - Start
struct trs_trade_in1_
{
	unsigned char	opcode;						//0		0x80	TRANS_INFO3
	unsigned char	function;					//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;				//2		0x03	TRADE_IN1
	long			lTradeInValue;				//3
	char			sIMEI[15];					//7
	char			sModelNumber[20];			//22
	char			NU[2];						//42
	struct   trans_tail_  tail; //44

};

struct trs_trade_in2_
{
	unsigned char	opcode;						//0		0x80	TRANS_INFO3
	unsigned char	function;					//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;				//2		0x04	TRADE_IN2
	char			sCustomerName[25];			//3
	char			sReasonCode[3];				//28
	char			sOverrideReference[5];		//31
	unsigned char   uchPluCodenum[7];			//36
	char			NU[1];						//43
	struct   trans_tail_  tail; //44

};

struct trs_trade_in3_
{
	unsigned char	opcode;							//0		0x80	TRANS_INFO3
	unsigned char	function;						//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;					//2		0x05	TRADE_IN3
	char			sCustomerDetailsLine1[25];		//3
	char			NU[16];							//28
	struct   trans_tail_  tail; //44

};

struct trs_trade_in4_
{
	unsigned char	opcode;							//0		0x80	TRANS_INFO3
	unsigned char	function;						//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;					//2		0x06	TRADE_IN4
	char			sCustomerDetailsLine2[30];		//3
	char			NU[11];							//33
	struct   trans_tail_  tail; //44

};

struct trs_trade_in5_
{
	unsigned char	opcode;							//0		0x80	TRANS_INFO3
	unsigned char	function;						//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;					//2		0x07	TRADE_IN5
	char			sCustomerDetailsLine3[30];		//3
	char			NU[11];							//33
	struct   trans_tail_  tail; //44

};

struct trs_trade_in6_
{
	unsigned char	opcode;							//0		0x80	TRANS_INFO3
	unsigned char	function;						//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;					//2		0x08	TRADE_IN6
	char			sCustomerDetailsLine4[30];		//3
	char			NU[11];							//33
	struct   trans_tail_  tail; //44

};

struct trs_serial_number_
{
	unsigned char	opcode;							//0		0x80	TRANS_INFO3
	unsigned char	function;						//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;					//2		0x09	FORTRESS_SERIAL_NUMBER
	unsigned char	uchItemCodeInBCD[7];			//3
	char			sSerialNumber1[16];				//10
	char			sSerialNumber2[16];				//26
	char			NU[2];							//42
	struct   trans_tail_  tail; //44
	
};

//FSD414790 - Remark line text
struct trs_remark_line_
{
	unsigned char	opcode;						//0		0x80	TRANS_INFO3
	unsigned char	function;					//1		0x92	TRANS_INFO3_FORTRESS
	unsigned char	subfunction;				//2		0x0A	TRADE_IN1
	unsigned char	uchTransactionSeqNumber;	//3		0 , 1  , 2  , 3
	char			sTextRemark[30];			//4
	char			NU[10];						//34
	struct   trans_tail_  tail;					//44

};

//FSD414790-GreenSection - End

struct trs_request_time_
{
	
	unsigned char opcode;					//0		0x80	TRANS_INFO3
	unsigned char subOpcode;  				//1		0x36	TRANS_INFO3_REQUEST_TIME

	unsigned char  AuthorizationSessionBeginsTimeBCD[9];		//2  
	unsigned char  OnlineAuthorizationStartedTimeBCD[9];		//11
	unsigned char  AuthorizationSessionCompletedTimeBCD[9];		//20

	unsigned long lTotalNetworkTime;							//29
	
	unsigned char NU[11]; //33
	
	struct   trans_tail_  tail; //44
};

struct trs_request_time2_
{
	
	unsigned char opcode;					//0		0x80	TRANS_INFO3
	unsigned char subOpcode;  				//1		0x3F	TRANS_INFO3_REQUEST_TIME2

	unsigned char  ApplicationSelectionTimingTimeBCD[9];	// 2
	unsigned char  CardProcessingBeginsTimeBCD[9];			// 11
	unsigned char  CashbackProcessingStartTimeBCD[9];		// 20
	unsigned char  CashbackProcessingEndedTimeBCD[9];		// 29

	unsigned char NU[6]; //38

	struct   trans_tail_  tail; //44
};

struct trs_request_time3_
{
	
	unsigned char opcode;					//0		0x80	TRANS_INFO3
	unsigned char subOpcode;  				//1		0x40	TRANS_INFO3_REQUEST_TIME3

	unsigned char  PinEntryStartedTimeBCD[9]; //2
	unsigned char  PinEntryCompetedTimeBCD[9]; //11

	unsigned char  NU[24]; //20

	struct   trans_tail_  tail; //44
};

//FSD64199 - definition for enhanced coupon details transaction
struct trs_enhanced_coupon_details_
{
	unsigned char uchOpcode;					//0	0xCB TRANS_ENHANCED_COUPON_DETAILS

	unsigned char sCouponNumberBCD[10];			//1

	unsigned char sTrigerredPromNumberBCD[5];	//11
	unsigned char uchGroupType;					//16
	unsigned long ulFirstThreshold;			    //17
	unsigned long ulSecondThreshold;			//21
	unsigned long ulMinQualifyingBalance;		//25

	unsigned char uchRewardType;				//29
	unsigned long ulRewardMemberAccount;		//30
	long lRewardAmount;							//34
	unsigned char uchRewardingTender;			//38
	unsigned char uchPromMaxNumOfRewards;	    //39

	unsigned char bIsBlocked						:1;	//40
	unsigned char bDeductMarkedTendersFromQualSpend :1; 
	unsigned char bMemberCardRequired				:1;
	unsigned char bIsCatalinaCoupon					:1;
	unsigned char bCouponCancelled					:1; //#88668
	unsigned char bCouponKeyed						:1; //#114581
	unsigned char bPromotionCoupon				    :1; // FSD#... - GS1 NEEDED???
	unsigned char NotUsed							:1;

	unsigned short ushQty;						//41 // FSD#... - GS1

	unsigned char uchReserved[1];				//43

	struct   trans_tail_  tail;					//44
};


//FSD7148

// save customer points status from server
struct trs_loyalty_cust_
{
	unsigned char opcode;					// 0	//0x60									<Opcode Value="0x60" />
	unsigned char function;					// 1	//0xC1 - TRANS_INFO_LOYALTY_CUSTOMER	<Opcode Value="0xC1" />

	unsigned char CardNo[10];				// 2	// loyalty card no in BCD

	long          lCustPoints;				// 12	// Points up to date
	long          lTodayEarnedPoints;		// 16	// Points earned during the day - From SERVER
	long          lTodayRedeemedPoints;		// 20	// Points redeemed during the day - From SERVER

	unsigned char RecordInServer		:1;	// 24	// Customer in server cust.qdx file
	
	unsigned char uchRewardAllowed		:1; // 24	// Bug #12769 Saving if Redemption is allowed
	unsigned char bBalanceQuery			:1;  // 24   //#61768 - indication that 60-C1 was written as a result of choosing the 'Points Balance' function.
	unsigned char notFirstLoyalInTicket	:1; // TD54927; SplitUpdateV8551
	unsigned char nu_5					:4; // 24
   
	unsigned short segment_id1;				// 25
	unsigned short segment_id2;				// 27
	unsigned short segment_id3;				// 29
	unsigned short segment_id4;				// 31
	unsigned short segment_id5;				// 33

	unsigned short ushStatusRelatedMsg;		// 35	// TD#52737
	
	short shCardNumberLen;					// 37   // TD#70383

	unsigned char nu_19[5];					// 39
	
	struct   trans_tail_  tail;				// 44
};

struct trs_eft_info_data_ 
{
	unsigned char opcode;				//0x60	<Opcode Value="0x60" />
	unsigned char function;				//0xC2	<Opcode Value="0xC2" />	- TRANS_INFO_EFT_DATA

	unsigned short SessionID;			//2 
	unsigned char CustomerWaitTime;     // 4
	unsigned char TotalNetworkTime;     // 5

	unsigned char CommunicationTimeOut :1;	// 6
	unsigned char OfflineAuthorization :1;
	unsigned char OutPrintMsg		   :1;
	unsigned char CancelLastReq		   :1;
	unsigned char RepeatInfoReq		   :1;	
	unsigned char bOffline			   :1;		// FSD#30638
	unsigned char bCanceled            :1;      // FSD63194 - transaction was canceled
	unsigned char bTimedOut            :1;		// FSD63194 - transaction was canceled due to
	                                            //            Time-Out

	unsigned char card_type; //7 //CARD_TYPE_CHEQUE_CARD    0   // 080801  0 - undefined ( includes cheque cards )
								 //CARD_TYPE_DEBIT_CARD     1   // 080801  1 - debit card ...
								 //CARD_TYPE_CREDIT_CARD    2   // 080801  2 - credit card
								 //CARD_TYPE_CHARGE_CARD    3   // 080801 3 - charge card
								 //CARD_TYPE_FUEL_CARD      4   // 080801 4 - fuel card
								 //CARD_TYPE_SECURITY       6   // 080801  6 - security card
								 //CARD_TYPE_LOYALTY        7   // 080801  7 - Loyalty
								 //CARD_TYPE_STAFF_DISCOUNT 8   // 080801  8 - staff discount
								 //CARD_TYPE_CONSUMER_PANEL 9   // 080801  9 - consumer panel
	                             // Delhaize other defines
	unsigned short CardRangeNum; // 8
	unsigned char  XAuthCode[9]; // 10  // 221101 auth code from EFT provider 
										// BASE24 "0000" -if online authorization
										// BASE24 "IHCF" -if only check in bad account list
	unsigned char chAuthorizSrc; // 19
								 /*
										#define BankAuthorization     1
										#define MainProviderAuthorization   2
										#define SubProviderAuthorization    3
										#define OfflineAuthorization  4
										#define ManuelAuthorization   5
								  */
	long	TerminalID;          //20  for Smash Delhaize
	long	TransactionNumber;   //24  for Smash Delhaize
	unsigned short EftTypeNum;   //28  for Smash Delhaize CR #13504

	unsigned char OfflineTrs	            :1;//30 FS21345
	unsigned char bAdditionalPaymentExist	:1;//30 FSD26155
        							           //   FSD26155 - If flag is TRUE it means the followed
										       //   media transaction (0x04) is the result of
										       //   additional payment application (Wynid - Cetelem)
	unsigned char bDoNotPrintExpiryDate		:1;//30 FSD64200
	unsigned char bNewVoucherEntry  		:1;//30 FSD93620: Voucher Entry Function
	unsigned char bProcessingType  			:1;//30 FSD93620: Voucher Entry Function                              
                                               //   1-Online 0-Offline
	unsigned char bManualVoucherEntered		:1;//30 FSD93620: Voucher Entry Function    
	unsigned char NU_Bits					:2;

	unsigned short ushTenderNumber;	//31 Tender number
	
	unsigned char sPinPadId[8];	//33 FSD1332 (Interfaces) Pinpad id 

	unsigned char chAuthorizationReason;	//41
											/*
											AUTHORIZATION_REASON_UNKNOWN			= 0, 
											AUTHORIZATION_REASON_ISSUER				= 1, 
											AUTHORIZATION_REASON_CARD_LIMIT			= 2, 
											AUTHORIZATION_REASON_MERCHANT_LIMIT		= 3,
											AUTHORIZATION_REASON_CARD_BALANCE		= 4,
											AUTHORIZATION_REASON_VELOCITY_BALANCE	= 5
											*/
	unsigned char chFallbackType;			//42
											/*
											NO_FALLBACK								= 0, 
											FALLBACK_TYPE_ICC_2_SWIPE				= 1,
											FALLBACK_TYPE_SWIPE_2_PAN_ENTRY			= 2
											*/

	unsigned char ucTemplateId;				// 43


	struct   trans_tail_  tail;  //44
};


struct trs_msg_min_age_
{
	unsigned char opcode;           //0x60	<Opcode Value="0x60" />
	unsigned char function;         //0x3A	<Opcode Value="0x3A" />

	unsigned char min_age;
   
	unsigned char reserved[41];
   
	struct   trans_tail_  tail;
};

struct trs_staff_card_
{
	unsigned char opcode;           //0x60
	unsigned char function;         //0xB6

	unsigned char MCR_used  	   	   :1; // Card was swiped/keyd
	unsigned char not_used  		   :7; 
	unsigned char scheme_no;			  // 1 to 9
	unsigned char card_no[20];			  // card no in ascii null terminated
    unsigned short  tender_no;			  // Card is credit/debit to tender n
	unsigned char crng_no;                // Card Range number
	long	  	  discount_percent;       // Staff discount percent
	long		staff_qualify_amount;	//31 

	unsigned char exp_date[4];			//35
	unsigned char issue_no;             //39 
	unsigned char  not_used1[4];		//40

	struct   trans_tail_  tail;         //44
};

struct trs_info_tpf_recall_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60"/>
	unsigned char function;  //0xB7	<Opcode Value="0xB7"/>		item data for recall

    unsigned char plu_code[7];	 //2 plu number

	struct
	{
		unsigned char type;	 //2-date, 3-integer, 4-decimal, 5-alpha requests
		unsigned char number; 
	}field[10];					//9


	unsigned char refund_tpf_item  :1;
	unsigned char price_curreny	   :1;  // 0 - defualt, 1 - euro.
	unsigned char RTC              :1;	// 0 - Normal, 1 - RTC item.
	unsigned char void_item        :1;  // 0 - scnanned , 1 - voided
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;		// 29
									  //msg number that was used from e-topup variant 
	unsigned char	Qty[6];					// 30
	unsigned char   Amount[5];				// 36

	unsigned char reserved[3];				// 41

	struct  trans_tail_  tail;				// 44
};

struct trs_points_
{
	unsigned char opcode;         	//0x60 <Opcode Value="0x60" />
	unsigned char function;       	//0x1C <Opcode Value="0x1C" />

	unsigned char info_only			:1;
	unsigned char cc_re_entry		:1;
	unsigned char opt_long_prom		:1; //PROM_CHNG
	unsigned char HomeStore			:1;
	unsigned char AccountUpdate		:1;
	unsigned char ChangeConversion	:1;
	unsigned char MessageUpdate		:1;
	unsigned char barcode_points	:1;  // 2

	unsigned char  scheme_no;		//3 1 to 9
	unsigned short promotion_no;	//4 2 lowest bytes (right)
	unsigned char  card_no[20];		//6 card no in ascii null terminated
	long		   qualify_spent;	//26 QS
	unsigned char  promotion_type;  //30

	unsigned char  Count;			//31 number of times reward was accepted //31

	unsigned char  origion_points			:1;
	unsigned char  PointsUpdatedInChipCard	:1;
	unsigned char  opt_cancel   			:1;
	unsigned char  opt_was_cancel			:1;
	unsigned char  opt_info_LBSale			:1; //FS19171_LayBysPoints
	unsigned char  opt_LBSale				:1; //FS19171_LayBysPoints
	unsigned char  active_kids_points		:1; //FSD9034
	unsigned char  total_reward_points		:1; //FSD71759 this trs just stores change in reward points (info only)

	unsigned char  decimalPlaces;   //33 FSD71759 for REWARD_POINTS transaction we need to store decimal points

	long		   points;			// 34	
	long		   bonus_points;    // 38
	unsigned short long_promotion_no; //42 PROM_CHNG - 2 highest bytes (left)

	struct   trans_tail_  tail;       //44
};

struct trs_points_ext_
{//TRANS_INFO2_POINTS_EXT
	unsigned char opcode;         	//0x70 <Opcode Value="0x70" />
	unsigned char function;       	//0xF2 <Opcode Value="0xF2" />

	unsigned char sOfferCode[10];		  //2
	long	lBonusPoints;				  //12
	unsigned char NU[28];		   		  //16

	struct trans_tail_ tail;    	      //44
};

//Albertson's fuel reward
struct trs_fuel_reward_
{
	unsigned char opcode;         	//0x60 <Opcode Value="0x60" />
	unsigned char function;       	//0x6E <Opcode Value="0x6E" />

	unsigned long program_no;		
	unsigned long promotion_no;
	unsigned char plu_code[7]; //BCD
	unsigned char price[7];
	long		  points;
	short		  count; // counts the total numbers of promotions given 
	short		  dep_no;

	unsigned char reserved[12];

   struct   trans_tail_  tail;
};

//Albertson's fuel reward
struct trs_voucher_
{
   unsigned char opcode;         	//0x60 <Opcode Value="0x60" />
   unsigned char function;       	//0x5F <Opcode Value="0x5F" />

   unsigned long program_no;		
   unsigned char voucher_no[10];
   unsigned char key_code[4];
   long			 points;		
   short template_type;		

   unsigned char reserved[18];

   struct   trans_tail_  tail;
};

// trs_track_ stores PAN "track" data.  Originally this was for tracks 1,2,3
// read from the card.  For PCI compliance (FSD93620) this now includes replacement
// data as we no longer process unencrypted (track 2) card numbers etc.

enum TrackType { trackType1=1, trackType2, trackType3, // original 3 track types
                 trackTypeEPAN=20,            // encrypted PAN (of form 123456X12345678901234 where X=A-F)
                 trackTypeToken,              // token used instead of PAN (20 digit number)
                 trackTypeTruncPAN,           // truncated PAN (something like 123456 ... 1234)
				 trackTypeEPANNoClean,        // EPAN but clean not required
                 trackTypeClearPAN,           // Clear PAN
};
struct trs_track_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
	unsigned char function;       //0x1D <Opcode Value="0x1D" />

	unsigned char first		   :1;
	unsigned char last         :1;
	unsigned char bPCIPAN      :1;		//PCIDSS
	unsigned char bCCDeposit   :1;		//#53845
	unsigned char nu04         :1;
	unsigned char nu05         :1;
	unsigned char nu06         :1;
	unsigned char continuation :1;

	unsigned char track_no;   // see enum above
	unsigned char data[40];

	struct   trans_tail_  tail;
};


struct trs_cash_in_draw_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
	unsigned char function;       //0x1E <Opcode Value="0x1E" />

	unsigned char too_much    :1; //Assistance
	unsigned char not_enough  :1;	//Topup
	unsigned char nu02		  :1;
	unsigned char nu03		  :1;
	unsigned char nu04		  :1;
	unsigned char nu05		  :1;
	unsigned char nu06		  :1;
	unsigned char nu07		  :1;
   
	long CashInDrawer;				//FSD15007
	unsigned long SupervisorNo;		//FSD15007_040606D
	long		  DrawerLimit;		//FSD15007
	unsigned char data[29];

	struct   trans_tail_  tail;
};


struct trs_wrong_password_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
	unsigned char function;       //0x1F <Opcode Value="0x1F" />

	unsigned char mode;	// 1-at sign on 2-at secure
   
	unsigned short  cashier;
	unsigned short  password;
   
	unsigned char data[37];


	struct   trans_tail_  tail;
};



struct trs_freq_shopper_
{
    unsigned char opcode;	  	//0x60 <Opcode Value="0x60" />
    unsigned char function;	    //0x20 <Opcode Value="0x20" />

    unsigned char code[7];


    unsigned char reward_check_used  :1;
    unsigned char opt_not_net_fs     :1; 
    unsigned char nu02	             :1;
    unsigned char nu03	             :1;
    unsigned char nu04	             :1;
    unsigned char nu05	             :1;
    unsigned char nu06	             :1;
    unsigned char nu07	             :1;

    long  old_price;
    long  new_price;
    long  qty;
    long  save_amount;
	unsigned short dept;

    unsigned char reserved[16];
    struct   trans_tail_  tail;
};


struct trs_unlock_upd_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
	unsigned char function;       //0x21 <Opcode Value="0x21" />

	unsigned char add_value   :1;
	unsigned char write_value :1;
	unsigned char unlock      :1;
	unsigned char nu03        :1;
	unsigned char nu04        :1;
	unsigned char nu05        :1;
	unsigned char nu06        :1;
	unsigned char nu07        :1;

	unsigned char qdx_file;
	unsigned char index[12];
   unsigned short  value_offset;
   long			  value;
   unsigned short  unlock_offset;
   
	unsigned char reserved[20];

	struct   trans_tail_  tail;
};

struct trs_redemption_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
	unsigned char function;       //0x22 <Opcode Value="0x22" />

	unsigned char InstantRedemption			:1;
	unsigned char PointsUpdatedInChipCard	:1;
	unsigned char PromotionRedemption		:1; // #11205
	unsigned char bMemberAccountRedemption	:1; //FSD11780
	unsigned char bHomeStore				:1; // TD#55980 
	unsigned char bOriginPoints				:1;	//TD#126009
	unsigned char nu06						:1;
	unsigned char nu07						:1;

	unsigned char scheme_no;			  // 1 to 9
	unsigned char card_no[20];			  // card no in ascii null terminated
	unsigned char cust_type;			  // panel flag
	long          cust_redempt_value;  // redemption value
	long          cust_redempt_used;   // redemption used
	unsigned long ulMemberAccountId;   // Member account used for the redemption (FSD11780)
	
	unsigned char reserved[7];
	struct   trans_tail_  tail;
};


struct trs_apac_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
	unsigned char function;       //0x23	<Opcode Value="0x23"/>

	unsigned char first       :1;
	unsigned char all_depts   :1;
	unsigned char nu02        :1;
	unsigned char nu03        :1;
	unsigned char nu04        :1;
	unsigned char nu05        :1;
	unsigned char nu06        :1;
	unsigned char nu07        :1;

	unsigned short  dept_used[20];
	unsigned char reserved;

	struct   trans_tail_  tail;
};


struct trs_tndr_cpn_
{
	unsigned char opcode;         //0x60 <Opcode Value="0x60" />
	unsigned char function;       //0x32 <Opcode Value="0x32" />

	unsigned char opt_coupon_ticket        :1;
	unsigned char master_coupon_use        :1;
	unsigned char opt_cancel_coupon        :1;
	unsigned char opt_coupone_was_canceled :1;
	unsigned char opt_manual_keyed         :1; // #16433
	unsigned char nu05                     :1;
	unsigned char nu06                     :1;
	unsigned char nu07                     :1;

	unsigned char code[7];
    long		  value;
    short		  threshold_qty;
    long 		  min_purchase;
	unsigned char type;
    long 		  qty;
    long		  ttl_value;
   
	unsigned char code_master_cpn[7];
    unsigned char option;        

    unsigned char reserved[7];   

	struct   trans_tail_  tail;
};



struct trs_train_acct_
{
    unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
    unsigned char function;    //0x33	<Opcode Value="0x33"/>

    unsigned short  media_no;

    unsigned char opt_charge_payment   :1;
    unsigned char opt_charge_reverse   :1;
    unsigned char opt_nu13             :1;
    unsigned char opt_nu14             :1;
    unsigned char opt_nu15             :1;
    unsigned char opt_nu16             :1;
    unsigned char opt_nu17             :1;
    unsigned char opt_nu18             :1;

    unsigned char cp_account_num[12];
    unsigned char cp_status;

    long cp_amount;
    long cp_balance;
    long cp_limit;

    unsigned char resevd[14];
    struct   trans_tail_  tail;
};


struct trs_ticket_trailer_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60" />
	unsigned char function;       //0x34	<Opcode Value="0x34" />

	unsigned char nu00        :1;
	unsigned char nu01        :1;
	unsigned char nu02        :1;
	unsigned char nu03        :1;
	unsigned char nu04        :1;
	unsigned char nu05        :1;
	unsigned char nu06        :1;
	unsigned char nu07        :1;

	unsigned char date[3]; // BCD yymmdd
	unsigned char time[3]; // BCD hhmmss
   unsigned long ticket_no;
   unsigned short cashier_no;	// #9547
   unsigned short pos_no;		// #9547
   
	unsigned char reserved[27];

	struct   trans_tail_  tail;
};



struct trs_finish_media_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60" />
	unsigned char function;       //0x35	<Opcode Value="0x35" />

	unsigned long fuel_prepay_sync_no;		// PosPump : Pre-Pay		// Offset 2
	unsigned long security_number;          // Offset 6
   
	unsigned char bFastFinishMedia	:1;		// Offset 10
	unsigned char NU7				:7;

	short shPromCount;						// Offset 11		// #103665
	unsigned char reserved[31];				// Offset 13		

	struct   trans_tail_  tail;				// Offset 44	
};


struct trs_q_length_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60" />
	unsigned char function;       //0x37	<Opcode Value="0x37" />

	unsigned char nu00        :1;
	unsigned char nu01        :1;
	unsigned char nu02        :1;
	unsigned char nu03        :1;
	unsigned char nu04        :1;
	unsigned char nu05        :1;
	unsigned char nu06        :1;
	unsigned char nu07        :1;

	unsigned short  q_length;
	unsigned short  alert_q_length;
   
	unsigned char reserved[37];

	struct   trans_tail_  tail;
};


struct trs_eft_print_data_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x38	<Opcode Value="0x38" />

    unsigned char line_no    :6;
    unsigned char first_line :1;
    unsigned char last_line  :1;
    
    unsigned char data[41];
    
    struct   trans_tail_  tail;
};

struct trs_alcohol_restricted_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x39	<Opcode Value="0x39" />

    unsigned char restricted         :1;
    unsigned char future_restricted  :1;
    unsigned char sale_restriction   :1;
    unsigned char void_restriction   :1;
    unsigned char refund_restriction :1;
    unsigned char nu14 :1;
    unsigned char nu15 :1;
    unsigned char nu16 :1;
    
    unsigned char code[7];
    unsigned short  dept;
    unsigned short  hour;
    unsigned short  minute;
    
    long amount;
    
    unsigned char nu[24];
    
    struct   trans_tail_  tail;
};

struct trs_extra_card_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60" />
	unsigned char function;       //0x27	<Opcode Value="0x27" />

	unsigned char guarantee         :1; //Funds guarantee 
	unsigned char home_shopping     :1;
	unsigned char credit_card       :1;
	unsigned char debit_card        :1;
	unsigned char smart_card        :1;
	unsigned char smart_card_track2 :1;
	unsigned char t7_eft			:1;      //EFT
	unsigned char media_ext3        :1;	//Media extention 3 follows - flag used by ROW

	unsigned char voucher_time[3];		//3
	unsigned char tender_eft_group;		//6
	unsigned char merchant_no[15];		//7
	unsigned char sponcer_no;			//22
    long		  cash_back;			//23
   
	unsigned char branch[6];			//27 branch no, null terminated
   
    short cred_reentry_receipt;			//33
    short cred_reentry_seq_no;			//35
	unsigned char pos_entry_mode;		//37
	unsigned char auth_resp_code[2];	//38
   
	unsigned char pak_cvv2[2];			//40 fill with 'A' FS1134 pak move to

	unsigned char sPreTrack2[2];		//42	FS17494 any chars before track2.

	struct   trans_tail_  tail;
};

struct trs_extra_card2_ // FSD#59744
{
	unsigned char opcode;              // 0	0x70	TRANS_INFO2
    unsigned char subopcode;		   // 1	0xAF	TRANS_INFO2_EXTRA_CARD_INFO

	unsigned char szEftModuleName[35]; // 2

	unsigned short ushPosNumber;	   // 37

	unsigned char NU[5];			   // 39

	struct trans_tail_ tail;		   // 44
};

struct CardTypeFlag_   // 191201 for 6028.. transaction
{
	char	ChequeGarenteeCard_Type	:1; 
	char	DebitCard_Type			:1;
	char	CreditCard_Type			:1;
	char	FuelCard_Type			:1;
	char	SecurityCard_Type		:1;
	char	LoyaltyCard_Type		:1;
	char	StaffDiscountCard_Type	:1;
	char	ConsumerPanelCard_Type	:1;
};

struct trs_ola_result_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x28	<Opcode Value="0x28" />
	unsigned char sub_func; 	//0-Ola results	<Opcode Value="0x00" />

	unsigned char card_accepted    :1;  // 3
	unsigned char hot_card         :1;
	unsigned char garanteed        :1;
	unsigned char not_garanteed    :1;
	unsigned char referral         :1;
	unsigned char extra_id         :1;
	unsigned char extra_trs        :1;
	unsigned char offline_auth     :1;	// 041201

	unsigned long msg_no;	// 4

	unsigned char card_type; // 8
	unsigned char trans_type;	// 9
	unsigned char auth_type;	// 10
	unsigned char auth_reason;	// 11
   
	short         ans_rtc;  //12     0    - Ok
									// 1-10 - Host answer
									// -1   - BAD
									// -6   - Timeout  
   
	unsigned char auth_code[10]; // 14
	unsigned char confirm_code;	 // 24	
   
	unsigned char account[10]; // 25 BCD up to 19 digits
	unsigned char account_len; // 35
			long amount;		// 36
    char          RefuesdType;   // 40 291101  

	struct CardTypeFlag_ CardTypeFlag;		// 41

											// 42
	unsigned char cheque_garantee			:1; // 181201 move
	unsigned char bProviderNotAvailable		:1; //FSD63194
	unsigned char nu_bit					:6; // 42
   
	unsigned char pump;     // 43

	struct   trans_tail_  tail;
};

struct trs_ola_error_
{
	unsigned char opcode;				//0x60
	unsigned char function;				//0x28
	unsigned char sub_func;				//0xA7 TRANS_INFO_OLA_ERROR

	char error[41];						//3

	struct   trans_tail_  tail;
};

//FSD34954
struct trs_ola_PCIDSS_HashedPAN_	//PCIDSS
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x28	<Opcode Value="0x28" />
	unsigned char sub_func; 	//0-Ola results	<Opcode Value="0x4A" />
	
	unsigned char uchSeqNum;	//3 Transaction sequence number
	unsigned char bLastSeqTrs	:1;	//4
	unsigned char bDssFaild		:1; //is DSS failed
	unsigned char bNotUsed		:6;
	unsigned char uchHashedPANValueLen;		//5	The length-text HashedPAN value
	/*short shSeqNum;				//3 Transaction sequence number
	short shLastSeqNum;			//5 The last sequence number will be send
	short shHashedPANValueLen;	//7 The length-text HashedPAN value (max 34)*/
	char  szHashedPANValue[38];	//6 The Hashed PAN Text

	struct   trans_tail_  tail;
};

//FSD 57796 - EFT devices probe transaction
struct trs_ola_EFT_Devices_Probe_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x28	<Opcode Value="0x28" />
	unsigned char sub_func; 	//Ola results <Opcode Value="0x4B" />
	
	unsigned char ucNotUsed; //3

	unsigned char sSwipeAndParkID[10];   //4
	unsigned char sSwipeAndParkFirmwareVersion[4]; //14
	unsigned char sSwipeAndParkApplicationVersion[6]; //18

	unsigned char szPinPadID[10];	//24
	unsigned char szPinPadFirmwareVersion[4]; //34
	unsigned char szPinPadApplicationVersion[6]; //38
	
	struct   trans_tail_  tail; //44

};




struct trs_ola_req_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60" />
	unsigned char function;  //0x28	<Opcode Value="0x28" />
	unsigned char sub_func;	 //0x01	<Opcode Value="0x01" />

	unsigned char open_comm_failed		:1;
	unsigned char tx_failed				:1;
	unsigned char CancelLastReq			:1; // for Delhaize Smash
	unsigned char RepeatInfoReq			:1; // for Delhaize Smash	
	unsigned char bRequestWasCanceled   :1; //FSD63194
	unsigned char bSettlementRequiredAfterAuth	:1; //#131589
	unsigned char nu06					:1;
	unsigned char nu07					:1;  // 3

	unsigned long msg_no;  // 4
   
	unsigned char card_data[24]; // 8 nul terminated
	unsigned char card_type;     // 32

	unsigned char trans_type;	// 33
	unsigned char auth_type;	// 34
	unsigned char auth_reason;	// 35
   
	long			  req_amount; //36 amount + cashback

	struct CardTypeFlag_ CardTypeFlag; // 40	

	unsigned char	tender_no;  //41 120302 for Delhaize	
	unsigned char	reserved;   //42 
   
	unsigned char pump;			//43

	struct   trans_tail_  tail;	// 44
};


struct trs_ola_ack_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60" />
	unsigned char function;  //0x28	<Opcode Value="0x28" />
	unsigned char sub_func;	 //0x02	<Opcode Value="0x02" />

	unsigned char timeout          :1;
	unsigned char msg_rejected     :1;                   
	unsigned char ack_rejected     :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long ack_msg_no;
   
	unsigned long timeout_value;
			   short  ack_rtc;
   
	unsigned char reserved[29];
   
	unsigned char pump;

	struct   trans_tail_  tail;
};


struct trs_ola_ans_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60" />
	unsigned char function;  //0x28	<Opcode Value="0x28" />
	unsigned char sub_func;	 //0x03	<Opcode Value="0x03" />

	unsigned char timeout          :1;
	unsigned char msg_rejected     :1;                   
	unsigned char nu02             :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long ans_msg_no;
   
	unsigned long timeout_value;
	unsigned char msg_type;	//hold
	unsigned char confirm_code;
	         short  ans_rtc;
   unsigned char auth_code[10];
	unsigned short  delay;
   
   //PROJECT_ORANGE
   unsigned long club_plus_bal;     
   unsigned char club_plus_date[6]; 
   
	unsigned char reserved[5];

	unsigned char pump;
   
	struct   trans_tail_  tail;

};


struct trs_ola_free_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60" />
	unsigned char function;  //0x28	<Opcode Value="0x28" />
	unsigned char sub_func;	 //0x04	<Opcode Value="0x04" />

	unsigned char with_confirm     :1;
	unsigned char nu01             :1;
	unsigned char nu02             :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long conf_msg_no;
	unsigned char confirm_code;
	unsigned char auth_code[10];
   
	unsigned char reserved[24];
   
	unsigned char pump;

	struct   trans_tail_  tail;
};


// Ext.trs of trs_ola_result_
struct trs_ola_result_ext_
{
	unsigned char opcode;		//0 0x60	<Opcode Value="0x60" />
	unsigned char function;		//1 0x28	<Opcode Value="0x28" />
	unsigned char sub_func; 	//2 0x05	<Opcode Value="0x05" />	Ola results extra SUB_FUNC_OLA_PROVIDER_MESSAGE

	unsigned char ResultMsg[20];// 3 Message from authorizer

	unsigned char exp_date[2]; //  23


	unsigned char hot_card					:1;
	unsigned char opt_MCR_used				:1;
	unsigned char ReasonPrinterProblem_flag	:1;
	unsigned char ReasonWrongSignature_flag	:1; 
	unsigned char ReasonFrozenCard_flag		:1; 
	unsigned char nu						:3; /*25*/

	struct CardTypeFlag_ CardTypeFlag; //26

	unsigned char account[10];	// 27 BCD up to 19 digits 
	unsigned char account_len; // 37
	unsigned char issue_no;		// 38
	long ProviderErrorNum;      // 39 
	char nu_1;					// 43 
	struct   trans_tail_  tail; // 44
};

struct trs_info_eft_declined_
{
	unsigned char opcode;					// 0	0x60
	unsigned char function; 				// 1	0xFE

	unsigned char reasonCode;				// 2
	unsigned char tenderNum;				// 3
	long declineAmount;						// 4
	unsigned char cardNum[10];				// 8 - BCD
	unsigned short segment;					// 18
	unsigned char exp_year[2];				// 20 FSD47073
	unsigned char exp_month[2];				// 22 FSD47073
	unsigned char issue_no;					// 24 FSD47073
	unsigned short ushEFTProviderErrorCode;	// 25 FSD#30638
	unsigned char nu[17];					// 27

	struct   trans_tail_  tail;				// 44
};

//TRANS_INFO_OLA_PRINTING
// Paramters for print eft slip ( card name + masking + lay out )
struct trs_ola_printing_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x28	<Opcode Value="0x28" />
	unsigned char sub_func;    //0x06	<Opcode Value="0x06" />	TRANS_INFO_OLA_PRINTING

	unsigned char sCardName[20]; // 3 Message from authorizer

	unsigned char sPanLayOut[5]; // 23
	char chMaskStart;			 // 28
	char chMaskEnd;				 // 29
	char chMaskChar;			 // 30  // default '*'
	unsigned short eft_tender_no;		//31
	unsigned char  uchPanEntryMode;		//33

	unsigned char bEmvPinHasRequierd			:1;  //FS1134
	unsigned char variable_pan_length			:1;  // Bug #22923
	unsigned char bEmvSigHasRequired			:1;  // Bug N#3034
	unsigned char bNeedSignatureVerify			:1;  // Bug #13307
	unsigned char bNU							:4;  //34

	unsigned char uchPANlength;	// 35 VPL (varable PAN len) Bug #22923

	unsigned char uchCardMaskingType;		//	36	FSD23593
	unsigned char uchNoUnmaskCharAtStart;	//	37	FSD23593
	unsigned char uchNoUnmaskCharAtEnd;		//	38	FSD23593

	char nu[5];				// 39
	struct   trans_tail_  tail; /*44*/
};

//	 TRANS_INFO_OLA_REFFERAL_SAVE	(unsigned char) 0x07
// Paramters for save transaction when need refferal 

struct trs_ola_refferal_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x28	<Opcode Value="0x28" />
	unsigned char sub_func;    //0x07	<Opcode Value="0x07" />	TRANS_INFO_OLA_REFFERAL_SAVE

	unsigned char bEftSaveRefferal	:1;
	unsigned char bEftVoid			:1;  // Do cancel after restore transaction
	unsigned char bEftGetAuth		:1;	 // After Get manual auth.
	unsigned char bManualSwipeRequired:1; // Required manual swipe of card
	unsigned char bTrsProcessed     :1; // #1935 Indication trs was already process (in case of several recalls)

	unsigned char bnu				:3;	// 3
	unsigned char stMerchantTelephone[15]; // 4 

	unsigned short eft_tender_no;		//19
	long	lAmount;					//21
	long	lCashBackAmount;			//25
	unsigned short	usSessionId;		//29
	unsigned short	usSavePosNum;		//31
	unsigned short	usSaveTicketNum;	//33
	unsigned char   uchCardSessionOrgTndr; //35
	unsigned char   sSponsorID[2];		//36

	long 	lSessionId;					//38
	char nu[2];							//42 
	struct   trans_tail_  tail; /*44*/
};

// TRANS_INFO_OLA_TRANS_REF	(unsigned char) 0x08
// TransRef Paramter for settlement.
struct trs_ola_transref_
{
	unsigned char opcode;		//0x60	<Opcode Value="0x60" />
	unsigned char function;		//0x28	<Opcode Value="0x28" />
	unsigned char sub_func;		//0x08	<Opcode Value="0x08" />	TRANS_INFO_OLA_TRANS_REF

	unsigned char sTransRef[40];		// 3
	unsigned char uchTransRefLength;	// 43

	struct   trans_tail_  tail;			// 44
};

//CR131
struct trs_cc_req_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60"/>
	unsigned char function;  //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;	 //0x11	<Opcode Value="0x11"/>

	unsigned char open_comm_failed :1;
	unsigned char tx_failed		    :1;
	unsigned char nu02             :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long msg_no;
   
	unsigned char card_data[10]; //BCD up to 19 digits
   unsigned char card_data_len;
   unsigned char trs_type;
   
	unsigned char reserved[24];

	struct   trans_tail_  tail;
};


//CR131
struct trs_cc_ans_strt_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60"/>
	unsigned char function;  //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;	 //0x12	<Opcode Value="0x12"/>

	unsigned char timeout          :1;
	unsigned char msg_rejected     :1;                   
	unsigned char er_avail_flag	 :1;	 //CR131 yulia
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1; // 3

	unsigned int  req_msg_no;      // 4
	unsigned int  ans_msg_no;      // 8

	unsigned short family_favourite_choice[10];  // 12
	unsigned char  cust_type;			 // 22

	long           acc_points; // 23
	long           redem_value;     // 27
	short int      operator_msg_no;  // 31        

	unsigned char cust_upd_date[3];	  //35 DR2612
	unsigned char reserved[2];        //38 

	struct   trans_tail_  tail;       // 40
};


//CR131
struct trs_cc_ans_cont_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60"/>
	unsigned char function;  //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;	 //0x13	<Opcode Value="0x13"/>

   unsigned char prom_msg[5];
   long          prom_points[5];
   
	long 			  redem_thresh;
	long			  redem_step;

	long          scnd_curr_bal; //DR2612
	unsigned char reserved[4];
   
	struct   trans_tail_  tail;
};


//CR131
struct trs_cc_eot_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60"/>
	unsigned char function;  //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;	 //0x14	<Opcode Value="0x14"/>

	unsigned char open_comm_failed :1;
	unsigned char tx_failed		    :1;
	unsigned char nu02             :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long msg_no;
   
	unsigned char reserved[36];
   
	struct   trans_tail_  tail;
};


// Hungary_EFT result
struct trs_hungary_ola_result_
{	
	unsigned char opcode;      //0x60	<Opcode Value="0x06"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func; 	//0x30	<Opcode Value="0x30"/> hungary Ola results

	unsigned char card_accepted    :1;
	unsigned char nu01             :1;
	unsigned char nu02             :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long msg_no;
	unsigned char nu1;
	unsigned char trans_type;
	unsigned char auth_type;
	unsigned char nu2;
   
            int  ans_rtc;  // 0    - Ok
									// 1-10 - Host answer
									// -1   - BAD
									// -6   - Timeout  
   
	unsigned char auth_code[10];
	unsigned char nu3;
	unsigned char account[10]; //BCD up to 19 digits
	unsigned char account_len;
   			long amount;
	unsigned char response_code[3];
	unsigned char nu4;

	struct   trans_tail_  tail;
};


// Hungary_EFT  request
struct trs_hungary_ola_req_
{
	unsigned char opcode;    //0x60	<Opcode Value="0x60"/>
	unsigned char function;  //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;	 //0x31	<Opcode Value="0x31"/>

	unsigned char nu00             :1;
	unsigned char tx_failed		    :1;
	unsigned char nu02             :1;
	unsigned char nu03             :1;
	unsigned char nu04             :1;
	unsigned char nu05             :1;
	unsigned char nu06             :1;
	unsigned char nu07             :1;

	unsigned long msg_no;
   
	unsigned char card_data[24]; //nul terminated
	unsigned char trans_type;
	unsigned char auth_type;
   
	long			  req_amount; // amount + cashback
   
	unsigned char reserved[6];
   
	struct   trans_tail_  tail;
};

struct trs_ola_e_pay_result_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x32	<Opcode Value="0x32"/>

	unsigned short SessionId;   //3
	unsigned char ola_date[4];  //5
	unsigned char ola_time[2];  //9

	unsigned char PinSerialNumber[15];     //11 // Pin Serial Number
	unsigned char AuthorisationCode[9];    //26 // Authorisation code from OLA response 

	short ResponseCode;                    //35 // Response code
	unsigned char  ReversalAuthorisation;  //37

	unsigned long SeqNo;                    //38
	unsigned char bSecondExtensionTransExists :1; //42		//FSD 28793
	unsigned char bVoidAfterAuth			  :1;
	unsigned char filler			    :6; //42
	unsigned char not_used[1];              //43


	struct   trans_tail_  tail;            //44 
};

struct trs_ola_e_pay_result_ext_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x33	<Opcode Value="0x33"/>

	unsigned short SessionId;   //3
	unsigned char  ApplOption;  //5 // 1-Card or 2-Voucher

    union                       //6
	{
		struct                  // Card information
		{
			unsigned char MobileNumber[15];
			unsigned char nu[12];
		}inf1;                  
		struct                  // Voucher information  
		{
			unsigned char PinNumber[24];
			unsigned char PINExpDate[3];
		}inf2;                   
	};

	unsigned char PinNumber_ext[8];		//33, N#6546 if pin number len is bigger then 24 get the right size
	unsigned char pak_IdentifyNum[3];   //41

	struct   trans_tail_  tail;         //44 
};


//FSD 28793
struct trs_ola_e_pay_result_ext2_ 
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x47	<Opcode Value="0x47"/>
	
	unsigned char sPinSerialNumber[28];   //3
	unsigned char sAuthNumber[13];			  //31 - FSD32829

	struct   trans_tail_  tail;			  //44 
};


//FSD153313
struct trs_ola_gift_card_result_ext_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>	
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x34	<Opcode Value="0x4D"/>

	char sMaskedCardNumber[30]; //3

	char NotUsed[11];			//33

	struct   trans_tail_  tail;         //44 
};
struct trs_ola_gift_card_result_       //FS3012
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>	
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x34	<Opcode Value="0x34"/>
 
	unsigned short ushSessionId;      //3
	unsigned char bcdExpiryDate[2];   //5  //MMYY
	
	unsigned char sAcountNumber[10];	//7 BCD up to 19 digits
	unsigned char sMerchantID[5];		//17 YohayB - used to be size [15]
	long lOldAmountBalance;				//22 
	long lNewAmountBalance;				//36 
	
	short shResponseCode;             //30 
	struct flag_				      //32	
	{
		unsigned char  bReversalAuthorisation  :1; //32
		unsigned char  bPanMasking		       :1; //32
		unsigned char  bWasCanceled            :1; //FSD2270 - For PPt Gift Cards Printing		
		unsigned char  bExecutedAtNoSaleMode   :1; //FSD2270 - For PPt Gift Cards Printing		  
		unsigned char  bExecutedFromBalanceTransfer   :1; //FSD2270 - For PPt Gift Cards Printing		  
		unsigned char  bExecutedFromRefundOrRedemption   :1; //FSD2270 - For PPt Gift Cards Printing		  
		unsigned char  nu_bits                 :2;   
	}Flags;

	unsigned long ulSeqNo;              //33
	
	unsigned char chMaskChar;		//37
	unsigned char chMaskEnd;		//38
	unsigned char chMaskStart;		//39
	unsigned char sPanLayOut[3];	//40
	unsigned char uchActionType;	//43 FSD22770

	struct   trans_tail_  tail;         //44 
};

struct trs_ola_bill_payment_result_       //FS4002
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x35	<Opcode Value="0x35"/>
 
	unsigned short ushSessionId;			//3
	unsigned char bcdTransactionDate[2];   //5  //MMYY
	unsigned char bcdTransactionTime[2];   //7  //MMYY

	unsigned char sMerchantID[15];    //9 

	short shResponseCode;             //24 
	struct BillFlag_				      //26	
	{
		unsigned char  bReversalAuthorisation  :1;
		unsigned char  nu_bits                 :7;   
	}Flags;

	unsigned long ulSeqNo;              //27
	unsigned char bcdBillNumber[10];    //31
	unsigned char uchBillType;			//41
	unsigned char uchBillNumberLength;  //42

	char	nu;							//43

	struct   trans_tail_  tail;         //44 
};

struct trs_ola_auth_guid_				//CR#6387
{
	unsigned char opcode;				//0x60	<Opcode Value="0x60"/>
	unsigned char function;				//0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;				//0x36	<Opcode Value="0x36"/>
	
	unsigned char request_session	:1;	// 03
	unsigned char auth_session		:1;	
	unsigned char reversal_session	:1;	
	unsigned char nu0				:1;	
	unsigned char nu1				:1;	
	unsigned char nu2				:1;	
	unsigned char nu3				:1;	
	unsigned char nu4				:1;	
	
	unsigned char nu[8];				// 04
	unsigned char uchguid[32];			// 12 

	struct   trans_tail_  tail;			// 44
};

//FSD29721
struct trs_ola_gift_card_addInf_ 
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>	
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x37	<Opcode Value="0x37"/>
 
	unsigned short ushSessionId;      //3
	unsigned char sAcountNumber[10];	//5 BCD up to 19 digits

	struct flagAddInf_				      //15	
	{
		unsigned char  bReversalAuthorisation  :1; //15
		unsigned char  bWasCanceled            :1;
		unsigned char  bBalanceAmountAvail     :1;   //TD276983
		unsigned char  bNewBalanceAmountAvail  :1;   //TD276983
		unsigned char  nu_bits                 :4;   
	}Flags;

	unsigned long ulSeqNo;              //16 
	long lBalanceAmount;				//20
	long lNewAmountBalance;				//24 //FSD29721_150807D

	unsigned char nuAddInf[16];			//28
	
	struct   trans_tail_  tail;         //44 
};

/*----------------------------------------------------------------------
Opcode:		0x60
Subopcode:	0x28
Subfunction:0x38
EFT transaction ID. This transaction logs the tranaction ID received from
the EFT provider at the beginning of the EFT transaction. Started with
Syncro implementation.
-----------------------------------------------------------------------*/
struct trs_ola_trans_id_			//OFS	Description
{
	unsigned char opcode;			//0		0x60 <Opcode Value="0x60"/>	
	unsigned char function;			//1		0x28 <Opcode Value="0x28"/>	
	unsigned char sub_func;			//2		0x38 <Opcode Value="0x38"/>	

	unsigned char uchSyncroEvent;	//3		Syncro EFT event type (see WPEftWyncro.dll)
	unsigned long ulTransID;		//4		Transaction ID
	unsigned char tender_id;		//8
	long		  amount;			//9
	long		  cashout;			//13

	unsigned char uchFiller[27];	//17		not used

	struct   trans_tail_  tail;		//44	Transaction tail
};									//64

/*----------------------------------------------------------------------
Opcode:		0x60
Subopcode:	0x28
Subfunction:0x39
-----------------------------------------------------------------------*/
struct trs_ola_activation_code_ext_			//FSD61084
{
	unsigned char opcode;			//0		0x60 <Opcode Value="0x60"/>	
	unsigned char function;			//1		0x28 <Opcode Value="0x28"/>	
	unsigned char sub_func;			//2		0x39 <Opcode Value="0x39"/>	

	unsigned char ActivationCode[10]; //3	
	unsigned char bTemplatePrintingSucceeded	: 1; //13
	unsigned char bNU							:7;

	unsigned long ulSeqNo;			//14
	unsigned char uchFiller[26];	//18		not used

	struct   trans_tail_  tail;		//44	Transaction tail
};			

struct trs_ola_serialnumber_ext_	//N#6755
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x42	<Opcode Value="0x42"/>

	unsigned char PinSerialNumber_ext[15]; //3
	unsigned char uchOnlinePurchaseProvider; //18 FSD17863  Provider ID ( Using trs as ext to trs_info_online_purchase_item_ which was suppose to be its real purpose).
	unsigned char not_used[25];   //19

	struct   trans_tail_  tail;         //44 
};

struct trs_ola_pinnumber_ext_2_			//N#6546, CR#3037
{
	unsigned char opcode;      //0x60
	unsigned char function;    //0x28
	unsigned char sub_func;    //0x43

	unsigned char Ext2_PinNumber[28];   // 3
	unsigned char notused[13];				//31
	
	struct   trans_tail_  tail;         //44 
};

struct trs_ola_IdentifyNumber_ext_			//N#6546, CR#3037
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x45	<Opcode Value="0x45"/>

	unsigned char IdentifyNumber[7];   // 3
	unsigned char bcdTransSeqNumber[30];	//10 BCD FSD14337
	unsigned char uchTransSeqNumberLength;	//40 FSD14337

	unsigned char bConfirmationRequestRequired		:1;	//41 FSD32111
	unsigned char bSlipTextReceivedUponConfirmation	:1; //42 FSD32111
	unsigned char nu								:6;	//41 FSD32111
	
	unsigned char notused[2];						//42
	
	struct   trans_tail_  tail;         //44 
};

struct trs_ola_UniqID_ext_			//FSD26804
{
	unsigned char opcode;					//0x60	<Opcode Value="0x60"/>
	unsigned char function;					//0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;					//0x48	<Opcode Value="0x48"/>
											
	unsigned char UniqID[32];				//3	
	unsigned char uchUniqIDLength;			//35
	unsigned char notused_uniq[8];			//36
											
	struct   trans_tail_  tail;				//44 
};

struct trs_ola_loyalty_update_result_			//FSD11780
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x46	<Opcode Value="0x46"/>

    unsigned char	sAccountNumber[10];			//3		
	long			lProviderResponseCode;		//13				 
	unsigned char	notused[27];				//17
	
	struct   trans_tail_  tail;			        //44 
};

/*----------------------------------------------------------------------
Opcode: 0x60 function:0x28 sub_func: 0x44
FS5721: Added information to ola result extension 2.
-----------------------------------------------------------------------*/
//!EranL!
struct trs_ola_result_ext2_             //OFS		Description
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x44	<Opcode Value="0x44"/>

	long lDeviceNumber;			//3
	long lAmount;				//7		amount added/deducted
	long lRemainingValue;		//11

	long lRewardRedeemed;		//15
	long lActualRewardRedeemValue;			//19	
	long lRewardBalance;		//23
	long lExtraRewardEarned;	//27
	short shStandardRewardEarned;	//31

	char bcdAccountNumber[10];	//33 BCD

   unsigned char filler[1];     //43 Not used      

   struct   trans_tail_  tail;               //44     TRS tail
};

/*----------------------------------------------------------------------
Opcode: 0x60 function:0x28 sub_func: 0x4C
EFTPOS card data: masked card number as received from OLA plus few other bits of info
-----------------------------------------------------------------------*/
struct trs_ola_card_data_             //OFS		Description
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x28	<Opcode Value="0x28"/>
	unsigned char sub_func;    //0x4C	<Opcode Value="0x4C"/>

   unsigned char szCardPAN[17]; //3   Maked card# as received from EFTPOS
   unsigned char szCardType[16];//20  Card type as read from card range table
   unsigned char szOLAResponseCodeForDenial[4];		//36  //FSD296959
   short shTenderNumberReturned;						//40

   unsigned char uchAccountType;//42  1:cheque 2:credit 3:savings 

   unsigned char bEOVOffline :1;	//43 the EFTPOS transaction was done offline and required signature #3919
   unsigned char bSignPIN    :1;    //43 0: customer keyed PIN 1: customer signed
   unsigned char bNotUsed    :6;	//43


   struct   trans_tail_  tail; //44     TRS tail
};

struct trs_ola_abort_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x28	<Opcode Value="0x28" />
	unsigned char sub_func; 	//0x99	<Opcode Value="0x99" />aborted by user

	unsigned long msg_no;    // 03

	struct CardTypeFlag_ CardTypeFlag; /*07*/	

	unsigned char account[10]; //BCD up to 19 digits /*08*/
	unsigned char account_len; // 18
	
	unsigned char reserved[24];  // 19

	unsigned char pump;          // 43
   
	struct   trans_tail_  tail;  // 44
};


struct trs_auth_price_diff_
{
    unsigned char opcode;	  	//0x60	<Opcode Value="0x60" />
    unsigned char function;	//0x29		<Opcode Value="0x29" />

    unsigned char code[7];

    unsigned char nu00	   :1;
    unsigned char nu01	   :1;
    unsigned char nu02	   :1;
    unsigned char nu03	   :1;
    unsigned char nu04	   :1;
    unsigned char nu05	   :1;
    unsigned char nu06	   :1;
    unsigned char nu07	   :1;

    long	    authorized_price;
    long	    sold_price;
    
    long		 qty;
    long	    diff_amount;

    unsigned char reserved[18];
    struct   trans_tail_  tail;
};


struct trs_host_batch_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x2A	<Opcode Value="0x2A" />
   
	unsigned char option;      //0-Start 1-End
   									//2-Start rejected

   unsigned char host_batch_number[6];
   unsigned long host_records;
   unsigned long accepted_records;
    
	unsigned char post_batches;
	unsigned char post_batch1[6];
	unsigned char post_batch2[6];
	unsigned char post_batch3[6];
	unsigned char reserved[8];

	struct   trans_tail_  tail;
};


struct trs_check_fee_
{
    unsigned char opcode;	  	//0x60	<Opcode Value="0x60" />
    unsigned char function;	//0x2B		<Opcode Value="0x2B" />

    unsigned char fee_code[7];
    
    unsigned char uchServiceFeeType	:2;	//#23033
    unsigned char nu02	   :1;
    unsigned char nu03	   :1;
    unsigned char nu04	   :1;
    unsigned char nu05	   :1;
    unsigned char nu06	   :1;
    unsigned char nu07	   :1;
    
    long	         fee_price;
    long	         cashback;
    unsigned char table_no;
    unsigned short dep_no;
    unsigned short tender_no;
    unsigned char fee_type;

    unsigned char reserved[20];
    struct   trans_tail_  tail;
};

struct trs_commission_
{
	unsigned char opcode;	  	//0x60 <Opcode Value="0x60" />
	unsigned char function;	   //0x3C <Opcode Value="0x3C" />
   
	long commision_amount;      
	long tender_amount;    
	long percent;
	unsigned char tnder_name[16];
   
   unsigned char cancel   :1;
   unsigned char subtract :1;
   unsigned char nu02     :1;
   unsigned char nu03     :1;
   unsigned char nu04     :1;
   unsigned char nu05     :1;
   unsigned char nu06     :1;
   unsigned char nu07     :1;

   unsigned long sPluOrDepTrsSequence;//FSD307721
   
	unsigned char reserved[9];
	struct   trans_tail_  tail;
};


struct trs_fly_buy_
{
	unsigned char opcode;           //0x60	<Opcode Value="0x60" />
	unsigned char function;         //0x3D	<Opcode Value="0x3D" />

	unsigned char final     :1;
	unsigned char voided    :1;
	unsigned char nu02      :1;
	unsigned char nu03      :1;
	unsigned char nu04      :1;
	unsigned char bClubCardIndicator      :1; //FSD#444616
	unsigned char MCR_used  :1;
	unsigned char scanned   :1;

	unsigned char card_no[20];
	long		  amount;

	char clubcard[16];
	unsigned char reserved[1];
   
	struct   trans_tail_  tail;
};


struct trs_new_ecca_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x2C <Opcode Value="0x2C" />

    unsigned char templates;   // 2
    unsigned char account[20]; // 3   //ascci null terminated

    unsigned char second_ecca : 1; 
    unsigned char nu          : 7; // 23
    unsigned char reserved[20];	   // 24 

    struct   trans_tail_  tail;    // 44
};


struct trs_eft_media_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x2E <Opcode Value="0x2E" />

    unsigned short  cashier;
    unsigned short  media_no;
    unsigned long   amount;
	unsigned char	uchPaymentOption;
    unsigned char	referanceNumber[12]; //FSD266668
   unsigned char	referanceId[6]; //NTUC PILOT
    unsigned char	reserved[15];

    struct   trans_tail_  tail;
};


struct trs_eft_print_reject_
{
    unsigned char opcode;         //0x60 <Opcode Value="0x60" />
    unsigned char function;       //0x2F <Opcode Value="0x2F" />

    unsigned char tender_no[2];
    unsigned short  error_code;
    unsigned char account_no[20];
    long balance1;
    long balance2;

	unsigned short SessionID;		//FSD3598 - add sessionID for retrieval of extra information 

	unsigned char eft_print_data_indication		:1;           
	unsigned char nu							:7;

	unsigned char multi_part_option;

    unsigned char reserved[6];

    struct   trans_tail_  tail;
};


struct trs_trans_index_
{
	unsigned char opcode;           //0x60	<Opcode Value="0x60" />
	unsigned char function;         //0x30	<Opcode Value="0x30" />

	unsigned char opt_ticket_total  :1;
	unsigned char opt_void_ticket   :1;
	unsigned char opt_save_ticket   :1;
	unsigned char opt_nu13          :1;
	unsigned char opt_nu14          :1;
	unsigned char opt_nu15          :1;
	unsigned char opt_nu16          :1;
	unsigned char opt_info          :1;
   
   unsigned char opt_nu20          :1;
   unsigned char opt_nu21          :1;
   unsigned char opt_nu22          :1;
   unsigned char opt_nu23          :1;
   unsigned char opt_nu24          :1;
   unsigned char opt_nu25          :1;
   unsigned char opt_nu26          :1;
   unsigned char opt_nu27          :1;
   
   unsigned char index_clubcard    :1;
   unsigned char index_01          :1;
   unsigned char index_02          :1;
   unsigned char index_03          :1;
   unsigned char index_04          :1;
   unsigned char index_05          :1;
   unsigned char index_06          :1;
   unsigned char index_07          :1;
   
	unsigned char index_len;
	unsigned char index[30];	
    
	unsigned char reserved[8];

	struct   trans_tail_  tail;
};




struct trs_chksum_
{
    unsigned char opcode;      //0x60 <Opcode Value="0x60" />
    unsigned char function;    //0x06 <Opcode Value="0x06" />

    unsigned char no_chksum_perform    :1;
    unsigned char ignored_plu_mnt      :1;
    unsigned char ignored_brom_mnt     :1;
    unsigned char plu_chksum_fail      :1;
    unsigned char brom_chksum_fail     :1;
    unsigned char opt_nu15             :1;
    unsigned char opt_nu16             :1;
    unsigned char opt_nu17             :1;

    unsigned long pos_plu_count;
    unsigned long pos_plu_chksum;
    unsigned long pos_brom_count;
    unsigned long pos_brom_chksum;

    unsigned long pc_plu_count;
    unsigned long pc_plu_chksum;
    unsigned long pc_brom_count;
    unsigned long pc_brom_chksum;

    unsigned char reseved[9];

    struct   trans_tail_  tail;
};


struct trs_bkgd_load_
{
    unsigned char opcode;      //0x60 <Opcode Value="0x60" />
    unsigned char function;    //0x07 <Opcode Value="0x07" />

    unsigned char start_plu_file_load  :1;
    unsigned char stop_plu_file_load   :1;
    unsigned char start_brom_file_load :1;
    unsigned char stop_brom_file_load  :1;
    unsigned char opt_nu14             :1;
    unsigned char opt_nu15             :1;
    unsigned char opt_nu16             :1;
    unsigned char opt_nu17             :1;

    unsigned short  new_items;
    unsigned short  upd_items;
    unsigned short  del_items;
    unsigned short  errors;

    unsigned char reseved[33];

    struct   trans_tail_  tail;
};


struct trs_retrans_
{
    unsigned char opcode;	  	//0x60	<Opcode Value="0x60" />
    unsigned char function;	//0x54		<Opcode Value="0x54" />
    
    unsigned char fail     :1;
    unsigned char ignore   :1;
    unsigned char nu02     :1;
    unsigned char nu03     :1;
    unsigned char nu04     :1;
    unsigned char nu05     :1;
    unsigned char nu06     :1;
    unsigned char nu07     :1;

	 unsigned short  retrans_req;
    
    unsigned short  trans_fifo_size;
    unsigned short  trans_first;
    unsigned long trans_pointer;
    unsigned short  trans_count;
    unsigned short  future_trans_count;
    unsigned short  trans_seq_no;
    
    // Ignore loging
	 unsigned short  seq_range_start;
	 unsigned short  seq_range_end;

	 // Fail logging
	 unsigned short  read_ptr;
	 unsigned short  alt_read_ptr;
    
    unsigned char reserved[17];
    struct   trans_tail_  tail;
};


struct trs_fuel_pay_at_pump_info_
{
   unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x6D	<Opcode Value="0x6D" />
	unsigned char sub_func;    //0x01	<Opcode Value="0x01" />

   unsigned char trs_date[3];   //BCD YMD
   unsigned char trs_time[3];   //BCD HMS
	
	unsigned long InvoiceNumber;
	unsigned char ReferenceNumber[12];
	unsigned char sCardName[19];

	struct   trans_tail_  tail;
};






struct trs_log_func_
{
    unsigned char opcode;//0         //0x20 <Opcode Value="0x20" />

    unsigned char function;//1    // 01 - power up
                                  // 02 - store open
                                  // 03 - store close (EOD)
                                  // 04 - automatic recover ticket
                                  // 11 - sign on
                                  // 12 - sign off
                                  // 13 - enter secure mode
                                  // 14 - exit secure mode
                                  // 15 - enter wait mode
                                  // 16 - exit wait mode
                                  // 17 - enter training mode
                                  // 18 - exit training mode
                                  // 19 - password change
                                  // 20 - Zero cashier totals
                                  // 21 - Move totals to prev, Zero current
                                  // 22 -	X_READ                 
                                  // 23 -	POS_REPORT             
                                  // 24 -	MOVE_POS_TTL_2_PRV_ZERO
                                  // 25 -	RESERVED FOR PC USAGE  
                                  // 26 -	START_SPECIAL_PRINTOUT
                                  // 27 -	END_SPECIAL_PRINTOUT  
                                  // 28 -	Store Board message
                                  // 29 -	START Reorg print
                                  // 30 -	END Reorg print
                                  // 31 - X ITEMIZED check report
                                  // 32 - Z ITEMIZED check report
                                  // 33 - Depart report          
                                  // 34 - Tax report             
                                  // 35 - Declaration
                                  // 36 - Print dupl gift			
                                  // 37 - Cust ord error report	
                                  // 38 - Electronic sign on
                                  // 39 - Manual Enter Secure Mode (FSD4906)
								  // 40 - LayBy old ticket start section, LOG_FUNC_LAYBY_OLD_TICKET_START, FSD6248 LayBy
								  // 41 - Layby old ticket end section, LOG_FUNC_LAYBY_OLD_TICKET_END, FSD6248 LayBy
								  // 44 - Long password password change, uses struct trs_log_func_long_password_
								  // 45 - EMERGENCY_DRAWER_OPENING, //FSD26800
								  // 46 - sign on with long user
								  // 47 - Ask Promotion what was triggered, LOG_FUNC_ASK_PROM_WHAT_TRIGGERED, #40427
								  // 48 - Perform POS Locking At Pos EOD (Manual EOD) //FSD53694
									// 99 - PC start of day



    unsigned short  cashier_no;	//2
    unsigned short  secret_no;	//4

    struct	//6
    {
       unsigned char offline_exe        :1;
       unsigned char remote_cmd         :1;
	   unsigned char opt_reprocess      :1; // B/O use
       unsigned char force_cmd          :1; // Enh #1962SL
	   unsigned char forceSuperVisor    :1; // FSD7786 
       unsigned char bTemporarySignOff	:1;	// FSD39662 - turn on for temporarySignOff when using 2 drawers on same pos
       unsigned char bPermanentlyForcedSignOffBySupervisor :1;// FSD39662 - turn on for PermanentlySignOff from drawersAssignment()
       unsigned char end_of_period      :1;
    }opt;


    unsigned char pos_staus;//7   // COLD_STAND_BY  0x00
                                  // STAND_BY       0x01
                                  // IDLE           0x02
                                  // NO_SALE        0x04
                                  // SALE           0x08
                                  // TENDER         0x10
                                  // IDLE_STAND_BY1 0x20
                                  // IDLE_STAND_BY2 0x40

    unsigned short ticket_no;//8

    unsigned short old_password;//10
    unsigned short new_password;//12

    unsigned char  pos_no;		//14
    
	unsigned short used_drawer1;//15
	unsigned short used_drawer2;//17
    unsigned char  text[21];	//19
    
    unsigned char cashier_msg_no; 

    unsigned char reset_msg		:1; 
    unsigned char set_msg		:1;
    unsigned char immediate_msg :1; //#1585
    unsigned char alfa_numeric_password	:1;
    unsigned char bPerformPosLockingAtPosEod:1;//FSD53694 - after FSD Updates.
    unsigned char nu5			:1;
    unsigned char nu6			:1;
    unsigned char nu7			:1;

    unsigned short  code;
    
    struct   trans_tail_  tail;
};

//FSD 13459. trs_log_func updated to allow long cashier password
struct trs_log_func_long_password_
{
    unsigned char opcode;         //0x20	<Opcode Value="0x20"/>

    unsigned char function;       // 44 - long password password change



    unsigned short  cashier_no;
    unsigned short  secret_no;

    struct
    {
       unsigned char offline_exe        :1;
       unsigned char remote_cmd         :1;
	   unsigned char opt_reprocess      :1; // B/O use
       unsigned char force_cmd          :1; // Enh #1962SL
	   unsigned char forceSuperVisor    :1; // FSD7786 
       unsigned char bTemporarySignOff	:1;	// FSD39662 - turn on for temporarySignOff when using 2 drawers on same pos
       unsigned char bPermanentlyForcedSignOffBySupervisor :1;// FSD39662 - turn on for PermanentlySignOff from drawersAssignment()
       unsigned char end_of_period      :1;
    }opt;


    unsigned char pos_staus;      // COLD_STAND_BY  0x00
                                  // STAND_BY       0x01
                                  // IDLE           0x02
                                  // NO_SALE        0x04
                                  // SALE           0x08
                                  // TENDER         0x10
                                  // IDLE_STAND_BY1 0x20
                                  // IDLE_STAND_BY2 0x40

    unsigned short ticket_no;

    unsigned short old_password;
    unsigned short new_password;

    unsigned char  pos_no;
    
	unsigned short used_drawer1;
	unsigned short used_drawer2;

	unsigned char szOldLongPassword[10]; //FSD 13459
	unsigned char szNewLongPassword[10]; //FSD 13459

	unsigned char nu; 
    
    unsigned char cashier_msg_no; 

    unsigned char reset_msg					:1; 
    unsigned char set_msg						:1;
    unsigned char immediate_msg				:1; //#1585
    unsigned char alfa_numeric_password	:1;
    unsigned char nu4			:1;
    unsigned char nu5			:1;
    unsigned char nu6			:1;
    unsigned char nu7			:1;

    unsigned short  code;
    
    struct   trans_tail_  tail;
};


struct trs_float_
{
	unsigned char opcode;         //0x07 <Opcode Value="0x07" />

	unsigned char function;       // 01 - opening float
								  // 02 - add on float
								  // 03 - POST add on float

	long          amount;  // 2
	short           count; // 6
	unsigned char tender;  // 8

	long          total;   // 9

	 // PC generated options
	unsigned char previous_period   :1;
	unsigned char no_empl_update    :1;
	unsigned char opt_reprocess     :1; // B/O use
	unsigned char opt_remote        :1; // B/O use
	unsigned char opt_amount_int64  :1; // B/O use
	unsigned char bLoanType         :1;	//FSD56621	0=normal loan , 1=ATM loan
	unsigned char bPOSAccontability :1;
	unsigned char bReportPrintingRequired :1; // 13 //FSD365329 - changed in FSD450223 - added indication for 'Report Printing'

	unsigned char pc_no;              // 14
	unsigned char pos_no;			  // 15
	unsigned long supervisor_no;     // 16 SAL54

	long          safe_no;       // 20 ; B/O use
	__int64       amount2;       // 24 ; B/O use

	long		  carry_over_amount; //32 carry_over (amount kept)
	short         carry_over_count;  //36 carry_over (amount kept)

	unsigned char loan_type;         //38 0=default, 1=transfer funds (Epic316907)
	unsigned char other_pos_no;      //39 pos_no from transfer pair transaction

	unsigned char nu[4];             // 41
	struct   trans_tail_  tail;      // 44
};


struct trs_cash_lift_
{
    unsigned char opcode;         //0x09 <Opcode Value="C" />

    unsigned char function;       // 01 - Regular
    										 // 02 - POST pickup

    long          amount;			//2
    short         count;			//6
    unsigned char tender;			//8

    long          reserved;			//9

	 // PC generated options
    unsigned char previous_period :1;	//13
    unsigned char no_empl_update  :1;
    unsigned char opt_reprocess   :1; // B/O use
    unsigned char opt_remote      :1;
    unsigned char opt_int64       :1; //FSD2733
    unsigned char opt_nu05        :1; //used by the FO
    unsigned char opt_void        :1; //#51300
    unsigned char bPickupType     :1;	//FSD56621	0=normal pickup , 1=ATM pickup
    
    unsigned char pos_no;				//14
    unsigned char pc_no;				//15
	unsigned long supervisor_no;		//16 SAL54
	unsigned short cashier_no;			//20
									
	//FSD2733
    long			safe_no;			// 22  FO use
   __int64			amount2;			// 26  

    //#55356 Send Foreign currency amount and exchange rate. vincentb
	long          foreign_amount;			//34	Foreign currency amount
    long          foreign_rate;				//38	Foreign currency rate

	unsigned char pickup_type;              //42 FO use: 0=default, 1=borrowed funds (Epic316907)	

	unsigned char bReportPrintingRequired :1;//43 FSD450223 - added indication for 'Report Printing' 
    unsigned char bNU_BITS                :7;//43
	                                        
    struct   trans_tail_  tail;
};


/*----------------------------------------------------------------------
Opcode: 0x0b
Cashier/safe declaration
-----------------------------------------------------------------------*/
struct trs_declare_                 //OFS	Description
{
    unsigned char opcode;           //0   0x0B  <Opcode Value="0x0B" />

    unsigned char function;         //1   Function  <Opcode Value="1,2,10" />
                                    //    01 - Cashier 
                                    //    02 - POS
                                    //    10 - Safe

    long          amount;           //2   Total amount declared in period (DOS systems)
    short         count;            //6   Total quantity declared for this tender (DOS systems)
    unsigned char tender;           //8   Tender number
#ifdef PRJ_ROW
    long          total;            //9
#else
	unsigned short manager_no;      //9   Manager number
	unsigned char  not_used[2];     //11  Not used
#endif
	                                 //13  PC generated options
    unsigned char previous_period:1;//13  Declaration for previous period
    unsigned char no_empl_update :1;//13  Do not update EMPL record
    unsigned char opt_reprocess  :1;//13  Process only if in reprocess mode
    unsigned char opt_additive   :1;//13  additive declaration: add "this time" to existing values
    unsigned char opt_remote     :1;//13  remote declaration                                       
    unsigned char opt_amount_int64:1;//13 Amount is stored in int64 field
    unsigned char opt_first       :1;//13 FS18338
    unsigned char opt_info        :1;//13 informative only. ignore this record.
    
    long          amount_this_time; //14  Amount declared this time 
    short         count_this_time;  //18  Quantity declared this time
    unsigned char  pos_no;          //20  POS number (POS accountability)
    unsigned short cashier_no;      //21  Cashier number
    unsigned short safe_no;         //23  Safe number
   __int64       amount2;           //25  Total amount declared in period 
   __int64       amount_this_time2; //33  Amount declared in this session        
   
    unsigned char work_date[3];     //41  working date for which declaration to be applied
    struct   trans_tail_  tail;
};


// DannyF 06/01/03 add bit opt_during_ticket to 0x60 , 0x18
// DannyF 22/01/03 add opt_vat_receipt to 0x60 , 0x18 reprint
// DavidHu 04/01/10 FSD70677: add opt_duplicate_receipt to 0x60,0x18 by Duplicate Receipt for FrontOffice
struct trs_reprint_
{
    unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
    unsigned char function;    //0x18	<Opcode Value="0x18"/>

    unsigned char opt_during_ticket	:1;
    unsigned char opt_vat_receipt	:1;
    unsigned char opt_buffer_print	:1; //FSD14741
    unsigned char opt_duplicate_receipt	:1; //FSD70677
    unsigned char opt_nu14			:1;
    unsigned char opt_nu15			:1;
    unsigned char opt_nu16			:1;
    unsigned char opt_nu17			:1;		//2

    unsigned char pos;						//3
    unsigned short  receipt_no;				//4

	unsigned short ushDocType;				//6

    unsigned char reseved[36];				//8

    struct   trans_tail_  tail;				//44
};

struct trs_info_inv_req_
{
	unsigned char opcode;				//0		0x60	<Opcode Value="0x60"/>
	unsigned char function;				//1		0xD0	<Opcode Value="0xD0"/>

	//2 BIT
	unsigned char opt_immediate       :1; // immediate=1 Delayed=0
	unsigned char opt_cancel          :1; // If set - F\O should ignore this request
	unsigned char opt_current_ticket  :1; // Will be set if the invoice is from the current ticket.
	unsigned char bTenderDependency   :1; //FSD123007
	unsigned char bInvoicePrinting	  :1; //TD#435542ErrorMsg
	unsigned char bCreditAllowedInv	  :1; //FSD#442000
	unsigned char nu                  :2; // 

	unsigned char inv_type;          //3  NUM  1-Belgium VAT
	//        2-Phone number
	//        3-Foreign VAT  
	//		  4 - Loyalty number FSD#357330

	unsigned char invnum[10]; 		   //4  BCD	 Belgium VAT/Phone number/Foreign VAT 

	unsigned short ticket_no;        //14 NUM	  
	unsigned char  pos_no;	         //16 NUM

	unsigned char bdcOrgTicketDate[3];	//17	FSD#90612 Date (YYMMDD in BCD)


	unsigned char bcdTransactionNumber[11];		//20	FSD#365331
	unsigned char uchInvNumLen;					//31	FSD427277
	unsigned char bdcOrgTicketTime[2];			//32	FSD427277
	unsigned char filler[10];					//34	Future use


	struct   trans_tail_  tail;		//44	tail
};

//OEM 
struct trs_info_oem_sec_opt_in_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xD1	<Opcode Value="0xD1"/>

	unsigned char member_card_no[15];
	unsigned char alternate_id[10];
	unsigned char prev_alternate_id[10];
	short rc;
	unsigned char reserv[5];

    struct   trans_tail_  tail;
};


struct trs_info_oem_club_data_
{
	unsigned char opcode;				//0x60	<Opcode Value="0x60"/>
	unsigned char function;				//0xD3	<Opcode Value="0xD3"/>

	unsigned char card_no[20];			// card no in ascii null terminated
	long          lPromotionNumber;		
	unsigned char ucClubNumber;			
	long          lPoints;				// Points earned
	unsigned char ucOptInFlag;			// 0 - no change, 1 - opt-in, 2 - opt-out		
	long		  lRedeemed; 
	short		  lAward;
	unsigned char date[3];				//Enh #11720 - yymmdd
	unsigned char time[3];				//Enh #11720 - hhmmss
   
	struct   trans_tail_  tail;
};


// B/O transaction
struct trs_non_scanned_dept_
{
  unsigned char  		opcode; // 0x10	<Opcode Value="0x10"/>
  unsigned short   		dept;
  unsigned char  		option;
  unsigned char  		option1;
  unsigned char  		till_no;
  unsigned char  		product_code;
  long           		amount;

  unsigned char  		reserved[33];

  struct trans_tail_ tail;
};


struct trs_alert_
{
    unsigned char opcode;         //0x63	<Opcode Value="0x63" />
    
    unsigned short  subopcode;	  // 1		<Opcode Value="0x01" />
    unsigned char function;		  // 3	

    unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char opt_nu15         :1;
    unsigned char opt_nu16         :1;
    unsigned char opt_nu17         :1;  // 4

    unsigned char data[37];				// 5
    unsigned char org_pos_no;			// 42
    unsigned char org_pc_no;			// 43

    struct   trans_tail_  tail;			// 44
};

struct trs_alert_pos_unbalanced_general_
{
    unsigned char  opcode;        // 0
    unsigned short subopcode;	  // 1
    unsigned char  type;          // 3
	long lSalesAmount;			  // 4
	long lPromontionsAmount;      // 8
	long lTendersAmount;          // 12
	long lTaxAmount;	          // 16

	unsigned char filler[24];	  // 20

    struct   trans_tail_  tail;	  // 44
};

struct trs_alert_pos_unbalanced_apportionment_
{
    unsigned char opcode;         // 0
    unsigned short  subopcode;	  // 1
    unsigned char  type;          // 3
	long lPromontionsAmount;      // 4
	long lApportionmentAmount;    // 8

	unsigned char filler[32];	  // 12

    struct   trans_tail_  tail;	  // 44
};

//FSD27939.. KireetG
struct trs_alert_file_distribution_
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    
    unsigned short  subopcode;				// 1	// (230 / 231)
    unsigned char	function;				// 3	
	
	unsigned char	uchFileID;				// 4
	unsigned char	uchFileOperationType;	// 5

    unsigned char	data[36];				// 6
    unsigned char	org_pos_no;			// 42
    unsigned char	org_pc_no;			// 43

    struct   trans_tail_  tail;			// 44
};


//FSD27795	AlbertoA
struct trs_alert_FiscDateVsOSDate_
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    
    unsigned short  subopcode;				// 1	248 ALERT_FISCAL_DATE_DIFFER_POS_DATE	<Opcode Value="248" />
    unsigned char	function;				// 3	
	
	unsigned char	Dates[40];				// 4
	

    struct   trans_tail_  tail;			// 44
};

struct trs_alert_fiscal_problem_
{
    unsigned char opcode;         //0x63	<Opcode Value="0x63" />
    
    unsigned short  subopcode;		//102 ALERT_FISCAL_ERROR	<Opcode Value="102" />
    unsigned char function;

    unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char opt_nu15         :1;
    unsigned char opt_nu16         :1;
    unsigned char opt_nu17         :1;  // 4

	long	lErrorCode;					// 5
	long	lExtendedErrCode;			// 9			
	
    unsigned char data[29];				// 13
    unsigned char org_pos_no;			// 42
    unsigned char org_pc_no;			// 43

    struct   trans_tail_  tail;
};

struct trs_alert_trans_send_
{
    unsigned char opcode;         //0x63	<Opcode Value="0x63" />
    
    unsigned short  subopcode;		//166 ALERT_TRANS_MANAGER_STUCK	<Opcode Value="166" />
    unsigned char function;

    unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char opt_nu15         :1;
    unsigned char opt_nu16         :1;
    unsigned char opt_nu17         :1;  // 4

	long	ClnSendPointer;				// 5
	long	ClnWritePointer;			// 9			
	
    unsigned char data[29];				// 13
    unsigned char org_pos_no;			// 42
    unsigned char org_pc_no;			// 43

    struct   trans_tail_  tail;
};


//INDYME
struct trs_alert_indyme_
{
    unsigned char  opcode;         //0x63	<Opcode Value="0x63" />
    
    unsigned short subopcode;		 //		<Opcode Value="0x00-0x50"/>
    unsigned char  function;		

	unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char opt_nu15         :1;
    unsigned char opt_nu16         :1;
    unsigned char opt_nu17         :1;  // 4

    unsigned long  virtual_key; 
    unsigned short indyme_rtc;	 
    
    unsigned char  data[31];
    unsigned char  org_pos_no;
    unsigned char  org_pc_no;

    struct   trans_tail_  tail;
};

struct trs_alert_batch_
{
   unsigned char opcode;         //0x63	<Opcode Value="0x63" />
   
   unsigned short  subopcode;      // 90	<Opcode Value="90" />
   unsigned char function;	   	//  0

   unsigned char disp_message     :1;
   unsigned char drvfile_popup    :1;
   unsigned char ignore_alert     :1;
   unsigned char use_org_pos_no   :1;
   unsigned char get_text_msg     :1;
   unsigned char bPLURecord       :1;		//54743 - Batch acknowledge from POS
   unsigned char opt_nu16         :1;
   unsigned char opt_nu17         :1;  // 4

   unsigned char host_batch_number[6];
   unsigned long host_records;
   unsigned long accepted_records;

   unsigned short ushBatchType;				//54743 - Batch acknowledge from POS
   unsigned char data[21];
   unsigned char org_pos_no;
   unsigned char org_pc_no;

	struct   trans_tail_  tail;
};

struct trs_alert_board_msg_
{
   unsigned char opcode;         //0x63	<Opcode Value="0x63" />
   
   unsigned short  subopcode;      // 110	<Opcode Value="110" />
   unsigned char function;	   			//  3

   unsigned char disp_message     :1;
   unsigned char drvfile_popup    :1;
   unsigned char ignore_alert     :1;
   unsigned char use_org_pos_no   :1;
   unsigned char get_text_msg     :1;
   unsigned char bCashierType     :1;
   unsigned char bPOSType         :1;
   unsigned char opt_nu17         :1;	// 4

   unsigned char msg_number;			//5
   unsigned char cashier_answer;		//6	//0 - cancel  //FSD219364
											//1 - no
											//2 - yes
											//3 - timeout //FSD219364
   unsigned char msg_text[35];			//7 //first 35 bytes of text
   
   unsigned char org_pos_no;			//42
   unsigned char org_pc_no;				//43

   struct   trans_tail_  tail;
};

struct trs_file_refresh_
{
	unsigned char opcode;         //0x63 <Opcode Value="0x63" />

	unsigned short  subopcode;      // 89 ALERT_FILE_REFRESH	<Opcode Value="89" />
	unsigned char function;	   	// 3 0

    unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char zip_failed       :1; //FSD11944
    unsigned char unzip_failed     :1; //FSD11944
    unsigned char opt_nu17         :1;  // 4

	unsigned char qdx_file;	 //5 File number. 0 represent all files
	unsigned char status;	 //6 1-Start refresh checksum fails
   								 // 2-Start refresh TV problem
							// 3-Suspend load  user abort
							// 4-Resume  load  
   								 // 5-Start refresh force request
							// 6-Start refresh CFM request
							// 7-File refreshing completed
							// 8- pos menu QDX file refreshing fails //FSD11944

	unsigned long  number_of_records; //7  #10593
	unsigned short pos_checksum;      //11
	unsigned long  FO_number_of_records; //13  #10593
	unsigned short FO_checksum;       //17
   
	unsigned char data[23];  // 19

	unsigned char org_pos_no; //42
	unsigned char org_pc_no;  //43

	struct   trans_tail_  tail; //44
};

struct trs_alert_transact_err_ 
{
	unsigned char opcode;    // 0x63 <Opcode Value="0x63"/>

	unsigned short  subopcode; // ALERT_TRANSACTION_QDX_PROBLEM	116	<Opcode Value="116"/>
	unsigned char function;    // 3

    unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char opt_nu15         :1;
    unsigned char opt_nu16         :1;
    unsigned char opt_nu17         :1;  // 4

    unsigned short  trans_fifo_size;    // 5
    unsigned short  trans_first;		// 7
    unsigned long	trans_pointer;		// 9
    unsigned short  trans_count;		// 13
    unsigned short  future_trans_count; // 15
    unsigned short  trans_seq_no;		// 17

	unsigned char data[23];             // 19
	unsigned char org_pos_no;			// 42
	unsigned char org_pc_no;			// 43
   								  
	struct trans_tail_ tail;			// 44
};

struct trs_alert_post_version_ 
{
	unsigned char opcode;    // 0x63 <Opcode Value="0x63" />
	
	unsigned short  subopcode; // 80 - POST version	<Opcode Value="80" />
	unsigned char function;
	
	unsigned char disp_message     :1;
	unsigned char drvfile_popup    :1;
	unsigned char ignore_alert     :1;
	unsigned char use_org_pos_no   :1;
	unsigned char get_text_msg     :1;
	unsigned char opt_nu15         :1;
	unsigned char opt_nu16         :1;
	unsigned char opt_nu17         :1;	// 4
	
	unsigned char program_name[12];		//5
	unsigned char compile_date[3];		//17
	unsigned char compile_time[3];		//20
	unsigned char version[12];			//23
	
	unsigned char data[6];				//35
	unsigned char TaxSystemType;		//41 // CR #9351
	
	unsigned char org_pos_no;			//42
	unsigned char org_pc_no;				//43
	
	struct trans_tail_ tail;				//44
};

struct trs_alert_post_mail_  
{
   unsigned char  opcode;      // 0x63   <Opcode Value="0x63" />

   unsigned short subopcode;   // 113 - POST_MAIL	<Opcode Value="113" />
   unsigned char  function;	   //0

   short 		  FromAddr;
   char  		  MailMsgNum[4]; //BCD
   unsigned char  SendToAll;

   unsigned char  data[31];
   unsigned char  org_pos_no;
   unsigned char  org_pc_no;

   struct   trans_tail_  tail;
};

// Code Distribution
struct trs_alert_pkg_
{
   unsigned char opcode;   // 0x63		//0	<Opcode Value="0x63" />
   unsigned short subopcode;// 0xde     //1	<Opcode Value="0xDE" />
   unsigned char function;				//3

   unsigned char disp_message    :1;	//4
   unsigned char drvfile_popup   :1;
   unsigned char ignore_alert    :1;
   unsigned char use_org_pos_no  :1;
   unsigned char get_text_msg    :1;
   unsigned char manual_pkg      :1;
   unsigned char nu06            :1;
   unsigned char nu07            :1;

   unsigned char pkg_name[12];			//5
   unsigned char data[14];				//17
   unsigned char opener_result;			//31
   unsigned short prev_rel_a;			//32	
   unsigned short prev_rel_b;			//34
   unsigned short prev_rel_c;			//36
   unsigned short prev_rel_d;			//38
   unsigned short error;				//40
   unsigned char pos_no;				//42
   unsigned char pc_no;					//43

   struct   trans_tail_  tail;			//44
};

struct trs_ola_alert_ // 200102 use by CheckCrd.dll 
{
    unsigned char	opcode;         //0x63	<Opcode Value="0x63"/>
    
    unsigned short	subopcode;		//		<Opcode Value="0x51"/>
    unsigned char	function;

    unsigned char disp_message     :1;
    unsigned char drvfile_popup    :1;
    unsigned char ignore_alert     :1;
    unsigned char use_org_pos_no   :1;
    unsigned char get_text_msg     :1;
    unsigned char opt_nu15         :1;
    unsigned char opt_nu16         :1;
    unsigned char opt_nu17         :1;  // 4

	char			new_ola_provider1; // 0 - mean offline , 1- 10 mfs1 - lfs10
	char			old_ola_provider1; // 0 - mean offline , 1- 10 mfs1 - lfs10 170102

    unsigned char	data[35];
    unsigned char	org_pos_no;
    unsigned char	org_pc_no;

    struct   trans_tail_  tail;
};

//FSD31008 - AlaramSrv alerts txn, written only from
//ExtTrs32 and not from POS.
struct trs_alert_alarm_srv_         
{
 unsigned char  opcode;               //0 0x63
 unsigned short subopcode;            //1 800(0x320)
 unsigned char  function;             //3
    
 unsigned short category;             //4
 unsigned short sub_category;         //6
 unsigned short alarm_id;             //8
 unsigned short device_no;            //10
 
 unsigned char  nu[32];               //12         

 struct   trans_tail_  tail;          //44
};


struct trs_alert_auto_fuel_mngt_		//FSD30537
{
    unsigned char opcode;				// 0 - 0x63	<Opcode Value="0x63" />
    
    unsigned short  subopcode;			// 1 - 176 ALERT_AUTO_FUEL_MNGT	<Opcode Value="176" />
    unsigned char function;				// 3 - alert number

    unsigned char disp_message     :1;	// 4
    unsigned char drvfile_popup    :1;	// 4
    unsigned char ignore_alert     :1;	// 4
    unsigned char use_org_pos_no   :1;	// 4
    unsigned char get_text_msg     :1;	// 4
    unsigned char opt_nu15         :1;	// 4
    unsigned char opt_nu16         :1;	// 4
    unsigned char opt_nu17         :1;  // 4

	long	lBatchNo;					// 5
	long	lStoreId;					// 9			
    unsigned char uchPriceChangeType;	// 13
	
    unsigned char data[28];				// 14
    unsigned char org_pos_no;			// 42
    unsigned char org_pc_no;			// 43

    struct   trans_tail_  tail;
};

//FSD56626
struct trs_alert_CombinedUserSecurity_
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    unsigned short  subopcode;				// 1	
    unsigned char	function;				// 3	
	
	unsigned char disp_message		  :1;	// 4
    unsigned char drvfile_popup		  :1;	// 4
    unsigned char ignore_alert		  :1;	// 4
    unsigned char use_org_pos_no	  :1;	// 4
    unsigned char get_text_msg		  :1;	// 4
    unsigned char opt_nu15			  :1;	// 4
    unsigned char opt_nu16			  :1;	// 4
    unsigned char opt_nu17			  :1;   // 4
	
	unsigned short	ushCashierNo;			// 5
	unsigned short	ushPosNo;				// 7
	unsigned char	NU[35];					// 9
	

    struct   trans_tail_  tail;			// 44
};

struct trs_alert_scale_error_ // #144180
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    unsigned short  subopcode;				// 1	
    unsigned char	function;				// 3	
	
	unsigned char disp_message		  :1;	// 4
    unsigned char drvfile_popup		  :1;	// 4
    unsigned char ignore_alert		  :1;	// 4
    unsigned char use_org_pos_no	  :1;	// 4
    unsigned char get_text_msg		  :1;	// 4
    unsigned char opt_nu15			  :1;	// 4
    unsigned char opt_nu16			  :1;	// 4
    unsigned char opt_nu17			  :1;   // 4
	
	short shScaleError;						// 5
	unsigned char NU[35];					// 7
    unsigned char org_pos_no;				// 42
    unsigned char org_pc_no;				// 43
	
    struct   trans_tail_  tail;				// 44
};

struct trs_alert_fatal_error_ // #144180
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    unsigned short  subopcode;				// 1	
    unsigned char	function;				// 3	
	
	unsigned char disp_message		  :1;	// 4
    unsigned char drvfile_popup		  :1;	// 4
    unsigned char ignore_alert		  :1;	// 4
    unsigned char use_org_pos_no	  :1;	// 4
    unsigned char get_text_msg		  :1;	// 4
    unsigned char opt_nu15			  :1;	// 4
    unsigned char opt_nu16			  :1;	// 4
    unsigned char opt_nu17			  :1;   // 4
	
	short shFatalError;						// 5
	unsigned char NU[35];					// 7
    unsigned char org_pos_no;				// 42
    unsigned char org_pc_no;				// 43
	
    struct   trans_tail_  tail;				// 44
};

struct trs_alert_printer_error_ // #144180
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    unsigned short  subopcode;				// 1	
    unsigned char	function;				// 3	
	
	unsigned char disp_message		  :1;	// 4
    unsigned char drvfile_popup		  :1;	// 4
    unsigned char ignore_alert		  :1;	// 4
    unsigned char use_org_pos_no	  :1;	// 4
    unsigned char get_text_msg		  :1;	// 4
    unsigned char opt_nu15			  :1;	// 4
    unsigned char opt_nu16			  :1;	// 4
    unsigned char opt_nu17			  :1;   // 4
	
	short shPrinterError;					// 5

	unsigned char NU[35];					// 7
    unsigned char org_pos_no;				// 42
    unsigned char org_pc_no;				// 43
	
    struct   trans_tail_  tail;				// 44
};

struct trs_alert_cust_disp_error_ // #144180
{
    unsigned char	opcode;					//0x63	<Opcode Value="0x63" />
    unsigned short  subopcode;				// 1	
    unsigned char	function;				// 3	0 - INIT
											// 		1 - DISPLAY
	
	unsigned char disp_message		  :1;	// 4
    unsigned char drvfile_popup		  :1;	// 4
    unsigned char ignore_alert		  :1;	// 4
    unsigned char use_org_pos_no	  :1;	// 4
    unsigned char get_text_msg		  :1;	// 4
    unsigned char opt_nu15			  :1;	// 4
    unsigned char opt_nu16			  :1;	// 4
    unsigned char opt_nu17			  :1;   // 4
	
	short shCustDispError;					// 5

	unsigned char NU[35];					// 7
    unsigned char org_pos_no;				// 42
    unsigned char org_pc_no;				// 43
	
    struct   trans_tail_  tail;				// 44
};

struct trs_alert_failed_to_copy_receipt_pdf_file_
{
	unsigned char	opcode;		//0		 TRANS_ALERTS
	unsigned short	subopcode;	//1		 ALERT_FAILED_TO_COPY_RECEIPT_PDF_FILE

	char	szPDFName[34];		//3
	
	unsigned char NU[7];			//37
	
	struct   trans_tail_  tail;				// 44
};

struct trs_prom_cross_
{
    unsigned char opcode;         //0x60    //0	<Opcode Value="0x60" />
    unsigned char function;       //0x40    //1	<Opcode Value="0x40" />

    unsigned char prom_plu        :1;       //2
    unsigned char prom_dep        :1;
    unsigned char prom_sub        :1;
    unsigned char prom_mmg        :1;
    unsigned char prom_manfacture :1;
    unsigned char prom_group      :1;
    unsigned char opt_long_prom   :1; //PROM_CHNG
    unsigned char prom_internal_id :1;

    unsigned short  promotion_no;           //3
    unsigned char bucket_no;                //5
    unsigned char promotion_type;           //6
    
    unsigned short  dept;                   //7
    unsigned char code[7];                  //9
    
    unsigned char reward_type;              //16
    long          long_promotion_no;	//PROM_CHNG    //17
	long          apportionment_amount; //FS18285      //21

	unsigned short ushCrossType;                       //25
	union                                              //27
	{
		unsigned long ulSegment;
    
		unsigned char reserved[10];
	}Entity;
	unsigned char reserved[7];                        //37


    struct   trans_tail_  tail;                       //44
};
struct trs_info_deposit_                 //FS18341
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x41	<Opcode Value="0x41"/>

    unsigned char bRequest        :1; //2
    unsigned char bIgnoreRcvr     :1; //2
    unsigned char nu        :6;
    
    unsigned short  ushTender;        //3
    unsigned long ulAmount;           //5
    
    unsigned char reserved[35];      //9

    struct   trans_tail_  tail;
};


// Bashas
struct trs_trading_stamps_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x42	<Opcode Value="0x42" />

    long qualify_trading_stamps;
    short  trading_stamps_no;
    
    unsigned char reserved[36];

    struct   trans_tail_  tail;
};


// progressive    
struct trs_member_freq_shopper_
{
    unsigned char opcode;	  	//0x60	<Opcode Value="0x60" />
    unsigned char function;	//0x44		<Opcode Value="0x44" />

    unsigned char code[7];

    unsigned char nu00	   :1;
    unsigned char nu01	   :1;
    unsigned char nu02	   :1;
    unsigned char nu03	   :1;
    unsigned char nu04	   :1;
    unsigned char nu05	   :1;
    unsigned char nu06	   :1;
    unsigned char nu07	   :1;

    long	    old_price;
    long	    new_price;
    long		 qty;
    long	    save_amount;

    unsigned char reserved[18];
    struct   trans_tail_  tail;
};

struct trs_recall_trans_
{
	unsigned char opcode;	  	//0x60	<Opcode Value="0x60" />
	unsigned char function;		//0x46	<Opcode Value="0x46" />

	unsigned short recall_ticket_no;   // offset 2
	unsigned char  recall_pos_no;	   // offset 4
	unsigned short recall_cashier;	   // offset 5

	unsigned char start        :1;	   // offset 7
	unsigned char offline_mode :1;	   //   till offline
	unsigned char manual_entry :1;	   //   manual entry values
	unsigned char inv_not_fond :1;	   //   invoice not found
	unsigned char recall_saved_bakery	:1; // FSD9033
	unsigned char recall_drive_off		:1; // FSD9033
	unsigned char quick_recall_flag		:1; //FSD16261	
	unsigned char extended_recall		:1; // 9849SL - Miltiple Recalls Publix

	unsigned short  branch;			   // offset 8 
	unsigned short  checkout_bank;	   // offset 10

	long          inv_amount;          // offset 12 ( Invoice amount )
	unsigned char invoice_no[8];       // offset 16 ( Invoice number )
	unsigned char invoice_dt[3];	   // offset 24 ( Invoice date or used for date of saved transaction )

    unsigned short seq_no;             // offset 27
    unsigned char  time[3];            // offset 29

	unsigned char uchSavedTillType;    // offset 32 // FSD9033
	unsigned char uchSavedTillProfile; // offset 33 // FSD9033
	unsigned char uchRecallMode;       // offset 34 // FSD9033

	unsigned char saved_pos_no; // offset 35 // FSD9849
	unsigned short saved_cashier; // offset 36 //FSD9849

	unsigned long ulLongStoreNumber;   // offset 38

	unsigned char bEmbManualSave     :1;	   // offset 42
	unsigned char NU			     :7;	   // offset 42

	unsigned char reserved[1];         // offset 43

	struct   trans_tail_  tail;        // offset 44
};

#ifdef PRJ_ROW
struct trs_eft_settle_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x"60/>
    unsigned char function;       //0x47	<Opcode Value="0x47"/>
    unsigned char sub_function;   //0-Header 1/2-Data	<Opcode Value="0x00-0x02"/>


    unsigned char cut_over  :1;
    unsigned char in_window :1;
    unsigned char nu02      :1;
    unsigned char nu03      :1;
    unsigned char nu04      :1;
    unsigned char nu05      :1;
    unsigned char nu06      :1;
    unsigned char failed    :1;



	 union
    {
    	struct 
      {
    		unsigned char no;
    		unsigned short  count;
    		unsigned long amount;
      }ttl[5];
      
      struct 
      {
	      unsigned char terminal_ID[8];
	      unsigned char merchant_ID[15];
	      unsigned char date[4]; //ddmm
	      unsigned char time[6]; //hhmmss
	      unsigned char nu[2];
      }hdr;
    }x;

    unsigned char reserved[5];

    struct   trans_tail_  tail;
};
#else
struct trs_eft_settle_
{
    unsigned char	opcode;				//0x60	<Opcode Value="0x60"/>
    unsigned char	function;			//0x47	<Opcode Value="0x47"/>
	unsigned char	sub_func;			//2		<Opcode Value="0x03-0xFF"/>
	

	short			shTenderID;			//3
	unsigned char	chCardType;			//5
	unsigned char	chSettlementType;	//6
	unsigned char	chAccountType;		//7
	long			lAmount;			//8
	unsigned short	ushTrxCount;		//12
   	unsigned char	bUpdatePrvDay   :1;	//14
   	unsigned char	bUpdateSameDay  :1;	//14
   	unsigned char	bNU             :6;	//14


	unsigned char	sBIN[2];			//15
	unsigned char	sBCDSettlementDate[3]; // 17 //DDMMYY // FSD46688 Added PAP Settlement Date
	unsigned char	reserved[24];		//20

    struct   trans_tail_  tail;
};
#endif

struct trs_reorg_print_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x4C	<Opcode Value="0x4C" />

    unsigned char start       :1;
    unsigned char end         :1;
    unsigned char nu02        :1;
    unsigned char nu03        :1;
    unsigned char nu04        :1;
    unsigned char nu05        :1;
    unsigned char nu06        :1;
    unsigned char nu07        :1;

    unsigned char reserved[41];

    struct   trans_tail_  tail;
};

// Frys freq shop
struct trs_adv_freq_shop_
{
    unsigned char opcode;	  	//0x60	<Opcode Value="0x60" />
    unsigned char function;		//0x50	<Opcode Value="0x50" />

    unsigned char code[7];

    unsigned char exceed_limit 		:1;
    unsigned char opt_not_net_fs	:1; 
    unsigned char nu02	       		:1;
    unsigned char nu03	       		:1;
    unsigned char nu04	       		:1;
    unsigned char nu05	       		:1;
    unsigned char nu06	       		:1;
    unsigned char nu07	       		:1;

    long	    old_price;
    long	    new_price;
    long		 qty;
    long	    save_amount;

    unsigned char reserved[18];
    struct   trans_tail_  tail;
};

// Frys freq shop
struct trs_freq_shop_card_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x51	<Opcode Value="0x51" />

    unsigned char code[14];

    unsigned char reserved[28];

    struct   trans_tail_  tail;
};
struct trs_zip_printout_
{
    unsigned char opcode;	  //0x68	<Opcode Value="0x68" />

	 unsigned char bites;
    
    unsigned char data[42];

    struct   trans_tail_  tail;
};

struct trs_zip_printout_wide_
{
	unsigned char opcode;	//0 0x69	<Opcode Value="0x69" />

	unsigned char bytes;	//1
    unsigned char data[42];	//2

    struct   trans_tail_  tail;	//44
};

struct trs_zipped_text_
{
    unsigned char opcode;         //0x70	<Opcode Value="0x70"/>
    unsigned char function;       //0x12	<Opcode Value="0x12"/>

	unsigned char	DataType;			// 2
	unsigned char	FilledBytes;		// 3

	unsigned char	CompressedText[38]; // 4

	unsigned char	nu[2];				// 42

	struct   trans_tail_  tail;	// 44
};

//#134117 - 40 Char to be reflecated in EJ
struct trs_zipped_wide_text_
{
    unsigned char opcode;         //0	<Opcode Value="0x80"/>
    unsigned char function;       //1	<Opcode Value="0x26"/>
	
	unsigned char	DataType;			// 2
	unsigned char	FilledBytes;		// 3
	
	unsigned char	CompressedText[38]; // 4
	
	unsigned char	nu[2];				// 42
	
	struct   trans_tail_  tail;	// 44
};

//RDS13
struct trs_freq_shop_saving_
{
	unsigned char opcode;         	//0x60	<Opcode Value="0x60" />
	unsigned char function;       	//0x58	<Opcode Value="0x58" />

	unsigned char card_no[20];			// card no in ascii null terminated
   long			  saving_total;		// freq shopper savings
   
	unsigned char reserved[18];

	struct   trans_tail_  tail;
};

struct trs_savings_plus_
{
	unsigned char opcode;         	//0x60	<Opcode Value="0x60" />
	unsigned char function;       	//0x59	<Opcode Value="0x59" />

	unsigned char voided;	 
   
	unsigned char reserved[41];

	struct   trans_tail_  tail;
};

//SmartCard
struct trs_s_card_icc_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x5A	<Opcode Value="0x5A" />

	unsigned char AID[16];					//2  BCD
	unsigned char AIP[2];					//18 BCD
	unsigned char ATC[2];					//20 BCD
	unsigned char app_usage_control[2];		//22 BCD
	unsigned char app_version_no[2];		//24 BCD
	unsigned char issuer_codes_denial[5];	//26 Use By Tesco Only
	unsigned char issuer_codes_online[5];	//31 Use By Tesco Only
	unsigned char issuer_codes_default[5];	//36 Use By Tesco Only
	unsigned char conf_not_req;				//41 Use By Tesco Only
	
	unsigned char stPOSEntryMode[2];		//42 Not BCD 2 bytes pan entry mode
	// byte 1 entry mode 1
	// byte 2 entry mode 2
	struct   trans_tail_  tail;				//44
};

//SmartCard
struct trs_s_card_till_	 
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x5B	<Opcode Value="0x5B" />

	unsigned char cryptogram_type;				//2 BCD
	unsigned char currency_code[2];				//3 BCD
	unsigned char country_code[2];				//5 BCD
	unsigned char unpredictable_no[4];			//7 BCD
	unsigned char TVR[5];						//11 BCD
	unsigned char cardholder_verification[3];	//16 BCD
	unsigned char TSI[2];						//19 BCD
	unsigned char EMV_Terminal_Type;			//21 BCD
	unsigned char terminal_capabilities[3];		//22 BCD
	unsigned char transaction_cryptogram[8];	//25 BCD
	unsigned char cryptogram_info_data;			//33 BCD

	unsigned char reason_ola[2];				//34 IR 71
	unsigned char ola_date[3];					//36 DDMMYY
	unsigned char ola_time[2];					//39 HH:MM
	short shEmvAppIdLen;						//41 AID length. the AID from "605A" length - PCIDSS	
	
	unsigned char reserved[1];					//43

	struct   trans_tail_  tail;					//44
};

//SmartCard
struct trs_s_card_issuer_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x5C	<Opcode Value="0x5C" />

	unsigned char issuer_app_data[32];			//2 BCD
	unsigned char uchIssuerAppDataLength;		//34 The actual length of unpaced issuer_app_data, from 0 to 64.

	unsigned char terminal_IFD[4];				//35 BCD Terminal Interface Device Serial Number.

	long app_sequence_no;						//39 Application PAN Sequence Number (ICC tag '5F34').

	unsigned char app_sequence_no_used		:1;	//43
	unsigned char reserved					:7;

	struct   trans_tail_  tail;					//44
};

//SmartCard
struct trs_s_card_cvm_list_
{
	unsigned char opcode;		//0x60	<Opcode Value="0x60" />
	unsigned char function;		//0x9A	<Opcode Value="0x9A" />
	unsigned char sub_func;		//2		1-inf_header 2,3,4,5,6-inf1

	union
	{
		struct
		{
			short shCVMListLength;				//3 The length of the hexadecimal string the cvm list was made(BCD) from, upto 512 chars.
			unsigned char cvm_list_data[39];	//5 The first (39 * 2 = 78) chars ( sub_func = 1 -> chars 0<->77 )

		} inf_header;

		struct
		{
			unsigned char cvm_list_data[41];	//3 ( sub_func = 2 -> chars 78<->159 )( sub_func = 3 -> chars 160<->241 )( sub_func = 4 -> chars 242<->323 )( sub_func = 5 -> chars 324<->405 )( sub_func = 6 -> chars 406<->487 )( sub_func = 7 -> chars 488<->569 )

		} inf1;

	} info;

	struct   trans_tail_  tail;					//44
};

//SmartCard
struct trs_s_card_script_results_
{
	unsigned char opcode;		//0x60	<Opcode Value="0x60" />
	unsigned char function;		//0x9B	<Opcode Value="0x9B" />
	unsigned char sub_func;		//2		1-inf_header 2,3,4-inf1

	union
	{
		struct
		{
			short shScriptResultsLength;			//3 The length of the hexadecimal string the script results was made(BCD) from, upto 250 chars.
			unsigned char script_results_data[39];	//5 The first (39 * 2 = 78) chars ( sub_func = 1 -> chars 0<->77 )

		} inf_header;

		struct
		{
			unsigned char script_results_data[41];	//3 ( sub_func = 2 -> chars 78<->159 )( sub_func = 3 -> chars 160<->241 )( sub_func = 4 -> chars 242<->323 )

		} inf1;

	} info;

	struct   trans_tail_  tail;					//44
};

//SmartCard
struct trs_s_card_icc_ext_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x9C	<Opcode Value="0x9C" />

	unsigned char sApplicationLabel[32];		//2
	unsigned char uchApplicationLabelLength;	//34

	unsigned char reserved[9];					//35

	struct   trans_tail_  tail;					//44
};

// Finland
struct trs_sales_on_account_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x5D	<Opcode Value="0x5D" />

    unsigned char cp_name[16];
    unsigned char cp_account_num[12];
    unsigned char cp_related_num[10];	

	unsigned char reserved[4];

    struct   trans_tail_  tail;
};

struct trs_customer_survey_
{													
    unsigned char  opcode;           //0x60	<Opcode Value="0x60" />
    unsigned char  function;         //0x5E	<Opcode Value="0x5E" />
													
    unsigned short cashier_no;						//2
    unsigned char  checkout_bank; 					//4		0-99
    long           question_no;						//5
    
    unsigned char  end_ticket      :1;				//9
    unsigned char  start_ticket    :1;				//9
	unsigned char  yesno_type      :1;				//9
	unsigned char  numeric_type    :1;				//9
    unsigned char  yesno_answer    :1;				//9		0 - No, 1 - Yes
	unsigned char  zip_type        :1;				//9		HF #9031
	unsigned char  phone_type      :1;				//9		HF #9031
	unsigned char  by_function     :1;				//9		HF #9031 - KW

	unsigned long  numeric_answer;					//10
	unsigned char  zip_code[5];						//14	HF #9031
	unsigned char  phone_number[10];				//19	HF #9031
     
	unsigned short	ushSurveyLists;					//29
	unsigned short	ushSurveyListItem;				//31

	unsigned char bCustIgnoredSurvey		:1;		//33	FSD16206
	unsigned char bInformOnlyType			:1;		//33    FSD31359
	unsigned char bInformOnlyAnswer			:1;		//33    FSD31359
	unsigned char bBySubTotal				:1;		//33	FSD51799
	unsigned char bFlightNumberAnswer		:1;		//33	FSD432409
	unsigned char nuBit						:3;		//33

	unsigned char sRecordId[5];	                    //34	FSD16129 Record id (Zip Code Id)
    unsigned char reserved[5];						//39		

    struct   trans_tail_  tail;						//44
};

// TD#64966
struct trs_customer_survey_ext_
{													
    unsigned char  opcode;              // 0 0x70  TRANS_INFO2
    unsigned char  function;            // 1 0x80  TRANS_INFO2_CUST_SRV_QUESTION_EXT
				
	union 
	{
		/* zipcode data */
		struct 
		{
			unsigned char uchValue[10]; // 2
			unsigned char uscNU[10];	// 12
		} zipcode;
		
		/* phone number data */
		struct 
		{
			unsigned char uchValue[20]; // 2
		} phone;

		/* FlightNumber data */ //FSD444697
		struct
		{
		     unsigned char uchFlightNumberValue[8];	//2
			 unsigned char ucNU[12];				//10
		} flightNumber;
	} data;

    unsigned char bPhoneNumber    :1;	// 22
	unsigned char bZipcode        :1;	// 22
	unsigned char bFlightNumber   :1;	// 22
	unsigned char bNU			  :5;   // 22

	short	shFlightSegmentDiscount;		//23

    unsigned char NU[19];			    // 25

    struct   trans_tail_  tail;		    // 44
};

struct trs_community_partner_
{
	unsigned char opcode;           //0x60	<Opcode Value="0x60" />
	unsigned char function;         //0x65	<Opcode Value="0x65" />

	unsigned char final     :1;
	unsigned char voided    :1;
	unsigned char nu02      :1;
	unsigned char nu03      :1;
	unsigned char nu04      :1;
	unsigned char nu05      :1;
	unsigned char MCR_used  :1;
	unsigned char scanned   :1;

	unsigned char card_no[20];
	long		  amount;

	unsigned char reserved[17];
   
	struct   trans_tail_  tail;	
};

struct trs_bonus_buy_
{
	unsigned char opcode;           //0x60	<Opcode Value="0x60" />
	unsigned char function;         //0x68	<Opcode Value="0x68" />

	unsigned char nu00			:1;  //2
	unsigned char nu01			:1;
	unsigned char nu02			:1;
	unsigned char nu03			:1;
	unsigned char OptReturnTrans		:1; //FSD10576
	unsigned char OptReturnItem			:1; //FSD10576
	unsigned char cancel_item   :1;
	unsigned char subtract_item :1;

	unsigned char plu_code[7];       //3
	
	unsigned char type;              //10
	unsigned char valid_date[3];     //11
	
	         long BB_value;          //14
	         long sale_value;        //18
	         long savings;           //22
	
	unsigned char reserved[18];      //26 
   
	struct   trans_tail_  tail;      //44
};

struct trs_ej_info_bad_account_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60" />
	unsigned char function;       //0xA0	<Opcode Value="0xA0" />

	unsigned char account_no[10]; //(BCD 19)
    unsigned char account_length; 
    unsigned char crng_no;

	unsigned char MCR_used : 1;   
	unsigned char nu01     : 1;
	unsigned char nu02     : 1;
	unsigned char nu03     : 1;
	unsigned char nu04     : 1;
	unsigned char nu05     : 1;
	unsigned char nu06     : 1;
	unsigned char nu07     : 1;
	
	unsigned char reserved[29];

	struct        trans_tail_  tail;
};

struct trs_ej_info_price_inquery_
{
	unsigned char opcode;             //0x60	<Opcode Value="0x60" />
	unsigned char function;           //0xA1	<Opcode Value="0xA1" />
	
    unsigned char plu_code[7];        

    long          inquery_amount;     //total inquery
    long          prom_amount;        //total promotion             
    long          disc_amount;        //total discount

    long          plu_price;          
    long          org_price;          
    long          count;              
    long          dec_count;          
    unsigned char mult_sell_unit;     
    long          weight;             

    unsigned char execute_inquery :1; 
    unsigned char store_coupon    :1; 
    unsigned char vendor_coupon   :1; 
    unsigned char other_coupon    :1; 
    unsigned char WIC_item        :1; 
    unsigned char nu05            :1; 
    unsigned char nu06            :1; 
    unsigned char nu07            :1; 
	
	unsigned char reserverd;      

    struct trans_tail_  tail;
};

struct trs_ej_info_control_check_
{
	unsigned char  opcode;            //0x60	<Opcode Value="0x60" />
	unsigned char  function;          //0xA2	<Opcode Value="0xA2" />
 
	unsigned short CC_no;             
	
	unsigned char  accepted       :1; 
	unsigned char  nu01           :1;  
	unsigned char  nu02           :1;  
	unsigned char  nu03           :1;  
	unsigned char  nu04           :1;  
	unsigned char  nu05           :1;  
	unsigned char  nu06           :1;  
	unsigned char  nu07           :1;  

    unsigned char  ask_yes_no     :1; 
    unsigned char  manager_key    :1; 
    unsigned char  stop_activity  :1;  
    unsigned char  supervisor_key :1;
    unsigned char  warning_only   :1;
    unsigned char  valid_record   :1;
    unsigned char  delayed_auth   :1; 
    unsigned char  value_at_text  :1;
    
	unsigned char  privilege;         
	unsigned short cashier_no;         
    unsigned char  templates[2];        

	unsigned char  pos_status;        
	unsigned char  t_log_reporting_level;	// Publix reporting level #SL1671
	
	int				reason; //see CC_REASON
    unsigned char reserved[27]; 
	
	struct         trans_tail_  tail;
};

struct trs_ej_info_age_id_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0xA3	<Opcode Value="0xA3" />
	
	unsigned char age;         //current age
    unsigned char date[3];     //birthday date

	unsigned char bypass   :1; //bypass age
 	unsigned char check    :1; //check age
	unsigned char accepted :1; //(Bypass Or Check) was accepted ( Yes - 1 , No - 0 ) 
	unsigned char no_sale  :1; //FSD16470
	unsigned char bCashierDeclined   :1;	//FSD42826 - Cashier Age Validation - 0 when is customer age tran , 1 when it's cashier age trans
	unsigned char bWasCancelled	     :1;	//FSD42826 - Cashier Age Validation 
	unsigned char bVoidItemAtEndOfTicket     :1; //FSD42826 - Cashier Age Validation 
	unsigned char bCashierDateOfBirthUpdate     :1; //FSD90762 - Cashier Age Validation 

    unsigned char plu_code[7]; //FSD16470
	short dep_nu;			   //FSD16470
	
	short shSupervisorID	;	//FSD42826 - Cashier Age Validation 
	unsigned char ushDeclinationReasonCode; //FSD102391
	unsigned char uchAgeRequired; //SPAR_SCOT-FSD415354  //19
    unsigned char reserved[24];                          //20
	struct   trans_tail_  tail;
};


struct trs_item_on_sale_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0xA4	<Opcode Value="0xA4" />
	
   unsigned char code[7]; 

   unsigned char opt_qty_is_weight			:1;
   unsigned char opt_qty_is_decimal_qty	:1;
   unsigned char opt_qty_is_fuel_gallons	:1;	// PosPump. TESCO field name is "opt_qty_is_ltr"
   unsigned char opt_nu							:5;

	unsigned long org_price;    
   unsigned char org_qty;      
	unsigned long on_sale_price;    
   unsigned char on_sale_qty;      
			   long amount;    
			   long qty;      

   unsigned char reserved[16]; 
   
	struct   trans_tail_  tail;
};

    
//MicroTrax
struct trs_balance_inquiry_
{
	unsigned char opcode;           //0x60	<Opcode Value="0x60" />
	unsigned char function;         //0x6B	<Opcode Value="0x6B" />

	long EBT_CASH_balance;	
	long EBT_FOODSTAMPS_balance;	
    unsigned char auth_no[9];
	unsigned char reference_no[11]; //Eft refference no
   
	unsigned char ebt_cash_balance           :1;	
	unsigned char ebt_foodstamps_balance     :1;	
    unsigned char enhanced_MPR_voucher_print :1;
	unsigned char nu4                        :1;
	unsigned char nu5                        :1;
	unsigned char nu6                        :1;
	unsigned char nu7                        :1;
	unsigned char nu8                        :1;
	
	unsigned char reserved[13];
   
	struct   trans_tail_  tail;
};


struct trs_saved_ticket_
{
	unsigned char opcode;           //0x60			//0	<Opcode Value="0x60" />
	unsigned char function;         //0x78			//1	<Opcode Value="0x78" />

   	unsigned short ticket_no;						//2

	unsigned char save_at_sale_mode          :1;	//4
	unsigned char save_at_tender_mode        :1;	
	unsigned char save_at_training_mode      :1;	
	unsigned char saved_for_payment          :1; // invoice saved for payment
	unsigned char saved_for_split            :1; // split invoice saved for payment
	unsigned char opt_PackTransaction        :1; // Pack transaction for bakary tills.
	unsigned char TaxVoucherRequested        :1;
	unsigned char save_at_StockCount         :1; //FSD14517
	
	long  		   ticket_amount;					//5
	long  		   media_total;						//9
	short 		   ticket_items;					//13
	unsigned short supervisor_no;					//15
	unsigned char invoice_no[8];					//17      Invoice number
	unsigned char invoice_dt[3];					//25
	unsigned char  recalled_pos_no;					//28 Bug #4395 - recalled pos no, if this ticket is recalled ticket - Gonen
	unsigned short recalled_ticket_no;				//29 Bug #4395 - recalled ticket no, if this ticket is recalled ticket - Gonen

	unsigned char quick_save_flag			:1;		//31 //FSD16261
	unsigned char bStandbyTicket			:1;		//31   FSD45272
	unsigned char bUseInvNumverAsRefNumber  :1;     //31 FSD62787 
	unsigned char voidedOnlinePurchaseItems	:1;		//31	OmerR FSD157230
	unsigned char NU						:4;     //31
	
	//FSD52741 Ticket Saving Enhancements For Drive-Offs
	unsigned char drive_off_start_time[3];			//32	Start time
	unsigned char drive_off_end_time[3];			//35	Start time	
	unsigned long security_number;					//38  #63998

	unsigned char reason_type;						//42	0 = Standard,1 = Drive Off, 2 = Outstanding Fuel Payment
	unsigned char reserved[1];						//43
   
	struct   trans_tail_  tail;						//44
};


//EFT_FIN: Finland
struct trs_eft_req1_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x80	<Opcode Value="0x80" />
	
	unsigned char amount[12];        //amount: '1000....' = 10.00
    unsigned char type_trans[4];     //type of transaction(00) + type of tender(05) = "0005"
	unsigned char account[19];		 //account: '4920567890123455...'
	unsigned char auth_code[6];

    unsigned char reserved[1]; 
   
	struct   trans_tail_  tail;
};


//EFT_FIN: Finland
struct trs_eft_req2_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x81	<Opcode Value="0x81" />
	
	unsigned char exp_date[4];
    unsigned char mess_type[4];     //message type:
									//0100 = authorisation request
									//0101 = repetition of request
									//0400 = cancellation of authorisation
									//0401 = repetition of cancellation
	unsigned char orig_resp_code[2]; //original response code (used in cancelations)

	unsigned char failed                 :1; //request failed/not
 	unsigned char flg_cancel_subtract    :1; //cancel/subtract = TRUE
	unsigned char nu02     :1; 
	unsigned char nu03     :1; 
	unsigned char nu04     :1; 
	unsigned char nu05     :1; 
	unsigned char nu06     :1; 
	unsigned char nu07     :1; 

	unsigned char account[10]; //cr#2888
	unsigned char account_len;
    unsigned char reserved[20]; 

   
	struct   trans_tail_  tail;
};


//EFT_FIN: Finland
struct trs_eft_resp1_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x82	<Opcode Value="0x82" />
	
	unsigned char amount[12];        //amount: '000000001000' = 10.00
    unsigned char type_trans[4];     //type of transaction + type of tender = "0005"
	unsigned char account[19];		 //account: '4920567890123455...'
	unsigned char auth_code[6];

    unsigned char reserved[1]; 

	struct   trans_tail_  tail;
};

//EFT_FIN: Finland
struct trs_eft_resp2_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x83	<Opcode Value="0x83" />
	
    unsigned char mess_type[4];     //message type:
									//0110 = response to authorisation
									//0410 = response to cancellation
	unsigned char resp_code[2];     //response code
	unsigned char messg_ID[6];      //message ID from SOK
	unsigned char timestamp_resp[10]; //MMDDhhmmss
	unsigned char auth_code_resp[6];  //Authorisation code

	unsigned char failed                 :1; //request failed/not
 	unsigned char flg_cancel_subtract    :1; //cancel/subtract = TRUE
	unsigned char nu02     :1; 
	unsigned char nu03     :1; 
	unsigned char nu04     :1; 
	unsigned char nu05     :1; 
	unsigned char nu06     :1; 
	unsigned char nu07     :1; 

	unsigned short tender_no; //EFT_FIN_1
    unsigned char reserved[11]; 
   
	struct   trans_tail_  tail;
};

//PROM_CPN_REQ
struct promotion_coupon_required_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60" />
	unsigned char function;    //0x87	<Opcode Value="0x87" />

	unsigned char promotion_no[5];				//2 bcd //PROM_CHNG (was 2)
	unsigned char no_coupon_required[7];		//7	BCD

	unsigned char delayed_promotion			:1;	//14
	unsigned char coupon_required_return	:1;	//14 PROM_CPN_REQ1
	unsigned char coupon_physical_scan		:1;	//14 coupon was physically scanned by cashier
	unsigned char bExtTrs			        :1;	//14 FSD18888
	unsigned char bExternalValidationLPE	:1;	//14 FSD16857
	unsigned char opt_was_canceled	        :1;	//14 TD#27963
	unsigned char opt_cancel 		        :1;	//14 TD#27963
	unsigned char opt_long_coupon_number	:1;	//14 FSD26780 - if the coupon_required length longer than 7 
												//		the coupon_required will be writen in the following 0x70,0x91 trs.

	unsigned char attached_plu[7];				// 15	 for coins PLU attached   
	short         count;						// 22

	unsigned char org_coupon_code[7];           // 24 BCD
	unsigned char org_coupon_code_len;          // 31

	unsigned char sSupData[8];                  // 32 Suplement data to the promotion coupon

	short         shCouponCodeLength;			// 40 #35566

	unsigned char bDigitalCoupon			:1;	// 42	FSD450172
	unsigned char bCouponCanceled			:1;	// 42	FSD450172
	unsigned char bNu						:6;	// 42

	unsigned char nu[1];                        // 43

    struct   trans_tail_  tail;
};

//PROM_CPN_REQ_EXT  FSD18888
struct promotion_coupon_required_ext_
{
	unsigned char opcode;						//0 0x70 <Opcode Value="0x70"/>
	unsigned char function;						//1 0x91 <Opcode Value="0x91"/>

	unsigned char org_coupon_code[23];			//2	BCD - (right justify, leading A's - at C4) (v8.6.3.8 is left justify see thier code)
	
	unsigned char sExternaData[6];              //25 //FSD394424, BCD-Serial Number
	short         shExternalDataLength;         //31 //FSD394424 - Serial Number length
	

	unsigned char nu[11];						//33

    struct   trans_tail_  tail;					//44
};
												//64
//CR8_BIGY
struct trs_msg5_plu_
{
	unsigned char opcode;      						//0 0x60	<Opcode Value="0x60" />
	unsigned char function;    						//1 0x8A	<Opcode Value="0x8A" />

	unsigned char opt_subtract             :1;		//2
	unsigned char opt_cancel               :1;		//2
	unsigned char opt_dep_sale			   :1;		//2
	unsigned char opt_item_sold			   :1;		//2
	unsigned char opt_recall_report 	   :1;		//2
	unsigned char opt_refund        	   :1;		//2
	unsigned char opt_post_void        	   :1;		//2
	unsigned char opt_recall_sale_not_allowed:1;	//2

	unsigned char descr_msg_plu[20];				//3
	unsigned char link_plu_code[7];					//23

	unsigned short dep_no;							//30
	unsigned char  uchMsgId;						//32
	unsigned char  uchMsgType;						//33
		
	unsigned char bBillPaymentPrint			: 1;	//34 temp solution for offline bill payments
	unsigned char bPlu_Msg_Ext				: 1;	//34 CR#6910
	unsigned char bPrintDetailsOnTicket		: 1;	//34 FSD14741
	unsigned char bInternalCodeIndentified	: 1;	//34 FSD20162
	unsigned char bBadBatchDateEntry		: 1;	//34 FSD20162
	unsigned char bOptWasCanceled       	: 1;	//34 FSD71422
	unsigned char bPOSItemMessageLinked		: 1;	//34 FSD234928
	unsigned char bControlCheckLinked		: 1;	//34 FSD234928

	unsigned char sInternalCode[7];					//35 FSD20162
	unsigned char uchCashierResponse;               //42 FSD71422
	unsigned char SCO_type;						    //43 FSD70677

	struct   trans_tail_  tail;						//44
};
//create for FSD403679 - PIM Enhancement
struct trs_pos_item_message_
{
	unsigned char opcode;      						//0 0x90	TRANS_INFO4
	unsigned char function;    						//1 0x09	TRANS_INFO4_POS_ITEM_MESSAGE

	unsigned char opt_subtract             :1;		//2
	unsigned char opt_cancel               :1;		//2
	unsigned char opt_dep_sale			   :1;		//2
	unsigned char opt_item_sold			   :1;		//2
	unsigned char opt_recall_report 	   :1;		//2
	unsigned char opt_refund        	   :1;		//2
	unsigned char opt_post_void        	   :1;		//2
	unsigned char opt_recall_sale_not_allowed:1;	//2
	unsigned char sPIM_DEscription[20];				//3
	unsigned char uchPIMId;							//23
	unsigned char uchPIMType;						//24
	unsigned char uchMinimumAge;					//25  
	unsigned char uchCashierResponse;               //26 
	short shDep;									//27
	unsigned char uchPluCode[7];					//29
	unsigned char uchNotInUse[8];					//36

	struct   trans_tail_  tail;						//44
};

struct trs_cash_withdrawal_eft_
{
	unsigned char opcode;         	//0x60	<Opcode Value="0x60"/>
	unsigned char function;       	//0x8C	<Opcode Value="0x8C"/>

	unsigned char flag_cash_withdrawal_eft		:1;	 
	unsigned char notused						:7;
   
	unsigned char reserved[41];

	struct   trans_tail_  tail;
};


struct trs_reward_tender
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60" />
    unsigned char function;       //0x6F	<Opcode Value="0x6F" />

    unsigned char voucher_id[11];
    unsigned char key_code[5];
	long				disc_per_qty;
	long				total_disc;
	long				total_gallons;
	char				fuel_grade;
	long				price_per_grade;


	 unsigned char manual :1;
 	 unsigned char unused :7;

    unsigned char nu[8];

    struct   trans_tail_  tail;
};

//CLICKS_EFT
/*struct trs_eft_nomad_print_slip_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x71	<Opcode Value="0x71"/>

	unsigned char eft_terminal_ret[11];
	unsigned char eft_sequence_ret[11];
	unsigned char eft_merchant_ret[15];
  
    unsigned char reserved[5];

    struct   trans_tail_  tail;
};
*/
//CLICKS_EFT
struct trs_eft_nomad_print_slip1_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x71	<Opcode Value="0x71"/>

	 unsigned char key1_eft[40];
	 unsigned char unuse[2];

    struct   trans_tail_  tail;
};

//CLICKS_EFT
struct trs_eft_nomad_print_slip2_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x95	<Opcode Value="0x95"/>

	 unsigned char key2_eft[40];
	 unsigned char unuse[2];

    struct   trans_tail_  tail;
};

//CLICKS_EFT
struct trs_eft_nomad_print_slip3_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x96	<Opcode Value="0x96"/>

	 unsigned char key3_eft[40];
	 unsigned char unuse[2];

    struct   trans_tail_  tail;
};

struct trs_pump_post_dec_
{
    unsigned char opcode;        //0 0x60	<Opcode Value="0x60"/>
    unsigned char function;      //1 0x97	<Opcode Value="0x97"/>

	 unsigned char account[10];   //2	
	 short         media_no;	   //12
	 long          amount; 	      //14
	 long	         volume;	      //18
	 short         declaine_code;	//22
	 unsigned char pump_no; 	   //24
 	 unsigned char	date[3]; 	   //25
	 unsigned char	time[3]; 	   //28
    unsigned char reseved[13];   //31
    struct   trans_tail_  tail;  //44
};


struct trs_pump_grade_price_id_
{
    unsigned char opcode;        //0 0x60	<Opcode Value="0x60"/>
    unsigned char function;      //1 0x98	<Opcode Value="0x98"/>

	 unsigned short price_id; 	   //2

    unsigned char  grade_id;     //4

	 long           price; 	      //5
    
    unsigned char reseved[35];   //9
    struct   trans_tail_  tail;  //44
};

//CLICKS_EFT
struct trs_eft_nomad_owner_name_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x72	<Opcode Value="0x72"/>

	unsigned char eft_owner_name[42];
  
    struct   trans_tail_  tail;
};


//CLICKS_EFT
struct trs_eft_nomad_media_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x70	<Opcode Value="0x70"/>

	unsigned short  card_type;
	unsigned short  media_no;
	long amount;
	long cashback;
	unsigned char account_eft[21];
	unsigned char enter_account					:2;
	unsigned char bVoidTenderIfEftNotConfirm	:1;	//FSD41937
	unsigned char not_use1						:5;
	unsigned char manual;					//card: 1-not MCR_used; 2-MCR_used;
    unsigned char auth_no[7];
											//cheque:3-not manual;  4-manual
    struct   trans_tail_  tail;
};

//CLICKS_EFT
struct trs_eft_nomad_budget_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x74	<Opcode Value="0x74"/>

	unsigned char eft_trans_no[10];
	unsigned short eft_budget_period;
	short eft_exp_year;
    short eft_exp_month;
	long eft_open_to_buy_bal_ret;
	long eft_acct_bal_ret;
	long eft__plan_1;

    unsigned char reserved[14];

    struct   trans_tail_  tail;
};


//CLICKS_EFT
struct trs_eft_nomad_cheque_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x75	<Opcode Value="0x75"/>

	unsigned long eft_cheque_clear_code;
    unsigned char eft_cheque_acc_num[16];
	unsigned long eft_cheque_number;
  
	unsigned char reserved[18];

    struct   trans_tail_  tail;
};

//EFT_NOMAD
struct trs_eft_nomad_trx_key_
{
	unsigned char opcode;		//0x60	<Opcode Value="0x60"/>
	unsigned char function;	//0x76		<Opcode Value="0x76"/>

	unsigned char	EFT_Trx_Key[33];
	long			Amount;

	unsigned char reserved[5];

	struct trans_tail_	tail;
};

//SelfScan22304FS
struct trs_scanpoint_save_report_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0x77	<Opcode Value="0x77"/>

	long scanpoint_scanned;
	long rescanned;

	unsigned char reserved[34];

	struct   trans_tail_  tail;
};

/*----------------------------------------------------------------------
Opcode: 0xD1
Start of ticket for miscellaneous transactions. To help identify start 
and end of tickets which are not wrapped by 0x21 and 0x05 opcodes
-----------------------------------------------------------------------*/
//!yaron
struct trs_misc_frame_						//OFS    Description
{
   unsigned char opcode;					//0		0xD1	<Opcode Value="0xD1"/>
   unsigned char func;                      //1     see MISC_TRANS_FUNC	<Opcode Value="0x00-0x02"/> 
   unsigned char filler[42];                //2      Future use
   struct   trans_tail_  tail;				//44	   TRS tail
};											

/*----------------------------------------------------------------------
Opcode: 0xD5
End of ticket for miscellaneous transactions. To help identify start 
and end of tickets which are not wrapped by 0x21 and 0x05 opcodes
-----------------------------------------------------------------------*/
//!yaron
struct trs_misc_end_                        //OFS    Description
{
   unsigned char opcode;					//0		0xD5	<Opcode Value="0xD5"/>
   unsigned char func;                      //1     see see MISC_TRANS_FUNC <Opcode Value="0x00-0x02"/>
   unsigned char filler[42];                //2      Future use
   struct   trans_tail_  tail;				//44	   TRS tail
};

//PrLn_CRQ3
struct trs_priceline_abn_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xB5	<Opcode Value="0xB5"/>

	unsigned char abn_nu[15];
	unsigned char unuse[27];

    struct   trans_tail_  tail;
};


struct trs_info_t7e_   // V7 EFT for phillipines.
{
	unsigned char opcode;      //0x17 TRANS_INFO_T7E	<Opcode Value="0x17"/>

	unsigned char t7e_invoice_number[6]; // 1
	unsigned char err_t7e_no;            // (7)  T7 0f-line(sale), 2 -T7 of-line (void),
									  // 3 - Bank of-line(sale), 4 - Bank of-line (void),
	unsigned short int  tender_no;    // 8
	unsigned char approval_code[6];   // 10
	long          ticket_amount;      // 16
	long          amount;             // 20

	unsigned char void_without_invoice_no	:1;
	unsigned char cancel_subtract_eft_t7e	:1;
	unsigned char non_EDC					:1;
	unsigned char post_void_trans			:1;
	unsigned char save_trans_t7				:1;
	unsigned char bReadExtT7eTrs			:1; 
	unsigned char bConfirmationTran			:1;		//Confirmation Message sent to eSP
	unsigned char bReferralNumEntered		:1;   // TD#57326 

	unsigned char cc_t7;   // 25
	short int     err_comm_t7;  // 26
	short int     response_code; // 28

	unsigned char issuer_name_t7[10]; // 30

	unsigned char original_pos_number; //40

	short shEftTerminalId;	//41

	unsigned char bApprovalCodeAsBCD	:1;	//43	//#66704
	unsigned char bAuthorizedOffline	:1; //FSD55825 - Accreditation Issue 
	unsigned char bVoidEFTTender		:1;	//FSD413134
	unsigned char bNU					:5;

	struct   trans_tail_  tail;  //44
};

//FSD27835
struct trs_info_t7e_ext_  //Adish
{
	unsigned char opcode;         //0x70    //0	<Opcode Value="0x70" TRANS_INFO2/>
    unsigned char function;       //0xBF    //1	<Opcode Value="0xBF" TRANS_INFO2_T7E_EXT/>

	unsigned char t7e_ext_invoice_number[22];	  //2

	unsigned char bIsBCDInvoiceNumber		:1;
	unsigned char not_use1					:7;   // 24

	char szEftTerminalId[19];					  //25 

    struct   trans_tail_  tail;				      //44	   TRS tail

};

//OEM points transaction
struct trs_info_oem_points_
{
	unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xB9	<Opcode Value="0xB9"/>

	unsigned char member_card_no[20];
	long current_points_earned;
	long points_accumulated;
	unsigned char reserv[14];

    struct   trans_tail_  tail;
};

//METRO (ROW)
struct trs_cust_at_sot_
{
   unsigned char opcode;         //0	0x60	<Opcode Value="0x60"/>
	unsigned char function;       //1	0xBC	<Opcode Value="0xBC"/>
	unsigned char sub_func;			//2	1-inf1 2-inf2 3-inf3 4-inf4	<Opcode Value="0x01-0x04"/>
											
	union
	{
		unsigned char data[41];		//3
		struct 
		{
			unsigned char	payment_type;			//3
			unsigned short	cust_category;			//4
			unsigned long	rep_code;				//6
			unsigned short	liquor_type;			//10
			unsigned char	liquor_exp_dt[3];		//12

			unsigned char	opt_rounding  :1;		//15
			unsigned char	opt_case_disc :1;
			unsigned char	opt_first_rcl_inv :1;
			unsigned char	opt_wet_tax   :1;
			unsigned char	opt_nu2       :1;
			unsigned char  opt_frgn		  :1;
			unsigned char	opt_StdPriceOnly :1;
			unsigned char	opt_cod_customer  :1;

			//unsigned char	inv_rrp       :1;		//16
			//unsigned char	inv_markdown  :1;
			//unsigned char	inv_barcode   :1;
			unsigned char	vat_exempt    :1;		//16
			unsigned char	cred_card_fee :1;
			unsigned char	delivery_chg  :1;
			unsigned char   order_entry   :1;
			unsigned char   rebate_fg     :1;		// ROW
			unsigned char   internal_plu  :1;		// TD146800
			unsigned char	inv_nu        :2;		// TD146800

			unsigned short	home_state;				//17
			unsigned char	cust_status;			//19
			long			   cheque_limit;			//20
			long			   credit_limit;			//24
			unsigned short	block_code;				//28
			unsigned char	disc_cd;					//30
			long          surcharge_percent;    //31
			short			cust_at_sot_mcr;			//35
			unsigned char	cust_charge_posting	:1;	//37
			unsigned char	cust_offline			:1;
			unsigned char	cust_not_found			:1;
			unsigned char	cust_tax_exempt		:1;
			unsigned char   cust_branch				:1; //SALE_PROC
			unsigned char	cust_reserve			:3;
			
			unsigned char  staff_type;				//38
			unsigned char price_exception;		//39
			unsigned char price_type;				//40
			unsigned char type_paym_at_sot;			//41  SALE_PROC
			unsigned char type_return;				//42  START_UP_MENU_RETURN
			unsigned char inv_option;               //43  RRP indicator 			
		} inf1;

		struct
		{
			unsigned char liq_license[12];		//3
			unsigned char tax_id[10];           //15 For V8.7.3.50 (Metro)
			long          postal_code;				//25
			long			  cheque_amt;				//29
			long			  credit_amt;				//33
			unsigned char force_crd_rtrn;       //37
			long force_crd_amount;					//38
			unsigned char	reserv[2];				//42
		}inf2;

		struct 
        {
			unsigned char	wet_expiry_date[3];		  //3
			unsigned char   wet_expiry_msg      :1;   //6      
			unsigned char   CustOrderOnTill     :1;	  //6	bug20477_1:for extract+RDH from till
			unsigned char   nu                  :6;

			unsigned char   wet_dt_exp;               //7

			unsigned char   order_no[10];             //8  Order number 
			unsigned char   tax_id[16];               //18 For V8.7.4.0 (CC&C)
			unsigned char	ref_order_no[10];	      //34 FSD214852
		}inf3;

		//DelivChrg
		struct
		{
			unsigned char del_chg_type;              //3 
			unsigned long del_chg_val;               //4
			long cst_ord_deliv_chrg_amount;          //8 Customer orders 
			unsigned long cust_debtor_no;            //12 Customer debtor number  
			unsigned char TypeCO;					//16  CR19916
			
			long lTradeDiscPercent;                 //17  Trade discount percentage (CR #19636).
			struct									//21  FS3025
			{			
				unsigned char bPickPackPrompt   :1; //Answer Yes/No on the Pick&Pack prompt
				unsigned char bDeliveryPrompt   :1; //Answer Yes/No on the Delivery Chaege prompt
				unsigned char bits              :6;
			}Flags;
			unsigned char uchPickPackChargeType;     //22 FS3025
			unsigned long ulPickPackChargeRate;      //23 FS3025
			unsigned long ulMinDeliveryFee;          //27 FS3025
			unsigned char sWebOrderID[10];           //31 FS3026

			unsigned char reserv[3];                 //41
		}inf4;

		//CR#7805
		struct 
        {
			unsigned char   sPDA[10];				  //3  PDA serial number
			unsigned char   order_type[6];			  //13	FSD56986
			unsigned char   placed_by[15];			  //19	FSD56986	
			unsigned char   nu1[10];				  //34
		}inf5;

		//FSD13992
		//FSD254276 send inf6 for each product type/price code on customer/GSP level
		struct
		{
			struct FeesByProductType_
			{
				unsigned char ProductType;
				unsigned char uchDeliveryFeeType;
				long lDeliveryValue;
				unsigned char uchPNPFeeType;
				long lPNPValue;
			}FeesByProductType;														//3
			
			struct FeesByPriceCode_
			{
				unsigned short ushPriceCode;
				unsigned char uchDeliveryFeeType;
				long lDeliveryValue;
				unsigned char uchPNPFeeType;
				long lPNPValue;
			}FeesByPriceCode;														//14

			int iAltCustID;															//26

			long opening_balance;	//FSD238694										//30
			short index; 															//34	//Defect 423903 - POS auto recovery (borisya)
			unsigned char Inf6NU[8];												//36
		}inf6;

		//FSD254275 Tobacco order enhancement 
	    struct
        {                                      
			short          operatorNoAuth;											//3
			short          operatorNo;												//5
			unsigned char  nu1[37];													//7
		}inf7;   


	} info;

    struct   trans_tail_  tail;
};

struct trs_loyalty_msg_
{
    unsigned char opcode;			//0x60	<Opcode Value="0x60"/>
    unsigned char function;			//0xC0	<Opcode Value="0xC0"/> TRANS_INFO_LOYALTY_MSG
	
	unsigned char nu_1;				//2  Not Used
	unsigned char chLanguageID;		//3  NUM
    char sMsgNo[2];					//4	 BCD  -  Msg ID
	unsigned char sCardNo[20];	  
									// 0 - Customer Specific message
									// 1 - All-Loyalty
	unsigned char cDestination;		// 2 - Non-Loyalty customers

	unsigned char bRemoveSpecificLink	:1;
	unsigned char bMessageExpired		:1;
	unsigned char nu7					:6;

	unsigned char data[16];

    struct   trans_tail_  tail;
};

// Sundry item transaction. Item price and description captured at POS
struct trs_info_sundry_product_					//OFS	Description
{
    unsigned char opcode;          				//0		Opcode - 0x60	<Opcode Value="0x60"/>
    unsigned char function;        				//1		Subopcode - 0xB1 <Opcode Value="0xB1"/>

    unsigned char plu_code[7];     				//2		Item number (BCD) 
	unsigned char plu_desc[20];	  				//9		Item description
	
    unsigned char opt_liquor    :1;				//29	This is a liquor item
    unsigned char opt_tobacco   :1;				//29	This is a tobacco item
	unsigned char opt_standard  :1;				//29	Standard item (not liquor or tobacco)
	unsigned char opt_tax_excl	:1;				//29	Tax amount is exclusive (added to) item price
	unsigned char opt_sundry_ext:1;             //29    Extended sundry item transaction
	unsigned char nu            :3;				//29	Future use

    unsigned short liquor_capacity;		 		//30	Liters in item unit
	long     tax_amount;						//32	Tax on this item
	long     plu_price;							//36	Item price
	long     qty;								//40	Quantity sold
	    
    struct   trans_tail_  tail;					//44	Transaction tail
};

// Sundry item extention transaction. 
struct trs_info_ext_sundry_product_			
{
    unsigned char opcode;          				//0		Opcode - 0x60		<Opcode Value="0x60"/>
    unsigned char function;        				//1		Subopcode - 0xE9	<Opcode Value="0xE9"/>

    unsigned char plu_code[7];     				//2		Item number (BCD) 
	unsigned char plu_second_desc[10];	  		//9		Item second description   
	unsigned char nu[25];                       //19
	    
    struct   trans_tail_  tail;					//44	Transaction tail
};


// Information about a non-merchendise item sales (ROW, wholesale)
struct trs_info_non_merc_						//OFS	Description
{
    unsigned char opcode;         				//0		Opcode - 0x60		<Opcode Value="0x60"/>
	unsigned char function;		   				//1		Subopcode - 0xCB	<Opcode Value="0xCB"/>

    unsigned char plu_code[7];               	//2		Item number
	short dep_no;								//9		Department number

	unsigned char opt_non_merch	    :1;			//11    Non-merchendise item
	unsigned char opt_tax_excl		:1;			//11	Tax is GST exclusive
	unsigned char nu				:6;			//11	Future use
																	 
	long tax_amount;							//12	Tax on this item
	unsigned char reserved[28];					//16	Future use
    
    struct   trans_tail_  tail;					//44	Transaction tail			
};


struct trs_loyalty_mail_info_
{
	unsigned char	opcode;           //0x60	<Opcode Value="0x60"/>
	unsigned char	function;         //0xCC	<Opcode Value="0xCC"/>

	unsigned char	sCardNo[10];		// card no in BCD
    unsigned char	chMailDeliveryStatus;

	unsigned char	nu[31];

	struct   trans_tail_  tail;
};


struct trs_create_clubcard_
{
	unsigned char	opcode;           //0x60	<Opcode Value="0x60"/>
	unsigned char	function;         //0xD2	<Opcode Value="0xD2"/>

	unsigned char	sCardNo[10];		// card no in BCD
    unsigned char	chGeneralStatus;
	
	unsigned char  chSchemeId;			//FSD414790




	unsigned char	nu[30];

	struct   trans_tail_  tail;
};

/* ROW */
// wholesale price calculation info.
// wholesale price calculation info.
struct trs_info_price_calc_						//OFS	Description
{
    unsigned char opcode;         				//0		Opcode - 0x60	<Opcode Value="0x60"/>
	unsigned char function;		   				//1		Subopcode - 0xB3	<Opcode Value="0xB3"/>

    unsigned char plu_code[7];               	//2		Item number
	short dep_no;								//9		Department number
	unsigned char opt_staff_disc    :1;			//11	Staff discount was given
	unsigned char opt_cust_disc     :1;			//11	Customer discount was given
	unsigned char opt_manag_disc    :1;			//11	Manager discount was given
	unsigned char opt_negative		:1;			//11	The amount in this TRS needs to be reversed. item was voided or returned.
	unsigned char opt_ttl_disc		:1;			//11	Total trans discount
	unsigned char opt_del_prom      :1;         //11    Member promotion discount (delayed promotion) 
	unsigned char opt_immd_prom     :1;			//11	Member promotion discount (immediate promotion)
	unsigned char nu                :1;         //11	Future use
																	 
    long milk_levy;		 						//12	Levy on this item
	long wet_tax_amount; 						//16	WET tax amount
	long liq_subsidy;	 						//20	Liquor subsidy amount
	long discount_amount; 						//24	Discount amount (staff/customer/manager)
	long tax_amount;							//28	Tax on this item
	long case_discount;							//32	Case discount amount
	long surcharge_rate;						//36	Surcharge percent
    long wet_tax_rate;							//40	Wet tax rate (percentage)
    
    struct   trans_tail_  tail;					//44	Transaction tail			
};

/* ROW */  
struct trs_info_grid_calc_
{
    unsigned char opcode;                             //0x60	<Opcode Value="0x60"/>
	 unsigned char function;		                  //0xB2	<Opcode Value="0xB2"/>
		
    unsigned char plu_code[7];								//offset 2

	 unsigned char comparative_no;                      // offset 9
	 unsigned char comparative_flag  :1;	            //offset 10 
	 unsigned char special_price     :1;
	 unsigned char  bExtFee2IsStdPrice:1;				// the field extra_fee2 is stadard price from price lists
	 unsigned char bPriceIncludesGST  :1;
	 unsigned char	nu                :4; 

    unsigned short price_code;								//offset 11

	 long  tax_on_extra_fee1;									//offset	13 
    long  service_fee;                      				//offset 17  
    long  finance_fee; 				 							//offset 21	
    long  extra_fee1; 				 							//offset 25	
	 long  brocken_pack;											//offset 29
	 long  extra_fee2;											//offset 33
	 long  promotion_number;									//offset 37

	 unsigned char cp_prc_indicator;							//offset 41
    unsigned char nu1[2];								   	//offset 42
	 struct   trans_tail_  tail;							   //offset 44
};


/* ROW */
// wholesale GST calculation info.
struct trs_info_excl_calc_						//
{
    unsigned char opcode;         				//0		Opcode - 0x60		<Opcode Value="0x60"/>
	unsigned char function;		   				//1		Subopcode - 0xCD	<Opcode Value="0xCD"/>

    unsigned char plu_code[7];               	//2		Item number
	short dep_no;								//9		Department number
	
	long tax_on_cust_disc;		                //11	Tax on Customer Discount amount 
    long tax_on_staff_amount; 	                //15    Tax on Staff Discount amount 
	long tax_on_case_disc;		                //19	Tax on Case Discount amount 
	long tax_on_surcharge_amount;				//23	Tax on Surcharge amount 
	long tax_on_brocken_pack;	 				//27	Tax on Brocken pack
	long tax_on_service_fee; 					//31	Tax on Service fee
	long tax_on_extra_fee1;						//35	Tax on extra fee1
	long tax_on_extra_fee2;						//39	Tax on extra fee2
	

	unsigned char nu1[1];                       //43
    
    struct   trans_tail_  tail;					//44	Transaction tail			
};
 

// Return voucher issued (ROW)
struct trs_info_rtn_voucher_					//OFS	Description
{
	unsigned char opcode;						//0		0x60	<Opcode Value="0x60"/>
	unsigned char function;						//1		0x7d	<Opcode Value="0x7D"/>
	unsigned char sub_func;						//2		0: Issue	<Opcode Value="0x00-0x02"/>
												//		1: Redemption
												//		2: Payment
												//		3: Error (FSD59749)
	unsigned char vcr_no[10];					//3		Voucher number in BCD
	long	      amount;						//13	Voucher amount
	unsigned short rdmp_tender_no;				//17	Redemption tender number
	unsigned char cust_no[10];					//19    Customer number
	unsigned char type;							//29	// FSD#30639
	
	unsigned char bStatus					:1;	//30	FSD59749 '0'-Online '1'-Offline
	unsigned char bBarcodeAlreadyGenerated	:1;	//30	FSD59749 '0'-No		'1'-Yes
	unsigned char bStoreLineIssued			:1; //30	FSD234817
	unsigned char bReturnVoucherPrinted		:1; //30	FSD234817
	unsigned char bNU						:4;	//30	
	
	unsigned char uchReasonCode;				//31	FSD59749
												//		0 - Already scanned
												//		1 - Not found
												//		2 - Offline
												//		3 - Other Store // FSD#157394

	unsigned char uchVchNoLen;					//32

	short shDepNo;								//33 // FSD59749

	long	lSerialNumber;						//35	FSD234817
	unsigned char	bcdExpirationDate[3];		//39	FSD234817

	unsigned char ucMethod;						//42

	unsigned char filler[1];					//43    Future use	

	struct   trans_tail_  tail;					//44	tail
};

struct trs_gift_basket_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xBD	<Opcode Value="0xBD"/>

    short gift_number;
	unsigned char start      :1;
	unsigned char end        :1;
	unsigned char void_gift  :1;

	unsigned char nu         :5;

    unsigned char reserved[39];

    struct   trans_tail_  tail;
};

//ROW:Metro
struct trs_info_add_credit_limit_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xC3	<Opcode Value="0xC3"/> transaction "allow additional credit/check limit"

	unsigned char type_limit;		// 1 - Credit limit, 2 - Check limit
	long          amount;
	unsigned char cust_no[20];		//customer number

	unsigned char bAddedByAuthorizationCode :1; //FSD63571
	unsigned char nu                        :7;

	unsigned char sAuthorizationCode[10];		//FSD63571

	unsigned char un[6];

    struct   trans_tail_  tail;
};

//ROW:Metro;SALE_PROC:ACCT_PAYM_ALL_TENDER
struct trs_info_charge_paym_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0x7F	<Opcode Value="0x7F"/> payment by all tenders

	unsigned char type_paym_eot;
	long          tender_amount;
	long		  amount_ttl;
	short		  tender_no;

	unsigned char cust_no[20];		//customer number

	unsigned char un[11];

    struct   trans_tail_  tail;
};

//EFT_NMD_CLICKS
//EFT handle transaction
struct trs_handle_nmd_							//OFS	Description
{
	unsigned char opcode;						//0		Opcode - 0x60		<Opcode Value="0x60"/>
	unsigned char function;						//1		Subopcode - 0xBE	<Opcode Value="0xBE"/>

	unsigned long	handle_no;					//2		Handle number

	unsigned char opt_invoice	:1;				//6		invoice (ticket) handle
	unsigned char opt_item		:1;				//6		item (elec. voucher) handle
	unsigned char opt_media		:1;				//6		eft handle. not really useD: handle send in media_ext2
	unsigned char opt_cancel	:1;				//6		cancel handle
	unsigned char opt_nu		:4;				//6		Future use

	unsigned char plu_code[7];					//7     eft_nomad_300303
	unsigned char reserved[30];					//14		Not used
  
   struct   trans_tail_  tail;					//44	Transaction tail
};

//EFT_NMD_CLICKS
struct trs_prn_nmd_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xBF	<Opcode Value="0xBF"/>
    unsigned char sub_function;   //number of string

	unsigned char	data[41];

    struct   trans_tail_  tail;
};


//Delivery charges
struct trs_info_deliv_chrg_
{
    unsigned char opcode;         //0x60   //0	<Opcode Value="0x60"/>
    unsigned char function;       //0x8D   //1	<Opcode Value="0x8D"/>

	long tax_rate;                         //2
	short tax_number;                      //6
	long delivery_amount;                  //8   //amount incl.tax
	long tax_on_delivery_amount;           //12 //tax amount into delivery amount
	unsigned char tax_ptr;                 //16

	long lPickPackAmount;                  //17 //amount incl.tax
	long lPickPackTaxAmount;               //21 //tax amount into pick&pack amount

	unsigned char sPluCode[7];             //25

	struct                                 //32
	{
		unsigned char bDeliveryFee		:1;
		unsigned char bPickPackFee		:1;
		unsigned char bItemLevelFee		:1;
		unsigned char bMinDeliveryFee	:1;
		unsigned char bSummaryInfo		:1;		//TD#327990; = 0, if the trs describes item info (this is for percentage case);   =1, if the trs describes summary info 
		unsigned char bPickPackPercent	:1;
		unsigned char bDeliveryPercent	:1;
        unsigned char nu				:1; 
	}Flags;

	unsigned char	uchFeesPrintFormat;		//33
	unsigned char	nu[10];					//34

    struct   trans_tail_  tail;				//44
};


//Self scanning recovery trs
struct trs_info_self_scanning_
{
    unsigned char opcode;         //0x60	<Opcode Value="0x60"/>
    unsigned char function;       //0xC6	<Opcode Value="0xC6"/>	TRANS_INFO_SELF_SCANNING


	unsigned char	bAdditionalItemsSelling			:1; // 2
	unsigned char	bSelfScanningTicketExecution	:1;
	unsigned char	bSelfScanningTicketParsed		:1;
	unsigned char	bSelfScanningReScanExecution	:1;
	unsigned char	bSelfScanReturnTicket			:1;
	unsigned char	bTicketFinished					:1;	// ticket parsed succesfully
	unsigned char	bOrderNumberAsTransNUmber	    :1; // #18119_U
	unsigned char	bSelfScanFrameTrs				:1; // FSD28467 GinatB, #376093:Self Scan Jumbo


	unsigned char chSelfSystemType;	//3  FAST_TRACK - 1 ,  HOME_SHOPPING - 2 , eCOMMERCE - 8, Mobile Scanning - 19

	unsigned char	sOrderNumber[8]; // 4

	unsigned char   sCustNoWithLeadingZero[20];							//12
	
	union
	{
		unsigned char	sRoadyOrderNumber[10];	// 32	BCD
		unsigned char   bcdOrderNumber[10];		// 32   BCD
	};
	short	shPosNumInFileName;				// 42	- Pos number from the self scan file name

    struct   trans_tail_  tail;
};

struct parking_data_
{
	char szParkingSpace[10];
	char szDeliveryMan[10];
	unsigned char NU[21];
};

//FSD#60132
struct online_order_
{
	unsigned char	bcdDateOfOrder[3];
	unsigned char	bcdTimeOfOrder[3];

	long			lVirtualTenderAuthAmount;//FSD#365331
	short			shVirtualTenderNumber;//FSD#365331
	unsigned char	NU[29];
};
//FSD#67023_1
struct later_scanning_
{
	unsigned char plu_code[7];						
	short qty;
	short msgNum;
	unsigned char bDepReq	:1;
	unsigned char NU1		:7;
	unsigned char NU[29];
};

//Self scanning recovery trs extension
struct trs_info_self_scanning_ext_
{
    unsigned char opcode;         //0x70	<Opcode Value="0x70"/>
    unsigned char function;       //0xE7	<Opcode Value="0xE7"/>	TRANS_INFO_SELF_SCANNING_EXT

	struct									//2
	{
		unsigned char bOnlineOrderIsActive :1;//FSD#60132
		unsigned char bLeftForLaterScanning:1;//FSD#67023_1
		unsigned char bAreaScaleVoidPackageStarted:1;// FSD 136864, bug #215634
		unsigned char bAreaScaleVoidPackageByUser:1;// FSD 136864, bug #215634
		unsigned char bEGroceryInProgress:1;//FSD#365331
		unsigned char bEGroceryManualProcessing	:1; //FSD#365331 - fixes after the AT
		unsigned char NU  :2;
	}StatusFlags;
	
	
	union									//3 should be 41 byte size
	{
		struct parking_data_ parking_data;
		struct online_order_ online_order;
		struct later_scanning_ later_scanning;
	}Data;

    struct   trans_tail_  tail;				// 44
};

 
//#271222 Self scanning recovery trs extension 2
struct trs_info3_self_scanning_ext2_
{
    unsigned char opcode;			//0x80	<Opcode Value="0x80"/>
    unsigned char function;			//0x56	<Opcode Value="0x56"/>	TRANS_INFO3_SELF_SCANNING_EXT2

	char szCustomerName[41];		//2
	char nu[1];						//43

    struct   trans_tail_  tail;		// 44
};																	     

/*----------------------------------------------------------------------
FSD257939
Opcode:	0x80 
Subopcode:	0x57
Additional discount information. This transaction will be logged
When a media transaction is changed to a discount transaction 
-----------------------------------------------------------------------*/
struct trs_info3_discount_ext_				//OFS	Description
{
    unsigned char opcode;					//0	0x80 <Opcode Value="0x80" />
    unsigned char function;					//1	0x57 <Opcode Value="0x57" /> TRANS_INFO3_DISCOUNT_EXT

    unsigned short tender_no;				//2	tender number
    unsigned char  type;					//4	tender type

    unsigned char account[21];				//5	account number (ascii)
    long tender_amount;						//26	previous tender value
    unsigned char reserve[14];				//30	unused
    
    struct   trans_tail_  tail;				//44	TRS tail
};							//64


/*----------------------------------------------------------------------
FSD294724
Opcode:	0x80 
Subopcode:	0x58
Additional media information. This transaction will be logged
When a media transaction is eWallet\Coupon and returns an SKU List
-----------------------------------------------------------------------*/
struct trs_info3_wiwallet_sku_				//OFS	Description
{
    unsigned char opcode;					//0	0x80 <Opcode Value="0x80" />
    unsigned char function;					//1	0x58 <Opcode Value="0x58" /> TRANS_INFO3_WIWALLET_SKU

	//	Total Available 42
	unsigned char invoice_number[6];		//2 (ascii)
    unsigned char account[21];				//8	account number (ascii)
	unsigned char sBCDInternalCode[7];      //29     BCD Internal Item code
	//	Flags
	unsigned char item_voided	 :1;		//36
	unsigned char nuFlag		 :7;
    unsigned char reserve[7];				//37	unused
    
    struct   trans_tail_  tail;				//44	TRS tail
};							//64

/* Rep code transaction */
struct trs_info_rep_code_  
{
    unsigned char	 opcode;			// 0x60	<Opcode Value="0x60"/>
    unsigned char  function;     // 0xBB		<Opcode Value="0xBB"/>
    unsigned char	 sub_opcode;   //1-trans, 2-item	<Opcode Value="0x01-0x02"/>
	 
    unsigned char plu_code[7];						
	long qty;
	unsigned char auto_rep_code  :1;
	unsigned char force_enter    :1;
	unsigned char cancel_item    :1;
    unsigned char subtract_item  :1;
	unsigned char void_rep_code  :1;
	unsigned char manual_enter   :1;
	unsigned char was_void       :1; //Bug#5171
    unsigned char bNonMerchandiseSale             :1; //FSD16776
	 
  	short rep_code;					//FSD8236
	short dept;						//FSD8236

	long lPlu_price;			//FSD11804
	long lAmount;				//FSD11804

    unsigned char date[3];		//FSD16776	Date (YYMMDD in BCD)
    unsigned char time[3];		//FSD16776	Time (HHMMSS in BCD)

	unsigned char    uchInvokeSource;  //0-None, 1-DIA

	long lDiscountAmount;			//KobiM - FSD75178

    unsigned char	 not_used[6];	//FSD11804
    struct			 trans_tail_  tail;
};

/* ON-LINE Trans info : invoice was recalled */
struct trs_info_inv_recall_
{	
    unsigned char opcode;             		//0x60	<Opcode Value="0x60"/>
    unsigned char function;           		//0xC7	<Opcode Value="0xC7"/>

    unsigned char	inv_no[8];	        		// offset 2
	 unsigned char	inv_date[3];		  		// offset 10

    unsigned char use_org_pos_no   :1;		// offset 13
	unsigned char opt_void_rcld_inv:1;      // void recalled invoice
    unsigned char opt_nu7          :6;
    unsigned char org_pos_no;					// offset 14

	 unsigned char	nu[29];				      // offset 15

    struct   trans_tail_  tail;
};


//Multi-Language
struct trs_info_lang_select_
{
    unsigned char opcode;             		//0x60	<Opcode Value="0x60"/>
    unsigned char function;           		//0xC9	<Opcode Value="0xC9"/>

    unsigned short customer_lang;
	 
    unsigned char manual_lang_change   :1;
    unsigned char opt_nu               :7;
    
	unsigned char origin ;	//FSD39780 EduardS
	unsigned char nu[38];

    struct   trans_tail_  tail;
};

//YaelB 6/3/06 FSD 11838. Add stock tender validation flag. 
struct trs_total_key_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0x26                 //1	<Opcode Value="0x26"/>

	short items;                                    //2
	long	amount;                                 //4
  
	unsigned char stock_tender_validation_needed;	//8
	unsigned char IsGetTargetMessagePromoInTicket :1;//9
	unsigned char IsGetVoucherPromoInTicket		  :1;//9	
	unsigned char NU							  :6;//9
  
	unsigned char uchLastSubStateInSaleMode;	    //10 //#121898
	long media_total;								//11
	unsigned char reserved[29];                     //15

	struct   trans_tail_  tail;                     //44
};

struct trs_info_supp_data_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0xCE                 //1	<Opcode Value="0xCE"/>

	unsigned short tender_no;                       //2
    unsigned char  type;                            //4
	unsigned char  data[8];                         //5
  
	unsigned char reserved[31];                     //13

	struct   trans_tail_  tail;                     //44
};

struct trs_info_barcode_prog_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0xCF                 //1	<Opcode Value="0xCF"/>

	short          barcode_type;                    //2
	unsigned short segments;                        //4
	long           points;                          //6

	unsigned char bLoyaltyCardRequierd      :1;     //10
	unsigned char bWasCancelled				:1;
    unsigned char bIncludeInBarcodeGroup    :1;
	unsigned char bExeVoidCoupon            :1;
	unsigned char Nu						:4;

    unsigned char szBarcode[20]; //bcd              //11
	short shOrgBarcodeLen;                          //31
	unsigned char reserved[11];                     //33

	struct   trans_tail_  tail;                     //44
};

//FSD46343
//It's struct. for union in info2 trans.0x70;0xD0
struct ExtPosFormEftAccountTypes_
{
    unsigned char  form_id[3];				//3		these offsets for trans. 0x70;0xD0
	unsigned char  uchInputDestination;		//6
	unsigned short ushListValueID;			//7
	unsigned short usInputValueID;			//9
	unsigned short ushTenderNo;				//11
	unsigned char  uchCCTenderTrigger;		//13

	unsigned char  unUsExtForm[30];			//14
};

struct trs_info2_ext_pos_form_
{
    unsigned char  opcode;         //0x70	//0	<Opcode Value="0x70"/>
    unsigned char  function;       //0xD0	//1	<Opcode Value="0xD0"/>
	unsigned char  SubFunction;		// offset2: 1-InputDestinationEFTAccountType

	union
	{
		struct ExtPosFormEftAccountTypes_ ExtPosFormEftAccountTypes;

		unsigned char  uchInfo2ExtForm[41];		//3
	}ExtDataPosForm;

    struct   trans_tail_  tail;				//44
};


struct trs_info_segment_
{
	unsigned char	opcode;    //0x60				//0	<Opcode Value="0x60"/>
	unsigned char	function;  //0x8E				//1	<Opcode Value="0x8E"/>

	unsigned char	sCardNo[10];					//2   card no in BCD

	unsigned char	bSegmentInsert1		:1;			//12  0 - Delete Segment value
	unsigned char	bSegmentInsert2		:1;			//	  1 - Insert value into segment		
	unsigned char	bSegmentInsert3		:1;
	unsigned char	bSegmentInsert4		:1;
	unsigned char	bSegmentInsert5		:1;
	unsigned char	bSegmentInsert6		:1;
	unsigned char	bSegmentInsert7		:1;
	unsigned char	bSegmentInsert8		:1;

	unsigned char	bSegmentInsert9				:1;	//13
	unsigned char	bSegmentInsert10			:1;

	unsigned char	SegmentUpdatedInChipCard	:1;
	unsigned char	nu							:5;

	unsigned short	shSegment1;						//14
	unsigned short	shSegment2;						//16
	unsigned short	shSegment3;						//18
	unsigned short	shSegment4;						//20
	unsigned short	shSegment5;						//22
	unsigned short	shSegment6;						//24
	unsigned short	shSegment7;						//26
	unsigned short	shSegment8;						//28
	unsigned short	shSegment9;						//30
	unsigned short	shSegment10;					//32

	unsigned char	reserved[10];					//34

	struct   trans_tail_  tail;                     //44
};

struct trs_info_coupon_redemption_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0xD3                 //1	<Opcode Value="0xD3"/>

	unsigned char card_no[20];                      //2
	unsigned char coupon_no[20];                    //22
	  
	unsigned short message_id;                      //42 //#11599 coupon message id

	struct   trans_tail_  tail;                     //44
};

struct trans_info_rolltainer_item_
{
	unsigned char opcode;                     //0x60
	unsigned char function;                   //0xEA

    unsigned char rolltainer_descr[30];       //2 
	unsigned char rolltainer_code[7];         //32
	long rolltainer_price;                    //39

	unsigned char nu[1];                      //43

	struct   trans_tail_  tail;				  //44	Transaction tail
};

struct trs_quick_update_
{
	unsigned char  opcode;	         //0x88	<Opcode Value="0x88"/>
	unsigned char  subopcode;	     // 1
	         			             // 1 - write
	unsigned char  func;	         // 2
                                     // 1 - write data
                                     // 2 - increment (according to size)
	unsigned char  qdx_no;	         // 3
	char           index[12];	     // 4	//If Relative file then record number left justified.
	short          position;	     // 16 possition within record
	unsigned char  size;	         // 18
   
   
	struct fc_flags_
	{
		unsigned char send_maint :1;
		unsigned char update_req :1;  
		unsigned char insert_req :1;
		unsigned char nu         :5;
		
		
	}flags;
   
   unsigned char  org_pos_no;        // 20
   unsigned char  data[23];	         // 21

   struct   trans_tail_  tail;       //44
};


struct trs_info_belgacom_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0xD4                 //1	<Opcode Value="0xD4"/>

	unsigned char encrypted_tid[7];                //2 //bcd
	unsigned char counter_offset;                  //9 0-9
	unsigned char encryption_table_ref;            //10 0,3,4
	short         store_num;					   //11
	short         new_counter;                     //13
	short         message_id;                      //15
	long          amount;                          //17 
	  
	unsigned char reserved[23];                    //21

	struct   trans_tail_  tail;                    //44
};

struct trs_info_points_ext_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0xD7                 //1	<Opcode Value="0xD7"/>

	short message_id;								//2
	long points;								    //4

	unsigned char barcode_points	:1;             //8
	unsigned char origion_points	:1;
	unsigned char bForgottenCard	:1;				// FSD#68201
	unsigned char nu4				:1;
	unsigned char opt_was_cancelled :1;				//Issue #3778SL
	unsigned char nu6				:1;
	unsigned char nu7				:1;
	unsigned char nu8				:1;

	unsigned short ushStoreNumber;					//9	FSD#68201

	long cancelled_points;						    //11
	long lTotalPointsAcc;							//15 TD#154072 from CR130941_ExtPoints
	unsigned char uchDecimalPlaces;                 //19 //TD#179171

	unsigned char nu[24];                           //20


	struct   trans_tail_  tail;                     //44
};


//Enh #9749 PHONE_CARD Hannaford AmyG
struct trs_phone_card_act_
{
    unsigned char opcode;         //0x60	//0	<Opcode Value="0x60"/>
    unsigned char function;       //0xD8	//1	<Opcode Value="0xD8"/>

	unsigned char ActionType;				//2
	unsigned char CardNo[22];				//3
	unsigned char AuthNo[9];				//25

    unsigned char ManuallySwipe			:1;	//34 card was swiped manualy
	unsigned char PhoneCardReturn		:1;	//Issue #8532SL
    unsigned char PhoneCardVoid			:1;	//Issue #8532SL
	unsigned char DeactivationAllowed	:1;	//Issue #8532SL
    unsigned char nu					:4; 

	unsigned char ActivationType;			//35 Issue #2711SL
	long		  Account2Balance;			//36 Issue #8532SL
	long		  PhoneCardDollarBalance;	//40 Issue #8532SL

    struct   trans_tail_  tail;				//44
};

//Issue #8532SL
struct trs_phone_card_act_ext_
{
    unsigned char opcode;         //0x70	//0	<Opcode Value="0x70"/>
    unsigned char function;       //0x49	//1	<Opcode Value="0x49"/>

	unsigned char Template[10];				//2
	unsigned char BarcodeDesc[20];			//12
	unsigned char ItemExpDate[7];			//32
	long		  TrsAmount;				//39

	unsigned char nu[1];					//43

    struct   trans_tail_  tail;				//44
};

//Issue #8532SL
struct trs_prepaid_wireless_
{
    unsigned char opcode;         //0x70	//0	<Opcode Value="0x70"/>
    unsigned char function;       //0x4A	//1	<Opcode Value="0x4A"/>

	unsigned char ActionType;				//2
	unsigned char CardNo[22];				//3
	unsigned char AuthNo[9];				//25

    unsigned char ManuallySwipe			:1;	//34 card was swiped manualy
	unsigned char WirelessReturn		:1;	//
    unsigned char WirelessVoid			:1;	//
	unsigned char DeactivationAllowed	:1;	//
    unsigned char nu					:4; 

	unsigned char ActivationType;			//35
	long		  TrsAmount;				//39
	unsigned char nu2[4];					//40

    struct   trans_tail_  tail;				//44
};

//Issue #8532SL
struct trs_prepaid_wireless_ext_
{
    unsigned char opcode;         //0x70	//0	<Opcode Value="0x70"/>
    unsigned char function;       //0x4B	//1	<Opcode Value="0x4B"/>

	unsigned char Template[10];				//2
	unsigned char BarcodeDesc[20];			//12

	unsigned char nu[12];					//32

    struct   trans_tail_  tail;				//44
};

//Issue #8532SL
struct trs_prepaid_wireless_ext2_
{
    unsigned char opcode;         //0x70	//0	<Opcode Value="0x70"/>
    unsigned char function;       //0x4C	//1	<Opcode Value="0x4C"/>

	unsigned char PINNumber[20];			//2
	unsigned char ControlNumber[20];		//22

	unsigned char nu[2];					//42

    struct   trans_tail_  tail;				//44
};

struct trs_chipcard_info_
{
	unsigned char	opcode;				//0x60	<Opcode Value="0x60"/>
	unsigned char	function;			//0x8F	<Opcode Value="0x8F"/>

	unsigned char	sCardNo[10];		// chip card no in BCD
	unsigned char	sData[24];				
	unsigned char	chCardType;
	short			shStatus;
	long			lAmount;

	unsigned char	bEmployeeCard;		//FSD13421 - Employee Card

	struct   trans_tail_  tail;
};


struct trs_chipcard_handle_msg_
{
	unsigned char	opcode;				//0x60	<Opcode Value="0x60"/>
	unsigned char	function;			//0x99	<Opcode Value="0x99"/>
	unsigned char	sub_func;

	unsigned char	sCardNo[10];		//3 chip card no in BCD
	unsigned char	chMsgLevel;			//13
	short			shMsgNumber;		//14
	short			shMsgUpdateStatus;	//16

	long			lProviderError;		//18

	unsigned char	nu[22];				//22

	struct   trans_tail_  tail;			//44 
};



/* ON-LINE Trans info : script was selected */
struct trs_onl_info_script_sales_
{
    unsigned char opcode;             	//offset 0 - opcode 0x60	<Opcode Value="0x60"/>
    unsigned char function;           	//offset 1 - function 0xD5	<Opcode Value="0xD5"/>
   
	unsigned char status;               //offset 2  - Status of prescription:
	                                    //   0 - uncommitted
	                                    //   1 - commited	                                   
	unsigned char surname[18];          //offset 3  - Patient's surname
	unsigned char patient_no[3];        //offset 21 BCD - Patient's number
    unsigned char script_no[3];         //offset 24 BCD

	unsigned char use_org_pos_no   :1;	//offset 27
  	unsigned char opt_void_script  :1;  //script is voided
	unsigned char opt_return_script:1;  //script is returned
    unsigned char opt_nu7          :5;      
	unsigned char org_pos_no;           //offset 28  
    
	unsigned char	seq_no;				//29	Script sequence #
	unsigned char   script_no4[4];      //30 BCD
    unsigned char	nu[10];				//34


    struct   trans_tail_  tail;         //offset 44
};

/* Payment info transaction for script */
struct  trs_info_script_paym_
{
    unsigned char opcode;             	//offset 0 opcode  0x60	<Opcode Value="0x60"/>
    unsigned char function;           	//offset 1 function 0xD6	<Opcode Value="0xD6"/>
	unsigned char sub_func;			    //2	1-inf1 2-inf2	
   
	union
    {
		struct 
		{
			unsigned char status;               //offset 3  - Status of prescription:
					                            //   0 - uncommitted
							                    //   1 - commited
			unsigned char surname[18];          //offset 4  - Patient's surname
			unsigned char patient_no[3];        //offset 22 BCD - Patient's number
			unsigned char script_no[3];         //offset 25 BCD

			unsigned char opt_void_script  :1;  //offset 28 script is voided
			unsigned char opt_rtrn_script  :1;  //script is returned
			unsigned char opt_offln_script :1;  //not found script indicator  // Pharmacy_SA
			unsigned char opt_auto_charge:1;//		auto-charge scrpt cr#3281	
			unsigned char opt_void_ret_com:1;//28	void of a returned committed script
			unsigned char opt_nu7          :3;  //not used

		    unsigned char commited_date[3];     //offset 29, date script commited from QDX // Pharmacy_SA
			unsigned long offline_script_no;    //offset 32, offline script number (max 8 digits).

			unsigned char seq_no;			//36
			unsigned char script_no4[4];	//37	BCD
			unsigned char	nu[2];			//41
		}inf1;

    	struct 
		{
			unsigned char drug_desc[14];        //offset 3  - Drug description	                                    
			unsigned char strength[10];         //offset 17 - Strength of drug
			long price;                         //offset 27 - Price of drug
			unsigned char tax_code;             //offset 31 - Tax-code
						
			unsigned char seq_no;				//32
			unsigned char nu[10];				//33	not used
		}inf2;
    };

	unsigned char opt_plu	:1;				//43	script sold as plu cr#3040
	unsigned char opt_void  :1;				//43	script voided
	unsigned char opt_rev_sold_upd_PO:1;	//43	Automatic reversal of a script that was sold after update from PO
	unsigned char opt_nu	:5;				//43	not used

    struct   trans_tail_  tail;         //offset 44
};

//FS1064
/* Barcode Programming info transaction */
struct trs_info_barcode_details_
{
    unsigned char opcode;             		//offset 0 - opcode 0x60	<Opcode Value="0x60"/>
    unsigned char function;           		//offset 1 - function 0xD9	<Opcode Value="0xD9"/>
   
	unsigned char type;						//offset 2  - Barcode Type:
											//   0 - PLU
											//   1 - Tender	                                   
											//   2 - Department
											//   3 - Promotion	                                   
											//   4 - Loyalty
											//   5 - Points	                                   
											//   6 - Segment
											//   7 - Save\Recall	                                   
											//   8 - Utility
	unsigned char barcode_len;				//offset 3 - Barcode length
	struct									//ofsset 4
	{
		unsigned char opt_scan         :1;
		unsigned char opt_key_entered  :1;
		unsigned char opt_ignore       :1;	//FSD11575
		unsigned char bProduced        :1;	//FSD18888
		unsigned char bValidated       :1;	//FSD18888
		unsigned char bCatalinaCoupon  :1;	//FSD19167 (FSD25612)
		unsigned char bCouponRejected  :1;	//FSD19167 (FSD25612)
		unsigned char opt_cancel	   :1;	
	}Options;

	unsigned char barcode[30];				//offset 5  BCD - Barcode buffer (right justify, leading zeroes)
	unsigned char uchUniqueKeyIdentifier;	//offset 35	FSD11575
	unsigned long ulBarcodeValue;           //offset 36 FSD25612
	unsigned char uchSubType;				//offset 40	FSD39663 - Storeline Parking Validation
	unsigned short ushBarcodeLineTemplateNo;//offset 41	FSD39663 - Storeline Parking Validation
	
	unsigned char bParkingVoucher		:1; //offset 43 FSD39663
	unsigned char bSaleFailure			:1; //offset 43 FSD#59750
	unsigned char bExtensionTrsUsed		:1;
	unsigned char bCouponConditionalOverride	:1;		//offset 43  FSD#139444
	unsigned char bLinkedToDataBar		:1;				//offset 43 FSD309681
	unsigned char bExtensionTrsExists	:1;				//offset 43 FSD438581
	unsigned char bAreaScaleItem		:1;				//offset 43 FSD439698
	unsigned char nu					:1;	//offset 43

    struct   trans_tail_  tail;				//offset 44
};


/*----------------------------------------------------------------------
TRANS_INFO3_LOAD_BARCODE_TO_DB
Opcode:		0x80
Subopcode:	0x07
FSD67534
Load Barcode to DB info transaction 
-----------------------------------------------------------------------*/
struct trs_info3_load_barcode_to_DB_
{
    unsigned char opcode;             		//0 - opcode 0x80	<Opcode Value="0x80"/>
    unsigned char function;           		//1 - function 0x07	<Opcode Value="0x07"/>
	long lQty;								//2
	unsigned char type;						//6 - Barcode Type: currently support only PLU (0)
											//   0 - PLU
											//   1 - Tender	                                   
											//   2 - Department
											//   3 - Promotion	                                   
											//   4 - Loyalty
											//   5 - Points	                                   
											//   6 - Segment
											//   7 - Save\Recall	                                   
											//   8 - Utility

	unsigned char bLoadBarcodeToDB		:1;	//7
	unsigned char nu					:7;	
	unsigned char barcode[30];				//8  BCD - Barcode buffer (right justify, leading zeroes)

	unsigned char nu_1[6];					//38
    struct   trans_tail_  tail;				//offset 44
};

/*----------------------------------------------------------------------
TRANS_INFO3_ANPR_DATA
Opcode:		0x80
Subopcode:	0x08
FSD67534
Save ANPR data to transaction
-----------------------------------------------------------------------*/
struct trs_info3_ANPR_Data_
{
    unsigned char opcode;             		//0 - opcode 0x80	<Opcode Value="0x80"/>
    unsigned char function;           		//1 - function 0x08	<Opcode Value="0x08"/>
	char szRegistrationNumber[7];			//2
	char szANPRTransactionNumber[5];		//9
	unsigned char nu1[30];					//14
	struct   trans_tail_  tail;				//offset 44
};

//Enh #10812 Signature Capture AmyG
struct trs_sigcap_hdr_
{
    unsigned char opcode;			//0x60	<Opcode Value="0x60"/>
    unsigned char function;			//0xDC	<Opcode Value="0xDC"/>
	unsigned char sub_func;			//0x01 Header record	<Opcode Value="0x01"/>

	short buffer_type;				//1=MTX; 2=INGENICO (2 byte BIN)
	short unzipped_buffer_size;
	short num_of_sigcap_seq;
	unsigned char nu1[35];

    struct   trans_tail_  tail;
};

//Enh #10812 Signature Capture AmyG
struct trs_sigcap_data_
{
    unsigned char opcode;			//0x60	<Opcode Value="0x60"/>
    unsigned char function;			//0xDC	<Opcode Value="0xDC"/>
	unsigned char sub_func;			//0x02 Data record	<Opcode Value="0x02"/>

	unsigned char seq_no;			//bcd 0x00 to 0x99
	unsigned char data[40];

    struct   trans_tail_  tail;
};

/*----------------------------------------------------------------------
Opcode:		0x60 
Subopcode:	0xE0
customer order status record
-----------------------------------------------------------------------*/
struct trs_info_order_status_               //OFS	Description
{
    unsigned char opcode;       		    //0     0x60	<Opcode Value="0x06"/>
	unsigned char function;		   		    //1		0xE0	<Opcode Value="0xE0"/>
	unsigned char sub_function;             //		1-order header status	<Opcode Value="0x01-0x02"/>
	                                        //		2-item line status

	unsigned char order_number[5];          //3   	Order number
	unsigned char order_reference_number[5];//8     Customer ref no.
 	unsigned char order_date[3];            //13	Order date
	unsigned char error_code; 		        //16	Error table(errors 1-255)
 
	union									//17
	{
		struct                              //17	Order header status 
		{
			unsigned char customer_no[10];  //17    Customer number      	             		
			unsigned char error_data[7];   //27    Error data
			unsigned char  inv_no[8];		//34    Invoice number
			unsigned char  order_status;    //42    0 - Successful
			                                //      1 - Errors during process 
		}inf1;								//43

		struct                              //17	Item line status
		{
			unsigned char  plu_no[7];       //17	Item code
			unsigned char  nu[19];          //24	not used
		}inf2;								//43
    };	

    unsigned char  CustOrderOnTill	  :1; //43	CR19916
	unsigned char bWebPaymentError    :1;   //43    Not used
    unsigned char bWebPaymentDenial   :1;
    unsigned char bOrderLocked        :1;
	unsigned char not_used            :4; 

	struct   trans_tail_  tail;				//44	TRS tail
};											//64

struct trs_info_ticket_points_
{
	unsigned char opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char function;  //0xDA                 //1	<Opcode Value="0xDA"/>

	long prom_no;                                   //2
	long points;								    //6
	unsigned char redeeming_fg;                     //10

	unsigned char reserved[33];                     //11
	
	struct   trans_tail_  tail;                     //44
};

struct trs_info_service_desk_vchr_
{
	unsigned char   opcode;    //0x60                 //0	<Opcode Value="0x60"/>
	unsigned char   function;  //0xDB                 //1	<Opcode Value="0xDB"/>

	unsigned char   plu_code[7];					  //2		plu number (BCD)
	unsigned short  dept;				           	  //9		Department number
	long            points;							  //11      Points accum to voucher.(sorry voucher)
	long            tender_amt;						  //15      Amount accum to tender voucher - bon avoir
	unsigned char   pts_return_type;                  //19      return type of points voucher (sorry voucher)
	unsigned char   tndr_return_type;                 //20      return type of tender voucher-bon avoir
	unsigned char   reason_code;                      //21      reason code of points voucher(sorry voucher)
	unsigned char   trs_type;                         //22      The type of the trs TENDER/POINTS/TENDER AND POINTS....

	unsigned char   opt_cancel			:1;           //23
	unsigned char   opt_was_cancel		:1;
	unsigned char   nu					:6;

	unsigned char   reserved[20];                     //24      To be filled.
	struct          trans_tail_  tail;                //44
};


// new seq type defines
#define NEW_SEQ_AFTER_EOD			1
#define NEW_SEQ_AFTER_COLD_START	2
#define NEW_SEQ_AFTER_RESET_TRS		3

struct trs_new_seq_num_ // FS1079
{
    unsigned char opcode;       		// TRANS_NEW_SEQ_NUM 0xB0 // TRC	<Opcode Value="0xB0"/>
	unsigned char type;          // 1   see list above
	unsigned char data[42];		 // 2
	struct   trans_tail_  tail;	 // 44						
};


struct trs_info_order_number_ 
{
    unsigned char opcode;       		// 0x60	<Opcode Value="0x60"/>
	unsigned char function;             // 0xDD	<Opcode Value="0xDD"/>
	unsigned char order_no[6];          // 2 	
	unsigned char sExtendedID[10];		// 8  order id, FSD5123
	unsigned char uchSeq;               // 18 - sequence of the transaction (1,2,3 etc Due to the fact that several order numbers will be sent in  a ticket..
	unsigned char sAdditionalID[10];		// 19 -FSD34074
	unsigned char not_used[13];		    // 29

	unsigned char bIgnore		:1;		// 42 ignore flag (for cancel home delivery/parcel pickup) 
	unsigned char bNU			:7;		// 
	unsigned char orderType;			// 43 order type, 1 - HOME_DELIVERY 
										//				  2 - PARCEL_PICKUP (FSD5123)
	struct   trans_tail_  tail;	        // 44						
};

struct trs_info_price_list_id_ 
{
    unsigned char opcode;       		// 0x60	<Opcode Value="0x60"/>
	unsigned char function;             // 0xDE	<Opcode Value="0xDE"/>
	unsigned short PriceListID;         // 2     
	unsigned char  Source;              // 4 (1 - from check out bank : 2 - from customer scheme) 
	unsigned char not_used[39];		    // 5
	struct   trans_tail_  tail;	        // 44						
};


//------------------------------------------------
//FS1081
struct trs_info_cust_acct_ID_
{
    unsigned char opcode;            //0x60   //0	<Opcode Value="0x60"/>
    unsigned char function;          //0xDF   //1	<Opcode Value="0xDF"/>

    unsigned char acct_num[10];      //BCD    //2

	long  accout_limit;                       //12
	unsigned char acct_pay_type;              //16

	//flags
	unsigned char loyalty_related                :1;     //17
	unsigned char offline                        :1;     //17
	unsigned char force_account                  :1;     //17
	unsigned char charge_ctrl_per_item           :1;     //17
	unsigned char offline_acct_as_cash_only      :1;     //17
	unsigned char bVoidCustAccnt                 :1;     //17 //FSD16729 Void Customer Account
	unsigned char bNextAppearanceNoticeDislpayed :1;     //17  FSD 18554
	unsigned char bMCRUsed                       :1;     //17   FSD43007

	long prv_balance;                          //18
	unsigned short pospond_pay_period;         //22
	unsigned char surcharge_type;              //24
	long          surcharge_rate;              //25
	unsigned char uchCustType;                 //29
	unsigned char uchSchemeNo;                 //30  //FS3938 Member Scheme number from barcode definition

	long          lCustAccntSurchRate;         //31  //FSD16729 Percentage from Reward enter by Cashier promotion ('Extra reward from customer account' type).
    unsigned long ulDiscountPercentage;		   //35	 //Defect #26776
	long		  lPlannedAmount;			   //39  TD#63158

	unsigned char bRecalculateCustomerData		:1; //43  //FSD278923 C&C Invoice Payment at POS Avivp , for recalculating customer debt
	unsigned char unusedBits					:7;	//43

    struct   trans_tail_  tail;                //44
};

//FDC;CR15968FS
struct trs_info_fuel_disc_cpn_
{
	unsigned char opcode;      //0x60	<Opcode Value="0x60"/>
	unsigned char function;    //0xE1	<Opcode Value="0xE1"/>

	short			RebateFileID;		//2
	long			IDReference;		//4
	unsigned char	QID;				//8
	unsigned char	RebateNumber[3];	//9		BCD; pak/unpak
	unsigned char	RebateExpDate[3];	//12	BCD; pak/unpak
	long			RebateQAmount;		//15
	unsigned short	RebateDiscount;		//19
	long			TransTotal;			//21

	unsigned short	error_code;			//25	1 - error code, 0 - OK

	unsigned char	optFromFuelPromo	:1;	//27
	unsigned char	optNotUsed			:7;	//27

	unsigned short	days;					//28

	unsigned char   nu[14];					//30

	struct   trans_tail_  tail;
};

//--------------------------------
//FS1081
struct trs_info_cust_acct_tendering_
{
    unsigned char opcode;            //0x60   //0	<Opcode Value="0x60"/>
    unsigned char function;          //0xE5   //1	<Opcode Value="0xE5"/>
	unsigned char sub_function;      //0xEF   //2  //	
	                                              // 1- account_charge
	                                              // 2-account payment
												  // 3-account reversal.
												  // 4-Authorized over limit
												  // 5-Payment Cheque

												  // FSD24617
												  // 6-Charge Planned
												  // 7-Transfer from Planned to Used
												  // 8-Reduce Planned

    unsigned char acct_num[10];      //BCD    //3
    long payment_amt;                         //13
	unsigned char tender_due_day;             //17
	unsigned char tender_due_month;             //18
	unsigned short tender_due_year;             //19

	unsigned char uchAcctPaymDocSource;			//21	FSD 18556 , document issued entity
															//0 - POS
															//1 - FO
	unsigned char uchAcctPaymDocType[2];		//22	FSD 18556 , account payment doc TYPE
	unsigned char uchPosNum;					//24	FSD 18556 - The doc issued pos number
	unsigned char bcdAcctPaymDocID[6];			//25	FSD 18556 , BCD account payment doc ID

    unsigned char bEntrySource			:1;		//31 OmerC used by FO only
	unsigned char bNU					:7;		//31

	long lOriginalPaymentAmt;					//32 // TD#37861 GinatB - Save original amount in TRANS_INFO_CUST_ACCT_TENDERING
	
	unsigned char reserved[8];	                //36

    struct   trans_tail_  tail;            //44
};

//FS1094
struct trs_info_barcode_coupon_
{
    unsigned char opcode;			//0x60   //0	<Opcode Value="0x60"/>
    unsigned char function;         //0xE6   //1	<Opcode Value="0xE6"/>
	
	unsigned char code[7];			//BCD    //2
	unsigned char org_code[7];		//BCD    //9
    long count;                              //16
	long prom_no;                            //20
	
	short reward;							 //24 //FS5006
	
	unsigned char uchReceiptSeperation;		 //26 FSD11024 for reciept cut indication
	
	unsigned char reserved[17];              //27


    struct   trans_tail_  tail;              //44
};

//Enh #13271: Needed for Hannaford offline tender report. AmyG
struct trs_info_offline_eft_				//OFS	Description
{
    unsigned char opcode;					//0x60	//0	<Opcode Value="0x60"/>
    unsigned char function;					//0xE7	//1	<Opcode Value="0xE7"/>

    unsigned short  no;						//2		Tender number

    unsigned char opt_offline_credit   :1;	//4		
    unsigned char opt_offline_EBT      :1;	//4
    unsigned char opt_nu		       :6;	//4	

    unsigned char account[10];				//5		Account number
    unsigned char exp_date[2];				//15	Expiry date
    long          amount;					//17	Tender amount or cashback
    unsigned char auth_no[4];				//21	Authorization number
	unsigned char EBT_Voucher_No[11];		//25	EBT voucher no
    unsigned char account_len;				//36
    unsigned char auth_no_len			:4;	//37
	unsigned char len_nu				:4;

    unsigned char nu[6];					//38
    
    struct   trans_tail_  tail;				//44	Transaction tail
};

//FS1085
struct trs_info_pos_report_
{
    unsigned char opcode;			//0x60   //0	<Opcode Value="0x60"/>
    unsigned char function;         //0xE8   //1	<Opcode Value="0xE8"/>

	short          store_no;                 //2
	short          pos_no;                   //4
	unsigned long  ulLongStoreNumber;        //6 FSD63030
	unsigned char  filler[2];                //10
	unsigned short z_count;                  //12
